Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/3d-monolayer.po
Languages: es, pt_br

source: We will start by shrinking the nuclei to make them more seed-like by adding an **ErodeObjects** module. Use the *ball* structuring element with a size of *5*. Select “Yes” for the “Prevent object removal” option in order to avoid losing any nuclei.
es: Empezaremos encogiendo los núcleos para hacerlos más parecidos a semillas añadiendo un módulo **ErodeObjects**. Utiliza el elemento estructurante *ball* (bola) con un tamaño de *5*. Seleccione "Sí" en la opción "Evitar la eliminación de objetos" para no perder ningún núcleo.
pt_br: Vamos começar encolhendo os núcleos para deixá-los mais “parecidos com sementes”, adicionando um módulo **ErodeObjects**. Use o elemento estruturante *ball* com tamanho 5. Selecione “Yes” na opção “Prevent object removal” para evitar perder qualquer núcleo.

source: We’ve found that we can achieve the best results by applying **ErodeObjects** to the output of the **Watershed** module rather than the resized Nuclei that are at the original size (since the **Watershed** module output has been downsampled, the resulting seeds from **ErodeObjects** are smaller and more seed-like). So, select the *downsizedNuclei* object as input. Name the output *erodedDownsizedNuclei*.
es: Encontramos que podemos lograr los mejores resultados aplicando **ErodeObjects** a la salida del módulo **Watershed** en lugar de los núcleos redimensionados que tienen el tamaño original (ya que la salida del módulo **Watershed** se ha reducido la resolución, las semillas resultantes de **ErodeObjects** son más pequeñas y más parecidas a semillas). Entonces, seleccione el objeto *downsizedNuclei* como entrada. Nombra la salida como *erodedDownsizedNuclei*.
pt_br: Descobrimos que podemos obter os melhores resultados aplicando **ErodeObjects** à saída do módulo **Watershed** em vez dos núcleos redimensionados que estão no tamanho original (já que a saída do módulo **Watershed** foi reduzida, as sementes resultantes de **ErodeObjects** são menores e mais parecidas com sementes). Portanto, selecione o objeto *downsizedNuclei* como entrada. Nomeie a saída como *erodedDownsizedNuclei*.

source: Resize these seeds using the **ResizeObjects** module with a factor of *2*. Name the output *erodedResizedNuclei*.
es: Cambie el tamaño de estas semillas utilizando el módulo **ResizeObjects** con un factor de *2*. Nombre la salida *erodedResizedNuclei*.
pt_br: Redimensione essas sementes usando o módulo **ResizeObjects** com um fator de *2*. Nomeie a saída como *erodedResizedNuclei*.

source: Next convert the eroded and resized nuclei to an image using the **ConvertObjectsToImage** module. Select the *uint16* color format. This image will serve as the seeds for segmenting the cells. Name the output *cellSeeds*.
es: A continuación, convierta los núcleos erosionados y redimensionados en una imagen utilizando el módulo **ConvertObjectsToImage**. Seleccione el formato de color *uint16*. Esta imagen servirá como semillas para segmentar las células. Nombre la salida *cellSeeds*.
pt_br: Em seguida, converta os núcleos erodidos e redimensionados em uma imagem usando o módulo **ConvertObjectsToImage**. Selecione o formato de cor *uint16*. Essa imagem servirá como as sementes para segmentar as células. Nomeie a saída como *cellSeeds*.

source: Transform the membrane channel into cytoplasm signal
es: Transformar el canal de membrana en señal de citoplasma
pt_br: Transformando o canal de membrana em sinal de citoplasma

source: The **Watershed** module finds objects that have bright signal, so the cytoplasm that will define the cell volume should have bright signal. However, this is not the case in the membrane channel; it must be transformed into an image where the cytoplasm is bright and the boundaries between the cells are dark. Therefore, we will invert the membrane channel to achieve this effect.
es: El módulo **Watershed** encuentra objetos que tienen una señal brillante, por lo que el citoplasma que definirá el volumen célula debe tener una señal brillante. Sin embargo, este no es el caso en el canal de membrana; debe transformarse en una imagen donde el citoplasma sea brillante y los límites entre células sean oscuros. Por tanto, invertiremos el canal de la membrana para conseguir este efecto.
pt_br: O módulo **Watershed** encontra objetos que apresentam sinal brilhante; portanto, o citoplasma que vai definir o volume celular deve aparecer com sinal brilhante. No entanto, isso não acontece no canal de membrana: precisamos transformá-lo em uma imagem em que o citoplasma fique brilhante e as fronteiras entre as células fiquem escuras. Por isso, vamos inverter o canal de membrana para obter esse efeito.

source: Add a **Threshold** module and threshold the original membrane image (*origMemb*). We find that the *Otsu three-class* method with middle intensity pixels assigned to the foreground works well, but feel free to try others. Name the output *MembThreshold*.
es: Añada un módulo **Threshold** y umbralice la imagen original de la membrana (*origMemb*). Encontramos que el método *Otsu three-class* con píxeles de intensidad media asignados al primer plano funciona pocillo, pero siéntase libre de probar otros. Nombre la salida *MembThreshold*.
pt_br: Adicione um módulo **Threshold** e limite a imagem original da membrana (*origMemb*). Achamos que o método *Otsu three-class* com pixels de intensidade média atribuídos ao primeiro plano funciona bem, mas fique à vontade para experimentar outros. Nomeie o resultado como *MembThreshold*.

source: Add an **ImageMath** module. Within the **ImageMath** module choose the *Invert* operation, and invert the thresholded membrane. Name the output *MembInvert*.
es: Agregue un módulo **ImageMath**. Dentro del módulo **ImageMath**, elija la operación *Invert* e invierta la membrana con umbral. Asigne a la salida el nombre *MembInvert*.
pt_br: Adicione um módulo **ImageMath**. Dentro do módulo **ImageMath** escolha a operação *Invert* e inverta a membrana com limiar. Nomeie a saída como *MembInvert*.

source: Add a **RemoveHoles** module to remove the small holes in the segmentation of the cell interior. This helps to prevent the cells from being split during the Watershed segmentation. Choose a size of *20*. Name the output *MembInvertRemoveHoles*.
es: Añadir un módulo **RemoveHoles** para eliminar los pequeños agujeros en la segmentación del interior de las células. Esto ayuda a evitar que las celcélulas se dividan durante la segmentación con el método Watershed. Elija un tamaño de *20*. Nombre la salida *MembInvertRemoveHoles*.
pt_br: Adicione um módulo **RemoveHoles** para remover os pequenos buracos na segmentação do interior da célula. Isso ajuda a evitar que as células sejam divididas durante a segmentação do módulo Watershed. Escolha um tamanho de *20*. Nomeie a saída como *MembInvertRemoveHoles*.

source: Add another **ImageMath** module. Add all of the original images together. This creates a composite image that will be used in the following steps to define where cells are present and the background above and below the cells. Name the output *Monolayer*.
es: Añada otro módulo **ImageMath**. Añada todas las imágenes originales juntas. Esto crea una imagen compuesta que se utilizará en los siguientes pasos para definir donde las células están presentes y el fondo por encima y por debajo de las células. Nombre la salida *Monolayer*.
pt_br: Adicione outro módulo **ImageMath**. Some todas as imagens originais. Isso cria uma imagem composta que será usada nas etapas seguintes para definir onde as células estão presentes e onde fica o plano de fundo acima e abaixo delas. Nomeie a saída como *Monolayer*.

source: Add a **Resize** module to resize the Monolayer with a *Resizing factor* of *0.25* for X and Y (keep a factor of 1.0 for Z). Downsampling the image makes processing faster and decreases noise. Name the output *DownsizedMonolayer*.
es: Añada un módulo **Resize** para redimensionar la Monocapa con un *Factor de redimensionamiento* de *0,25* para X e Y (mantener un factor de 1,0 para Z). Reducir el tamaño de la imagen hace que el procesado sea más rápido y disminuye el ruido. Nombre la salida *DownsizedMonolayer*.
pt_br: Adicione um módulo **Resize** para redimensionar o Monolayer com um fator de redimensionamento, *Resizing factor*, de *0,25* para X e Y (mantenha um fator de 1,0 para Z). A redução da amostragem da imagem torna o processamento mais rápido e diminui o ruído. Nomeie a saída como *DownsizedMonolayer*.

source: Add a **Closing** module. Choose a size of *17* to blend the signal together. The result should look like a cloud of signal where the monolayer resides. Name the output *ClosedDownsizedMonolayer*.
es: Añada un módulo de **Closing**. Elige un tamaño de *17* para mezclar la señal. El resultado debería parecerse a una nube de señal donde reside la monocapa. Nombre la salida *ClosedDownsizedMonolayer*.
pt_br: Adicione um módulo **Closing**. Escolha um tamanho de *17* para misturar o sinal. O resultado deve ser parecido com uma nuvem de sinal onde reside a monocamada. Nomeie o resultado como *ClosedDownsizedMonolayer*.

source: Add a **Resize** module to resize the closed Monolayer back to its original size, *Resizing factor* of *4* for X and Y (keep a factor of *1.0* for Z). Name the output *ResizedClosedMonolayer*.
es: Añada un módulo **Resize** para redimensionar la Monocapa cerrada a su tamaño original, *Factor de redimensionamiento* de *4* para X e Y (mantenga un factor de *1.0* para Z). Nombra la salida *ResizedClosedMonolayer*.
pt_br: Adicione um módulo **Resize** para redimensionar o Monolayer fechado de volta ao tamanho original, ajustando o fator de redimensionamento, *Resizing factor* de *4*, e para X e Y (mantenha um fator de *1,0* para Z). Nomeie a saída como *ResizedClosedMonolayer*.

source: Add a **Threshold** module and threshold the smoothed monolayer image. The idea is to end up with a 3D mask of the region where the cells of the monolayer exist in. We found that using a global Otsu method with three classes (middle class identified as foreground) works well for this example. This will define what is and is not monolayer. Name the output *MonolayerMask*.
es: Añada un módulo **Threshold** y umbralice la imagen suavizada de la monocapa. La idea es terminar con una máscara 3D de la región en la que existen las células de la monocapa. Hemos encontrado que el uso de un método global de Otsu con tres clases (clase media identificada como primer plano) funciona bien para este ejemplo. Esto definirá lo que es y lo que no es monocapa. Nombre la salida *MonolayerMask*.
pt_br: Adicione um módulo **Threshold** e aplique um threshold à imagem da monocamada suavizada. A ideia é obter uma máscara 3D da região em que as células da monocamada estão. Observamos que o uso de um método Otsu global com três classes (com a classe intermediária identificada como primeiro plano) funciona bem para este exemplo. Isso vai definir o que é e o que não é monocamada. Nomeie o resultado como *MonolayerMask*.

source: Note that most of the middle planes of the stack should be completely white (part of the monolayer), while the regions above and below are primarily black (not part of the monolayer).
es: Observe que la mayor parte de los planos centrales del stack deben ser completamente blancos (parte de la monocapa), mientras que las regiones por encima y por debajo son principalmente negras (no forman parte de la monocapa).
pt_br: Observe que a maioria dos planos centrais da pilha (stack) deve estar completamente branca (parte da monocamada), enquanto as regiões acima e abaixo devem estar principalmente pretas (fora da monocamada).

source: Add a **MaskImage** module. You will use an *Image* as a mask (the MonolayerMask image generated in the previous step). In this case, the mask does not need to be inverted. Note that the planes on the bottom and top of the z-stack are black in the masked image. Name the output *MembMasked*.
es: Añada un módulo **MaskImage**. Utilizará una *Imagen* como máscara (la imagen MonolayerMask generada en el paso anterior). En este caso, no es necesario invertir la máscara. Tenga en cuenta que los planos en la parte inferior y superior del stack z son de color negro en la imagen enmascarada. Nombre la salida *MembMasked*.
pt_br: Adicione um módulo **MaskImage**. Você usará uma *Image* como máscara (a imagem MonolayerMask gerada na etapa anterior). Nesse caso, a máscara não precisa ser invertida. Observe que os planos na parte inferior e superior da pilha z (z-stack) são pretos na imagem com máscara aplicada. Nomeie a saída como *MembMasked*.

source: Add an **ErodeImage** module. We will use this module to erode the membrane image generated in the previous step. Eroding using a *ball* of size *1* improves the separation between individual cells in the Watershed segmentation (the next step). Name the output *MembFinal*.
es: Añade un módulo **ErodeImage**. Utilizaremos este módulo para erosionar la imagen de membrana generada en el paso anterior. La erosión utilizando una *bola* de tamaño *1* mejora la separación entre células individuales en la segmentación Watershed (el siguiente paso). Nombre la salida *MembFinal*.
pt_br: Adicione um módulo **ErodeImage**. Usaremos esse módulo para erodir a imagem da membrana gerada na etapa anterior. A erosão usando uma *bola* de tamanho *1* melhora a separação entre células individuais na segmentação Watershed (a próxima etapa). Nomeie a saída como *MembFinal*.

source: Add a **Watershed** module. The input is the result of the previous **ErodeImage** module, referred to here as the MembFinal. Change the *Generate from* option to *Markers*. The Markers will be the *cellSeeds* image, which is the output of the **ConvertObjectsToImage** module. Finally, set the Mask to also be the *MembFinal*. This will help preserve the cell boundaries. Name the output of this module *Cells*.
es: Agregue un módulo **Watershed**. La entrada es el resultado del módulo **ErodeImage** anterior, al que aquí nos referimos como MembFinal. Cambie la opción *Generar desde* a *Markers*. Los marcadores serán la imagen *cellSeeds*, que es la salida del módulo **ConvertObjectsToImage**. Finalmente, configure la Máscara para que también sea *MembFinal*. Esto ayudará a preservar los límites de célula. Asigne un nombre a la salida de este módulo *Cells*.
pt_br: Adicione um módulo **Bacia Hidrográfica**. A entrada é o resultado do módulo **ErodeImage** anterior, aqui referido como MembFinal. Altere a opção *Gerar de* para *Marcadores*. Os marcadores serão a imagem *cellSeeds*, que é a saída do módulo **ConvertObjectsToImage**. Por fim, defina a Máscara para também ser *MembFinal*. Isso ajudará a preservar os limites das células. Nomeie a saída deste módulo como *Células*.

source: Making measurements
es: Realización de mediciones
pt_br: Como fazer medições

source: Now that the nuclei and cells have been segmented in this monolayer, measurements can be made using modules from the **Measurements** category.
es: Ahora que los núcleos y las células se han segmentado en esta monocapa, se pueden realizar mediciones utilizando módulos de la categoría **Mediciones** (Measurements).
pt_br: Agora que os núcleos e as células foram segmentados nessa monocamada, as medições podem ser feitas usando os módulos da categoria **Measurements**.

source: Add any desired measurements modules. For example, you might choose to **MeasureObjectIntensity** and/or **MeasureObjectSizeShape**. When applying these measurements, be careful to measure the original images, not rescaled images.
es: Añada los módulos de medición que desee. Por ejemplo, puede elegir **MeasureObjectIntensity** (Medir Intensidad de Objetos) y/o **MeasureObjectSizeShape** (Medir Tamaño y Forma de Objectos). Al aplicar estas mediciones, tenga cuidado de medir las imágenes originales, no las reescaladas.
pt_br: Adicione os módulos de medição desejados. Por exemplo, você pode optar por **MeasureObjectIntensity** e/ou **MeasureObjectSizeShape**. Ao aplicar essas medições, tenha cuidado para medir as imagens originais, não as imagens redimensionadas.

source: Creating visuals
es: Creación de imágenes
pt_br: Criação de recursos visuais

source: Congratulations! The nuclei and cells have been segmented and measured in this monolayer. Visuals that reveal the details of the segmentation can be also be created within CellProfiler. The following steps will walk you through two different options to visualize your CellProfiler segmentations.
es: ¡Enhorabuena! Los núcleos y las células han sido segmentados y medidos en esta monocapa. Las visualizaciones que revelan los detalles de la segmentación también pueden ser creados dentro de CellProfiler. Los siguientes pasos le guiarán a través de dos opciones diferentes para visualizar sus segmentaciones en CellProfiler.
pt_br: Parabéns! Os núcleos e as células foram segmentados e medidos nessa monocamada. Os recursos visuais que revelam os detalhes da segmentação também podem ser criados no CellProfiler. As etapas a seguir o guiarão por duas opções diferentes para visualizar as segmentações do CellProfiler.

source: The **OverlayObjects** module will overlay the objects as colored masks on the image. We recommend overlaying onto rescaled images, which will be easier to visualize outside of CellProfiler. For example, you can choose the *Nuclei* as the objects and the *RescaledDNA* as your image. Name the output *NucleiOverlay*. You can try and do the same for the cell bodies, overlaying the *Cells* object onto a rescaled version of the *origMemb* image. Name the output *CellsOverlay*.
es: El módulo **OverlayObjects** superpondrá los objetos como máscaras coloreadas sobre la imagen. Recomendamos superponer sobre imágenes reescaladas, que serán más fáciles de visualizar fuera de CellProfiler. Por ejemplo, puede elegir los *Núcleos* como objetos y el *ADN reescalado* como imagen. Nombre la salida *NucleiOverlay*. Puede intentar hacer lo mismo para los cuerpos celulares, superponiendo el objeto *Cells* sobre una versión reescalada de la imagen *origMemb*. Nombre la salida *CellsOverlay*.
pt_br: O módulo **OverlayObjects** sobreporá os objetos como máscaras coloridas na imagem. Recomendamos a sobreposição em imagens redimensionadas, que serão mais fáceis de visualizar fora do CellProfiler. Por exemplo, você pode escolher os *Núcleos* como os objetos e o *DNA redimensionado* como a imagem. Nomeie o resultado como *NucleiOverlay*. Você pode tentar fazer o mesmo com os corpos das células, sobrepondo o objeto *Cells* em uma versão redimensionada da imagem *origMemb*. Nomeie a saída como *CellsOverlay*.

source: You can also convert the objects to images using the **ConvertObjectsToImage** module and then save the output using **SaveImages**. This option will allow you to visualize the segmentations directly in Fiji and use them as masks for further processing.
es: También puede convertir los objetos en imágenes utilizando el módulo **ConvertObjectsToImage** y luego guardar el resultado utilizando **SaveImages**. Esta opción te permitirá visualizar las segmentaciones directamente en Fiji y utilizarlas como máscaras para procesamientos posteriores.
pt_br: Você também pode converter os objetos em imagens usando o módulo **ConvertObjectsToImage** e, em seguida, salvar a saída usando **SaveImages**. Essa opção permitirá que você visualize as segmentações diretamente no Fiji e as use como máscaras para processamento posterior.

source: Export measurements
es: Exportar mediciones
pt_br: Exportar medições

source: Save the output of the measurements modules using **ExportToSpreadsheet** or **ExportToDatabase**.
es: Guarde la salida de los módulos de medición utilizando **ExportToSpreadsheet** o **ExportToDatabase**.
pt_br: Salve a saída dos módulos de medições usando **ExportToSpreadsheet** ou **ExportToDatabase**.

source: It’s good practice to place all export modules at the end of your pipeline. CellProfiler automatically calculates execution times for each module that was run before the export module. By placing your export modules at the end of your pipeline, you will have access to module execution times for each module in your pipeline.
es: Es una buena práctica colocar todos los módulos de exportación al final de su pipeline. CellProfiler calcula automáticamente los tiempos de ejecución para cada módulo que fue ejecutado antes del módulo de exportación. Al colocar tus módulos de exportación al final de tu pipeline, tendrás acceso a los tiempos de ejecución de cada módulo en tu pipeline.
pt_br: É uma boa prática colocar todos os módulos de exportação no final de seu pipeline. O CellProfiler calcula automaticamente os tempos de execução de cada módulo que foi executado antes do módulo de exportação. Ao colocar os módulos de exportação no final do pipeline, você terá acesso aos tempos de execução de cada módulo no pipeline.

source: Thank you for completing the 3d monolayer tutorial!
es: ¡Gracias por completar el tutorial de monocapa 3d!
pt_br: Obrigado por concluir o tutorial de monocamada 3d!

source: This regular expression will parse the filenames and organize the data. We suggest you copy this expression so accidental spelling errors or extra spaces don't affect the metadata extraction
pt_br: Esta expressão regular vai analisar os nomes dos arquivos e organizar os dados. Recomendamos que você a copie e cole, para que erros de digitação acidentais ou espaços extras não atrapalhem a extração de metadados.
