Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/3d-monolayer.po
Languages: es, pt_br

source: 3D Cell Monolayer Segmentation and Analysis Tutorial
es: Tutorial de análisis y segmentación monocapa 3D células
pt_br: Tutorial de segmentação e análise de monocamada de células 3D

source: **Note** that this tutorial is an advanced tutorial. We recommend completing the **Beginner Segmentation tutorial** in order to learn principles of image thresholding and segmentation prior to starting this tutorial.
es: **Tenga en cuenta** que este tutorial es un tutorial avanzado. Recomendamos completar el **Tutorial de segmentación para principiantes** para aprender los principios de segmentación y umbralización de imágenes antes de comenzar este tutorial.
pt_br: **Observe** que este tutorial é um tutorial avançado. Recomendamos concluir o **Tutorial de segmentação para iniciantes** para aprender os princípios de limite e segmentação de imagens antes de iniciar este tutorial.

source: Appropiately naming the output(s) of each CellProfiler module is important in order to avoid confusion,especially in large and complex pipelines. Throughout this tutorial we will suggest names for each of the outputs, but feel free to use your own.
es: Es importante nombrar apropiadamente la(s) salida(s) de cada módulo de CellProfiler para evitar confusiones, especialmente en pipelines grandes y complejos. A lo largo de este tutorial sugeriremos nombres para cada una de las salidas, pero siéntase libre de utilizar los suyos propios.
pt_br: Nomear adequadamente as saídas (outputs) de cada módulo do CellProfiler é importante para evitar confusões, especialmente em pipelines grandes e complexos. Ao longo deste tutorial, vamos sugerir nomes para cada uma das saídas, mas fique à vontade para usar os seus próprios.

source: This tutorial will guide you through the creation of a complete analysis pipeline. If you wish, you can also find a final version of a similar pipeline in the *3d_monolayer_final.cppipe* file, which should be in the same folder as this tutorial. To load the pipeline, simply drag the file to the left panel on the CellProfiler window.
es: Este tutorial le guiará en la creación de un análisis completo pipeline. Si lo desea, también puede encontrar una versión final de un pipeline similar en el archivo *3d_monolayer_final.cppipe*, que debería estar en la misma carpeta que este tutorial. Para cargar el pipeline, simplemente arrastre el archivo al panel izquierdo de la ventana de CellProfiler.
pt_br: Este tutorial vai te guiar na criação de um pipeline de análise completo. Se quiser, você também pode encontrar uma versão final de um pipeline semelhante no arquivo *3d_monolayer_final.cppipe*, que deve estar na mesma pasta deste tutorial. Para carregar o pipeline, basta arrastar o arquivo para o painel esquerdo da janela do CellProfiler.

source: Helpful video tutorials are available on the Center for Open Bioimage Analysis YouTube page at <https://www.youtube.com/channel/UC_id9sE-vu_i30Bd-skay7Q>.
es: Hay tutoriales en vídeo muy útiles disponibles en la página de YouTube del Center for Open Bioimage Analysis en <https://www.youtube.com/channel/UC_id9sE-vu_i30Bd-skay7Q>.
pt_br: Vídeo tutoriais bastante úteis estão disponíveis na página do YouTube do Center for Open Bioimage Analysis: <https://www.youtube.com/channel/UC_id9sE-vu_i30Bd-skay7Q>.

source: This tutorial features images of human induced pluripotent stem cells from the Allen Institute of Cell Science. More details are available at the following link: <https://bbbc.broadinstitute.org/BBBC034>.
es: Este tutorial presenta imágenes células madre pluripotentes inducidas humanas del Allen Institute of Cell Science. Más detalles están disponibles en el siguiente enlace: <https://bbbc.broadinstitute.org/BBBC034>.
pt_br: Este tutorial apresenta imagens de células-tronco pluripotentes induzidas humanas (hiPSCs) do Allen Institute of Cell Science. Mais detalhes estão disponíveis neste link: [BBBC034](https://bbbc.broadinstitute.org/BBBC034).

source: Organizing and importing images
es: Organizar e importar imágenes
pt_br: Organizando e importando as imagens

source: Z-stacks as TIFFs
es: Z-stacks como TIFF
pt_br: Pilha Z (Z-stack) em TIFF

source: CellProfiler 3D currently only works with TIFF files. TIFF files can be rather complicated, having hyper-stack structures with all channels and z-planes in a single file. The acceptable CellProfiler format for storing z-stacks is to have a separate TIFF file for each channel.
es: CellProfiler 3D actualmente sólo funciona con archivos TIFF. Los archivos TIFF pueden ser bastante complicados, teniendo estructuras hyper-stack con todos los canales y planos z en un solo archivo. El formato aceptable de CellProfiler para almacenar z-stacks es tener un archivo TIFF separado para cada canal.
pt_br: No momento, o CellProfiler 3D só funciona com arquivos TIFF. Arquivos TIFF podem ser bem complexos, por exemplo no formato hyperstack (hiperpilha), em que todos os canais e planos Z ficam em um único arquivo. O formato aceito pelo CellProfiler para armazenar pilhas Z é ter um arquivo TIFF separado para cada canal.

source: CellProfiler can be used to convert from other file formats to individual TIFF files for each channel using the **SaveImages** module.
es: CellProfiler puede utilizarse para convertir desde otros formatos de archivo a archivos TIFF individuales para cada canal utilizando el módulo **SaveImages**.
pt_br: O CellProfiler pode ser usado para converter outros formatos de arquivo em arquivos TIFF individuais (um por canal), usando o módulo **SaveImages**.

source: Importing data in CellProfiler
es: Importación de datos en CellProfiler
pt_br: Importando os dados no CellProfiler

source: Highlight the **Images** module.
es: Seleccione el módulo **Images**.
pt_br: Selecione o módulo **Imagens**.

source: Drag-and-drop the images you will analyze into the **Images** module window.
es: Arrastre y suelte las imágenes que analizará en la ventana del módulo **Images**.
pt_br: Arraste e solte as imagens que você analisará na janela do módulo **Imagens**.

source: Highlight the **Metadata** module.
es: Resalte el módulo **Metadata**.
pt_br: Selecione o módulo **Metadados**.

source: Enter the following regular expression:
es: Introduzca la siguiente expresión regular:
pt_br: Digite a seguinte expressão regular:

source: This regular expression will parse the filenames and organize the data.
es: Esta expresión regular analizará los nombres de archivo y organizará los datos.

source: Highlight the **NamesAndTypes** module.
es: Resalte el módulo **NamesAndTypes**.
pt_br: Selecione o módulo **NamesAndTypes**.

source: Assign a name to “Images matching rules”.
es: Asigne un nombre a "Reglas de coincidencia de imágenes" (“Images matching rules”).
pt_br: Dê um nome para “Image matching rules” (regras de correspondência de imagens).

source: Choose “Process as 3D”
es: Seleccione "Procesar como 3D" ("Process as 3D").
pt_br: Escolha "Process as 3D" (Processar como 3D)

source: Populate the fields for “Relative Pixel Spacing”.
es: Rellene los campos de "Espaciado relativo entre píxeles" ("Relative Pixel Spacing").
pt_br: Preencha os campos para "Relative Pixel Spacing" (Espaçamento relativo de pixels).

source: You can find this information on the image metadata. Open the image in Fiji and go to Image > Show Info… (or use Ctrl + I)
es: Puede encontrar esta información en los metadatos de la imagen. Abra la imagen en Fiji y vaya a Imagen > Mostrar Información... (o utilice Ctrl + I).
pt_br: Você pode encontrar essas informações nos metadados da imagem. Abra a imagem no Fiji e vá em Image > Show Info… (ou use Cmd + I no macOS, ou Ctrl + I no Windows).

source: Near the end of the metadata you will find the information for the “Voxel size” (x,y,z). You can also record this metadata when collecting your own images
es: Cerca del final de los metadatos encontrará la información para el "Tamaño de vóxel" ("Voxel size') (x,y,z). También puede registrar estos metadatos cuando obtenga sus propias imágenes
pt_br: Perto do final dos metadados, você encontrará as informações sobre o tamanho do voxel em "Voxel size" (x,y,z). Você também pode anotar esses metadados ao adquirir suas próprias imagens.

source: For this example, the relative pixel spacing is 0.26 in x and y and 0.29 pixels in z.
es: Para este ejemplo, el espaciado relativo entre píxeles es de 0,26 en x e y y de 0,29 píxeles en z.
pt_br: Para este exemplo, o espaçamento relativo de pixels é de 0,26 em x e y e 0,29 pixels em z.

source: The actual units do not matter, rather their relative proportion. The numbers are unitless and therefore the decimal place does not matter.
es: Las unidades reales no importan, sino su proporción relativa. Los números no tienen unidades y, por tanto, el decimal no importa.
pt_br: As unidades reais não importam; o que importa é a proporção relativa entre elas. Os números são adimensionais e, portanto, a posição da vírgula (casa decimal) não faz diferença.

source: Create “rule criteria” to identify an image by its color/channel. For example, using the Metadata you just extracted - `Metadata -> Does -> Have ChannelNumber matching -> 0` would match the first image.
es: Cree “criterios de reglas” para identificar una imagen por su color/canal. Por ejemplo, usando los metadatos que acaba de extraer: `Metadata -> Does -> Have ChannelNumber matching -> 0` coincidiría con la primera imagen.
pt_br: Em "Select the rule criteria", crie uma regra para identificar uma imagem pela sua cor/canal. Por exemplo, usando os metadados que você acabou de extrair: `Metadata -> Does -> Have ChannelNumber matching -> 0` corresponderia à primeira imagem.

source: Give the images “variable names” that describe the contents of the image. For example, use the name *dna* to describe an image stained with DAPI.
es: Dé a las imágenes "nombres-variable" que describan el contenido de la imagen. Por ejemplo, utilice el nombre *dna* para describir una imagen teñida con DAPI.
pt_br: Em "Name to assign these images", atribua às imagens “nomes de variáveis” que descrevam seu conteúdo. Por exemplo, use o nome DNA para descrever uma imagem marcadas com DAPI.

source: Add images with rulesets for the other channels in the experiment. In this case, Channel 0 contains images of the plasma membrane, Channel 1 contains images of mitochondria, and Channel 2 contain images of DNA. You can name them *origMemb*, *origMito* and *origDNA*, respectively.
es: Añada imágenes con conjuntos de reglas para los demás canales del experimento. En este caso, el Canal 0 contiene imágenes de la membrana plasmática, el Canal 1 contiene imágenes de mitocondrias y el Canal 2 contiene imágenes de ADN. Puede nombrarlos *origMemb*, *origMito* y *origDNA*, respectivamente.
pt_br: Crie regras para identificar as imagens dos outros canais do experimento. Neste caso, o Canal 0 contém imagens da membrana plasmática, o Canal 1 contém imagens de mitocôndrias e o Canal 2 contém imagens de DNA. Você pode nomeá-las como *origMemb*, *origMito* e *origDNA*, respectivamente.

source: Find objects: nuclei
es: Encontrar objetos: núcleos
pt_br: Localizar objetos: núcleos

source: Image preparation
es: Preparación de imágenes
pt_br: Preparação da imagem

source: Before attempting to segment the cells in the images, pre-processing the images with filters and various image processing methods will improve the results.
es: Antes de intentar segmentar las células en las imágenes, el preprocesamiento de las mismas con filtros y diversos métodos de tratamiento de imágenes mejorará los resultados.
pt_br: Antes de tentar segmentar as células, fazer um pré-processamento com filtros e outros métodos de processamento de imagem pode melhorar os resultados.

source: Add a **RescaleIntensity** module for the DNA channel. Rescaling the DNA image proportionally stretches the intensity values to the full intensity range, from 0 to 1. In this case, we find that rescaling improves the thresholding and subsequent segmentation of nuclei. When using rescaling in your pipelines, be careful to perform measurements on the original images, not the rescaled images. Name the output *RescaledDNA*.
es: Añadir un módulo **RescaleIntensity** para el canal de ADN. El reescalado de la imagen de ADN estira proporcionalmente los valores de intensidad a todo el rango de intensidad, de 0 a 1. En este caso, encontramos que el reescalado mejora el umbral y la posterior segmentación de los núcleos. Cuando utilice el reescalado en sus procesos, tenga cuidado de realizar las mediciones en las imágenes originales, no en las reescaladas. Nombre la salida *RescaledDNA*.
pt_br: Adicione um módulo **RescaleIntensity** para o canal de DNA. O reescalonamento da imagem de DNA estende proporcionalmente os valores de intensidade para todo o intervalo, de 0 a 1. Neste caso, observamos que esse reescalonamento melhora a etapa de thresholding e a segmentação subsequente dos núcleos. Ao usar reescalonamento em seus pipelines, tome cuidado para realizar as medições nas imagens originais, e não nas imagens reescalonadas. Nomeie a saída como *RescaledDNA*.

source: Add a **Resize** module. Processing 3D images requires much more computation time than 2D images. Often, downsampling an image can yield large performance gains and at the same time smooth an image to remove noise. Final segmentation results will be minimally affected by downsampling if the objects of interest are relatively large compared to the pixel size. Choose a value of *0.5* for both *X* and *Y*, this will halve each of the XY dimensions, so the resulting image will have a quarter of the area of the original. *Do not resize Z* (keep the factor at *1*), otherwise you will discard images from the Z stack. Name the output *ResizedDNA*.
es: Añadir un módulo **Resize**. El procesamiento de imágenes 3D requiere mucho más tiempo de cálculo que el de las imágenes 2D. A menudo, reducir el tamaño de una imagen puede aumentar considerablemente el rendimiento y, al mismo tiempo, suavizar la imagen para eliminar el ruido. Los resultados finales de la segmentación se verán mínimamente afectados por la reducción de la resolución si los objetos de interés son relativamente grandes en comparación con el tamaño de los píxeles. Elija un valor de *0,5* para *X* y *Y*, esto reducirá a la mitad cada una de las dimensiones XY, por lo que la imagen resultante tendrá una cuarta parte del área de la original. *No redimensione Z* (mantenga el factor en *1*), de lo contrario descartará imágenes de la stack Z. Nombre la salida *ResizedDNA*.
pt_br: Adicione um módulo **Resize**. Processar imagens 3D exige muito mais tempo de computação do que imagens 2D. Muitas vezes, subamostrar (downsampling) uma imagem pode gerar grandes ganhos de desempenho e, ao mesmo tempo, suavizá-la, ajudando a remover ruído. Os resultados finais da segmentação serão pouco afetados pela subamostragem se os objetos de interesse forem relativamente grandes em comparação com o tamanho do pixel. Escolha um valor de *0,5* para *X* e *Y*; isso reduz pela metade cada uma das dimensões no plano XY, de modo que a imagem resultante terá um quarto da área da original. *Não redimensione Z* (mantenha o fator em *1*), caso contrário você vai descartar planos da pilha Z. Nomeie a saída como *ResizedDNA*.

source: Add a **MedianFilter** module. A median filter will homogenize the signal within the nucleus and reduce noise in the background. DNA is not uniformly distributed throughout the nucleus, which can lead to holes forming in the downstream object identification. A median filter will preserve boundaries better than other smoothing filters such as the Gaussian filter. For the example images, choose a filter size of *5*. This number was chosen empirically: it is smaller than the diameter of a typical nucleus; it is small enough that nuclei aren’t merged together, yet large enough to suppress over-segmentation of the nuclei. Name the output *MedianFiltDNA*.
es: Añadir un módulo **MedianFilter**. Un filtro de mediana homogeneizará la señal dentro del núcleo y reducirá el ruido de fondo. El ADN no está distribuido uniformemente por todo el núcleo, lo que puede dar lugar a la formación de agujeros en la identificación de objetos posterior. Un filtro mediano preservará los límites mejor que otros filtros de suavizado, como el filtro gaussiano. Para las imágenes de ejemplo, elija un tamaño de filtro de *5*. Este número se eligió empíricamente: es más pequeño que el diámetro de un núcleo típico; es lo suficientemente pequeño como para que los núcleos no se fusionen, pero lo suficientemente grande como para suprimir la sobresegmentación de los núcleos. Nombre la salida *MedianFiltDNA*.
pt_br: Adicione um módulo **MedianFilter**. Um filtro mediano vai homogeneizar o sinal dentro do núcleo e reduzir o ruído no fundo. O DNA não se distribui de forma uniforme em todo o núcleo, o que pode levar à formação de “buracos” nas etapas seguintes de identificação de objetos. O filtro mediano preserva melhor as bordas do que outros filtros de suavização, como o filtro Gaussiano. Para as imagens de exemplo, escolha um tamanho de filtro de *5*. Esse valor foi escolhido empiricamente: é menor que o diâmetro de um núcleo típico; é pequeno o suficiente para não juntar núcleos entre si (under-segmentation), mas grande o bastante para evitar que os núcleos sejam subdivididos em fragmentos (over-segmentation). Nomeie a saída como *MedianFiltDNA*.

source: Segmentation
es: Segmentación
pt_br: Segmentação

source: In CellProfiler 4 (and previous versions) the **IdentifyPrimaryObjects** module does not support 3D images. Thus, we will have to use a different strategy to segment the nuclei.
es: En CellProfiler 4 (y versiones anteriores), el módulo **IdentifyPrimaryObjects** no admite imágenes 3D. Por lo tanto, tendremos que utilizar una estrategia diferente para segmentar los núcleos.
pt_br: No CellProfiler 4 (e versões anteriores), o módulo **IdentifyPrimaryObjects** não oferece suporte a imagens 3D. Assim, teremos que utilizar uma estratégia diferente para segmentar os núcleos.

source: Add an **Threshold** module. This identifies a pixel intensity value to separate the foreground (nuclei) from the background. Empirically, we’ve found that a two-class Otsu threshold works well for this data. We encourage you to try other thresholding methods to compare the outputs. Name the output *MaskDNA*.
es: Añadir un módulo **Threshold**. Esto identifica un valor de intensidad de píxel para separar el primer plano (núcleos) del fondo. Empíricamente, hemos encontrado que un umbral Otsu de dos clases funciona pocillo para estos datos. Le animamos a probar otros métodos de umbralización para comparar los resultados. Nombre la salida *MaskDNA*.
pt_br: Adicione um módulo **Threshold**. Esse módulo identifica um valor de intensidade de pixel para separar o primeiro plano (núcleos) do fundo (background). Empiricamente, observamos que a limiarização de Otsu com duas classes funciona bem para estes dados. Recomendamos que você teste outros métodos de limiarização para comparar os resultados. Nomeie a saída como *MaskDNA*.

source: Add a **RemoveHoles** module. This module implements an algorithm that will remove small holes within the nucleus. Any remaining holes will contribute to over-segmentation of the nuclei. Choose a size of *20*.
es: Añade un módulo **RemoveHoles**. Este módulo implementa un algoritmo que eliminará pequeños agujeros dentro del núcleo. Cualquier agujero restante contribuirá a la sobre-segmentación de los núcleos. Elija un tamaño de *20*.
pt_br: Adicione um módulo **RemoveHoles**. Esse módulo implementa um algoritmo que removerá pequenos buracos dentro do núcleo. Quaisquer buracos restantes contribuirão para a segmentação excessiva dos núcleos. Escolha um tamanho de *20*.

source: Add a **Watershed** module. This module implements the watershed algorithm, which will segment the nuclei. Select a Footprint of *10* and Downsample by *2*. Downsampling reduces processing time and decreases noise. For more information on the watershed algorithm refer to this helpful [MATLAB blog post](https://www.mathworks.com/company/newsletters/articles/the-watershed-transform-strategies-for-image-segmentation.html).
es: Agregue un módulo **Watershed**. Este módulo implementa el algoritmo watershed, que segmentará los núcleos. Seleccione un "Footprint" de *10* y "Downsample" en *2*. La reducción ("Downsampling") de la imagen reduce el tiempo de procesamiento y disminuye el ruido. Para obtener más información sobre el algoritmo de watershed, consulte esta [publicación de blog de MATLAB] (https://www.mathworks.com/company/newsletters/articles/the-watershed-transform-strategies-for-image-segmentation.html).
pt_br: Adicione um módulo **Watershed*. Esse módulo implementa o algoritmo watershed, que segmenta os núcleos. Defina Footprint = *10* e Downsample by = *2*. A subamostragem reduz o tempo de processamento e diminui o ruído. Para saber mais sobre o algoritmo watershed, consulte [este post do blog do MATLAB](https://www.mathworks.com/company/newsletters/articles/the-watershed-transform-strategies-for-image-segmentation.html).

source: Add a **ResizeObjects** module to return the segmented nuclei to the size of the original image. Since the original image was scaled down by *0.5*, it must be scaled up by *2*. The output of this module is the nuclei we are seeking. Name the output *Nuclei*.
es: Añadir un módulo **ResizeObjects** para devolver los núcleos segmentados al tamaño de la imagen original. Dado que la imagen original se redujo en *0,5*, se debe ampliar en *2*. La salida de este módulo son los núcleos que estamos buscando. Nombre la salida *Nuclei*.
pt_br: Adicione um módulo **ResizeObjects** para trazer os núcleos segmentados de volta ao tamanho da imagem original. Como a imagem foi reduzida por um fator de *0,5*, os objetos devem ser ampliados por um fator de *2*. A saída desse módulo são os núcleos que estamos buscando. Nomeie a saída como *Nuclei*.

source: Find objects: cells
es: Buscar objetos: celdas
pt_br: Localizar objetos: células

source: Now that we’ve segmented the nuclei, we want to segment the cytoplasm for each nuclei whose boundaries are defined by the membrane channel. The membrane channel presents more of a challenge because, unlike the nuclei, the membrane signal is variable and the boundaries are connected together in a sort of mesh. However, we can use the location of the nuclei we already found as 'seeds' to guide the **Watershed** module later on to identify regions with cells.
es: Ahora que hemos segmentado los núcleos, queremos segmentar el citoplasma para cada núcleo cuyos límites están definidos por el canal de membrana. El canal de membrana presenta un desafío mayor porque, a diferencia de los núcleos, la señal de la membrana es variable y los límites están conectados entre sí en una especie de malla. Sin embargo, podemos usar la ubicación de los núcleos que ya encontramos como 'semillas' para guiar al módulo **Watershed** más adelante para identificar regiones con células.
pt_br: Agora que segmentamos os núcleos, vamos segmentar o citoplasma de cada célula, cujos limites são definidos pelo canal de membrana. O canal de membrana é mais desafiador porque, ao contrário dos núcleos, o sinal da membrana é variável e as bordas ficam conectadas entre si, formando uma espécie de malha. No entanto, podemos usar a localização dos núcleos que já encontramos como “sementes” para guiar o módulo **Watershed** mais adiante na identificação das regiões correspondentes às células.

source: Transform nuclei into 'seeds'
es: Transformar núcleos en 'semillas'
pt_br: Transforme núcleos em 'sementes'
