Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/3DNuclei.po
Languages: es

source: **Image Analysis Study**
es: **Estudio de análisis de imágenes**

source: **Nuclei in 3D cell culture images (and associated calibration image[s])**
es: **Núcleos en imágenes 3D de cultivos celulares (e imágenes de calibración asociadas)**.

source: **Proposal:**
es: **Propuesta:**

source: Segment the objects in a fluorescence z-stack image and provide:
es: Segmentar los objetos en una imagen z-stack de fluorescencia y proporcionar:

source: Centroid location in microns (um) for each nucleus: x, y, and z c
es: Localización del centroide en micras (um) para cada núcleo: x, y, y z c

source: Coordinates listed in separate columns. Labels x, y, and z.
es: Coordenadas en columnas separadas. Etiquetas x, y, y z.

source: Integrated Intensity. Label intensity.
es: Intensidad integrada. marca intensity.

source: Volume in cubic microns (um^3). Label volume.
es: Volumen en micras cúbicas (um^3). marca volume.

source: 3D volume image of your segmented image
es: Imagen de volumen en 3D de su imagen segmentada

source: **Input:**
es: **Entrada:**

source: Four different z-stack images that vary in their signal-to-noise ratio and the clustering of their objects of nuclei in 3D cell culture.
es: Cuatro imágenes z-stack diferentes que varían en su relación señal-ruido y la agrupación de sus objetos de núcleos en cultivo celular 3D.

source: Voxel dimensions: 0.124x0.124x0.200 um
es: Dimensiones de los voxels: 0,124x0,124x0,200 um

source: Calibration Image
es: Imagen de calibración

source: Voxel dimensions: 1x1x1 um
es: Dimensiones de los voxels: 1x1x1 um

source: **TimeConsumingProtocol** - 92s for four images
es: **TimeConsumingProtocol** - 92s para cuatro imágenes

source: /Users/mcruz/Documents/Tutorials/ABRFTutorial/3DNuclei/3DNucleiPipelineComputeConsumingFinal.cppipe
es: /Usuarios/mcruz/Documentos/Tutoriales/ABRFTutorial/3DNuclei/3DNucleiPipelineComputeConsumingFinal.cppipe

source: **Importing data in CellProfiler**
es: **Importación de datos en CellProfiler**

source: Highlight the **Images** module.
es: Seleccione el módulo **Imágenes**.

source: Drag-and-drop the images you will analyze into the Images module
es: Arrastre y suelte las imágenes que va a analizar en el módulo Imágenes

source: window.
es: ventana.

source: Load the pipeline file (.cppipe). Drag-and-drop the file or go to File->Import->Pipeline from File…
es: Cargue el archivo pipeline (.cppipe). Arrastre y suelte el archivo o vaya a Archivo->Importar->pipeline desde Archivo...

source: Note: The pipeline should populate all information needed, but it’s always a good practice to check if everything is fine.
es: Nota: pipeline debería rellenar toda la información necesaria, pero siempre es una buena práctica comprobar si todo está bien.

source: |image3| **Tip: Use the question mark button to learn more or if you have questions.**
es: |image3| **Consejo: Utiliza el botón con el signo de interrogación para obtener más información o si tienes alguna pregunta.**

source: image3
es: imagen3

source: Highlight the **NameAndType** module.
es: Resalte el módulo **NombreYTipo**.

source: The **NamesAndTypes** module gives each image a meaningful name by which modules in the analysis pipeline will refer to it. This module will also let you define an image stack that should be processed as a whole 3D volume.
es: El módulo **NamesAndTypes** da a cada imagen un nombre significativo con el que los módulos del análisis pipeline se referirán a ella. Este módulo también le permitirá definir una pila de imágenes que debe procesarse como un volumen 3D completo.

source: Assign a name to: All images This is the simplest choice and the
es: Asignar un nombre a: Todas las imágenes Esta es la opción más sencilla y la

source: appropriate one because we have only one kind of image.
es: apropiado porque sólo tenemos un tipo de imagen.

source: Process as 3D: Yes Selecting “Yes” will load the files as volumes
es: Procesar como 3D: Sí Al seleccionar "Sí" se cargarán los archivos como volúmenes

source: Populate the fields for “Relative Pixel Spacing”. This calibration
es: Rellene los campos de "Espaciado relativo entre píxeles". Esta calibración

source: affects modules that handle 3D images as volumes.
es: afecta a los módulos que manejan imágenes 3D como volúmenes.

source: The relative pixel spacing was provided and is 0.124 um in x and y and 0.200 um in z. To run the calibration file please change the relative pixel spacing to 1x1x1 um.
es: El espaciado relativo entre píxeles es de 0,124 um en x e y y de 0,200 um en z. Para ejecutar el archivo de calibración, cambie el espaciado relativo entre píxeles a 1x1x1 um.

source: Assign the images “variable names” that describe the contents in the
es: Asigne a las imágenes "nombres de variables" que describan el contenido en el

source: image. For example, use the name "Nuclei", "DNA", “DAPI” or something else that will remind you what the image is.
es: imagen. Por ejemplo, utilice el nombre "Núcleos", "ADN", "DAPI" o cualquier otro que le recuerde de qué imagen se trata.

source: Hit the "update" button to populate
es: Pulsa el botón "actualizar" para rellenar

source: This pipeline can be divided into three main parts: Image processing, segmentation and measurement/export.
es: Esta pipeline puede dividirse en tres partes principales: Procesamiento de imágenes, segmentación y medición/exportación.

source: **Image processing:**
es: **Tratamiento de imágenes

source: The image set provided varies in signal-to-noise ratio, before attempting to segment the nuclei in these images, conditioning the images with filters and various image processing methods will improve segmentation results.
es: Antes de intentar segmentar los núcleos en estas imágenes, el acondicionamiento de las imágenes con filtros y diversos métodos de procesamiento de imágenes mejorará los resultados de la segmentación.

source: Hit the start test mode button.
es: Pulsa el botón de inicio del modo de prueba.

source: **Tip:** You can select different image sets. For that you can go to the main tab, hit the test tab and choose another image set or you can hit the Next Image Set button.
es: **Consejo:** Puedes seleccionar diferentes conjuntos de imágenes. Para ello puedes ir a la pestaña principal, pulsar la pestaña de prueba y elegir otro conjunto de imágenes o puedes pulsar el botón Siguiente conjunto de imágenes.

source: image1
es: imagen1

source: **GaussianFilter** module This module will blur the image and remove
es: Módulo **GaussianFilter** Este módulo difuminará la imagen y eliminará

source: part of the noise. Filtering an image with a Gaussian filter can be helpful if the foreground signal is noisy or near the noise floor.
es: parte del ruido. Filtrar una imagen con un filtro gaussiano puede ser útil si la señal de primer plano es ruidosa o está cerca del ruido de fondo.

source: Select the input image: Nuclei (from **NamesAndTypes** module),
es: Seleccione la imagen de entrada: Núcleos (del módulo **NombresYTipos**),

source: Name the output image: GaussianFilter,
es: Nombre de la imagen de salida: GaussianFilter,

source: Sigma: 1 (larger sigmas induce more blurring).
es: Sigma: 1 (sigmas mayores provocan más desenfoque).

source: Hit the Step button and a new window will pop up with a resulting image that should look like this. The image can vary depending on the Image set chose.
es: Pulse el botón Paso y aparecerá una nueva ventana con una imagen resultante que debería tener este aspecto. La imagen puede variar dependiendo del conjunto de imágenes elegido.

source: The resulting image is still noisy in image set 3 and 4, so we added a **ReduceNoise** module to perform a non-local mean noise reduction. Instead of only using a neighborhood of pixels around a central pixel for denoising, such as in **GaussianFilter**.
es: La imagen resultante sigue siendo ruidosa en los conjuntos de imágenes 3 y 4, por lo que añadimos un módulo **ReduceNoise** para realizar una reducción del ruido medio no local. En lugar de utilizar sólo un vecindario de píxeles alrededor de un píxel central para la eliminación de ruido, como en **GaussianFilter**.

source: **ReduceNoise** module. This module performs non-local means of noise
es: Módulo **ReduceNoise**. Este módulo realiza medios no locales de ruido

source: reduction. This will run a 5x5 pixel patch with a maximal distance of 2 pixels to search for patches to use for denoising using a cut-off of 0.2.
es: reducción. Esto ejecutará un parche de 5x5 píxeles con una distancia máxima de 2 píxeles para buscar parches a utilizar para la eliminación de ruido utilizando un corte de 0,2.

source: Select the output image: GaussianFilter (from **GaussianFilter**
es: Seleccione la imagen de salida: GaussianFilter (de **GaussianFilter**)

source: module).
es: módulo).

source: Name the output image: ReduceNoise
es: Asigna un nombre a la imagen de salida: ReducirRuido

source: Size: 5
es: Tamaño: 5

source: Distance: 2
es: Distancia: 2

source: Cut-off distance: 0.2
es: Distancia de corte: 0.2

source: **Tip: The image tools on the top toolbar may be helpful to see the details on your image/objects:**
es: **Consejo: Las herramientas de imagen de la barra de herramientas superior pueden ser útiles para ver los detalles de tu imagen/objetos:**

source: The 1st icon from the left lets you reset the view back to the original view.
es: El primer icono de la izquierda le permite restablecer la vista original.

source: The 2nd and 3rd icons let you step backwards and forwards through any changes you made to the view.
es: Los iconos 2 y 3 le permiten retroceder y avanzar por los cambios realizados en la vista.

source: The 4th icon lets you change the view by moving in any direction in the display, by clicking and dragging.
es: El 4º icono te permite cambiar la vista moviéndote en cualquier dirección de la pantalla, haciendo clic y arrastrando.

source: The 5th icon lets you change the view by zooming, by dragging and drawing a box to zoom in on.
es: El 5º icono te permite cambiar la vista haciendo zoom, arrastrando y dibujando un recuadro para ampliar.

source: **Segmentation**
es: **Segmentación**

source: Now all objects on different image sets have similar dispersion patterns so we can start the segmentation process. **Tip:** To view pixel intensities in an open image, move your mouse over the image, the pixel intensities will appear in the bottom bar of the display window.
es: Ahora todos los objetos de los diferentes conjuntos de imágenes tienen patrones de dispersión similares, por lo que podemos iniciar el proceso de segmentación. **Consejo:** Para ver las intensidades de los píxeles en una imagen abierta, mueva el ratón sobre la imagen, las intensidades de los píxeles aparecerán en la barra inferior de la ventana de visualización.

source: **Threshold** module. This module produces a binary, or black and
es: Módulo **Umbral**. Este módulo produce un valor binario, o negro y

source: white, image based on a threshold that can be pre-selected or calculated automatically using one of many methods. After the threshold value has been determined, the Threshold module will set pixel intensities below the value to zero (black) and above the value to one (white).
es: blanco, basado en un umbral que puede ser preseleccionado o calculado automáticamente utilizando uno de los muchos métodos. Una vez determinado el valor del umbral, el módulo Umbral ajustará las intensidades de los píxeles por debajo del valor a cero (negro) y por encima del valor a uno (blanco).

source: Select the input image: ReduceNoise (from **ReduceNoise** module)
es: Seleccione la imagen de entrada: ReduceNoise (del módulo **ReduceNoise**)

source: Name the output image: Threshold
es: Nombre de la imagen de salida: Umbral

source: Threshold strategy: Global (We choose a global threshold strategy
es: Estrategia de umbral: Global (Elegimos una estrategia de umbral global

source: here because our background is relatively uniform after the image processing steps of this pipeline).
es: aquí porque nuestro fondo es relativamente uniforme después de los pasos de procesamiento de imágenes de este pipeline).

source: Threshold method: Otsu (automatically-calculated threshold method
es: Método de umbral: Otsu (método de umbral calculado automáticamente)

source: because it can adapt to changes in lighting conditions between images (in this case we have images with different pixel intensities).
es: porque puede adaptarse a los cambios en las condiciones de iluminación entre imágenes (en este caso tenemos imágenes con diferentes intensidades de píxeles).

source: Two-class or three-class thresholding: Three classes (separate
es: Umbral de dos o tres clases: Tres clases (separadas

source: three major pixel levels [foreground, mid-level and background]).
es: tres niveles principales de píxeles [primer plano, nivel medio y fondo]).

source: Assign pixels in the middle intensity: Background (the middle
es: Asignar píxeles en la intensidad media: Fondo (el medio

source: intensity pixels levels are noise in these images).
es: los niveles de intensidad de los píxeles son ruido en estas imágenes).

source: Threshold smoothing scale: 1.5 (Smoothing improves the uniformity
es: Escala de suavizado del umbral: 1,5 (El suavizado mejora la uniformidad

source: of the resulting objects, by removing jagged edges caused by noise in the acquired image).
es: de los objetos resultantes, eliminando los bordes dentados causados por el ruido en la imagen adquirida).

source: Threshold correction factor: 1
es: Factor de corrección del umbral: 1

source: **Watershed** module. This module is used to separate different
es: Módulo **Cuenca**. Este módulo se utiliza para separar diferentes

source: objects in an image, which in this case will assign which nuclei.
es: objetos de una imagen, que en este caso asignará qué núcleos.

source: Use advanced settings: No
es: Utiliza la configuración avanzada: No

source: Select the input image: Threshold (from **Threshold** module)
es: Seleccione la imagen de entrada: Umbral (del módulo **Umbral**)

source: Name the output object: Watershed
es: Nombre del objeto de salida: Cuenca hidrográfica

source: Generate from: Distance (we don’t have markers to guide the
es: Generar a partir de: Distancia (no tenemos marcadores para guiar la

source: segmentation process so the markers and other inputs for the algorithm will be automatically generated based on the footprint size).
es: proceso de segmentación, de modo que los marcadores y otras entradas para el algoritmo se generarán automáticamente en función del tamaño de la huella).

source: Footprint: 10 (define the dimensions of the window used to scan
es: Huella: 10 (define las dimensiones de la ventana utilizada para escanear

source: the input image for local maxima, this will create a local maxima from a binary image that will be at the centers of objects. Large footprint will suppress local maximas that are close together into a single maxima, so two or more objects will be segmented as one. Small footprint can lead to oversegmenation, this means one nuclei segmented as two or more objects.
es: la imagen de entrada para los máximos locales, esto creará un máximo local a partir de una imagen binaria que estará en los centros de los objetos. Una huella grande suprimirá los máximos locales cercanos en un único máximo, de modo que dos o más objetos se segmentarán como uno solo. Una huella pequeña puede dar lugar a una segmentación excesiva, es decir, un núcleo segmentado como dos o más objetos.

source: Downsample: 3 (reduce processing time without losing data).
es: Downsample: 3 (reduce el tiempo de procesamiento sin perder datos).

source: **Note:** Sometimes the processing and the segmentation steps can shrink or dilate your original structures. In this pipeline the objects are shrinked after the segmentation, you could test this using an image with a known object size.
es: **Nota:** A veces el procesado y los pasos de segmentación pueden encoger o dilatar las estructuras originales. En este pipeline los objetos se encogen después de la segmentación, usted podría probar esto usando una imagen con un tamaño de objeto conocido.

source: **DilateObjects** module. This module dilates your objects and
es: Módulo **DilateObjects**. Este módulo dilata sus objetos y

source: smooths the edges.
es: alisa los bordes.

source: Select the input object: Watershed (from **Watershed** module)
es: Seleccione el objeto de entrada: Cuenca hidrográfica (del módulo **Cuenca hidrográfica**)

source: Name the output object: RealsizeNuclei
es: Nombre del objeto de salida: RealsizeNuclei

source: Structuring element: Octahedron (Size: 1) (dilate the objects
es: Elemento estructurante: Octaedro (Tamaño: 1) (dilatar los objetos

source: using an octahedron profile with a size of 1).
es: utilizando un perfil octaédrico de tamaño 1).

source: Note: The colors will vary.
es: Nota: Los colores pueden variar.

source: **Measure and export data**
es: **Medición y exportación de datos

source: Now that the nuclei have been segmented, measurements can be made using modules from the **Measurements** category. This study is asking for 3 particular measurements:
es: Ahora que los núcleos han sido segmentados, se pueden realizar mediciones utilizando módulos de la categoría **Mediciones**. En este estudio se piden 3 mediciones en particular:

source: Centroid location (x, y and z),
es: Localización del centroide (x, y y z),

source: Integrated intensity and
es: Intensidad integrada y

source: Volume
es: Volumen

source: In this case we need two modules to extract this information, **MeasureObjectIntensity** and **MeasureObjectSizeShape** modules.
es: En este caso necesitamos dos módulos para extraer esta información, los módulos **MeasureObjectIntensity** y **MeasureObjectSizeShape**.

source: **Note:** When applying these measurements, be careful to measure the original images, not rescaled or processed images.
es: **Nota:** Al aplicar estas medidas, tenga cuidado de medir las imágenes originales, no las reescaladas o procesadas.

source: **MeasureObjectIntensity** module
es: Módulo **MedirObjetoIntensidad**.

source: Select images to measure: Nuclei (original image from
es: Seleccione las imágenes a medir: Núcleos (imagen original de

source: **NamesAndTypes** module)
es: módulo **NamesAndTypes**)

source: Select objects to measure: RealsizeNuclei (from **DilateObjects**
es: Seleccionar objetos a medir: RealsizeNuclei (de **DilateObjects**)

source: module) to have all the intensity measurements from the object.
es: ) para disponer de todas las medidas de intensidad del objeto.

source: **Note:** The measure modules will provide several features for identified objects and at this point we cannot choose which measurement, so the module will extract all intensity features possible.
es: **Nota:** Los módulos de medida proporcionarán varias características para los objetos identificados y en este momento no podemos elegir qué medida, por lo que el módulo extraerá todas las características de intensidad posibles.

source: **MeasureObjectSizeShape module**
es: **Módulo MedirObjetoTamañoForma**

source: Select object sets to measure: RealsizeNuclei (from
es: Seleccionar conjuntos de objetos para medir: RealsizeNuclei (de

source: **DilateObjects** module)
es: módulo **DilateObjects**)

source: Calculate the Zernike features: No
es: Calcular las características de Zernike: No

source: Calculate the advanced features: No
es: Calcula las prestaciones avanzadas: No

source: **Creating visuals**
es: **Creación de imágenes

source: Add the **RescaleIntesity** module to your pipeline. This module lets
es: Añade el módulo **RescaleIntesity** a tu pipeline. Este módulo permite

source: you rescale the intensity of the input images by any of several methods. You should use caution when interpreting intensity and texture measurements derived from images that have been rescaled because certain options for this module do not preserve the relative intensities from image to image.
es: puede reescalar la intensidad de las imágenes de entrada por cualquiera de los métodos disponibles. Debe tener cuidado al interpretar las medidas de intensidad y textura derivadas de imágenes que han sido reescaladas porque ciertas opciones de este módulo no conservan las intensidades relativas de imagen a imagen.

source: Selecting the input image image: Nuclei (from **NamesAndTypes**
es: Selección de la imagen de entrada Núcleos (de **NombresYTipos**)

source: module)
es: módulo)

source: Name the output image: RescaleIntensityNuclei
es: Nombre de la imagen de salida: ReescalaIntensidadNúcleos

source: Rescaling method: Stretch each image to use the full intensity
es: Método de reescalado: Estirar cada imagen para utilizar toda la intensidad.

source: range (Find the minimum and maximum values within the unmasked part of the image (or the whole image if there is no mask) and rescale every pixel so that the minimum has an intensity of zero and the maximum has an intensity of one).
es: range (Encuentra los valores mínimo y máximo dentro de la parte no enmascarada de la imagen (o toda la imagen si no hay máscara) y reescala cada píxel para que el mínimo tenga una intensidad de cero y el máximo de uno).

source: **OverlayObjects** module. This module overlay the objects as colored
es: Módulo **OverlayObjects**. Este módulo superpone los objetos de color

source: masks on the image. We recommend overlaying onto rescaled images, which will be easier to visualize outside of CellProfiler.
es: sobre la imagen. Recomendamos superponer sobre imágenes reescaladas, que serán más fáciles de visualizar fuera de CellProfiler.

source: Input: RescaleIntensityNuclei (from **RescaleIntensity** module)
es: Entrada: RescaleIntensityNuclei (del módulo **RescaleIntensity**)

source: Name the output image: OverlayObjects
es: Nombre de la imagen de salida: OverlayObjects

source: Objects: RealsizeNuclei (from **DilateObjects** module)
es: Objetos: RealsizeNuclei (del módulo **DilateObjects**)

source: Opacity: 0.3 (Increase this value to decrease the transparency of
es: Opacidad: 0,3 (Aumente este valor para disminuir la transparencia de

source: the colorized object labels).
es: las etiquetas coloreadas de los objetos).

source: **SaveImages** module. This module saves image or movie files.
es: Módulo **GuardarImágenes**. Este módulo guarda archivos de imagen o película.

source: Because CellProfiler usually performs many image analysis steps on many groups of images, it does not save any of the resulting images to the hard drive unless you specifically choose to do so with the SaveImages module. You can save any of the processed images created by CellProfiler during the analysis using this module. You can choose from many different image formats for saving your files. This allows you to use the module as a file format converter, by loading files in their original format and then saving them in an alternate format.
es: Debido a que CellProfiler normalmente realiza muchos pasos de análisis de imágenes en muchos grupos de imágenes, no guarda ninguna de las imágenes resultantes en el disco duro a menos que usted elija específicamente hacerlo con el módulo SaveImages. Usted puede guardar cualquiera de las imágenes procesadas creadas por CellProfiler durante el análisis utilizando este módulo. Puede elegir entre muchos formatos de imagen diferentes para guardar sus archivos. Esto le permite utilizar el módulo como un convertidor de formatos de archivo, cargando los archivos en su formato original y luego guardándolos en un formato alternativo.

source: Select the type of image to save: Image
es: Seleccione el tipo de imagen que desea guardar: Imagen
