Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/3DNuclei.po
Languages: es

source: Select the image to save: OverlayObjects (from **OverlayObjects**
es: Seleccione la imagen que desea guardar: Objetos superpuestos (de **Objetos superpuestos**)

source: Select method for constructing file names: From image filename
es: Seleccione el método para construir los nombres de archivo: A partir del nombre de archivo de imagen

source: (use this option to avoid reassignment of your images)
es: (utilice esta opción para evitar la reasignación de sus imágenes)

source: Select image name for file prefix: Nuclei (select the original
es: Seleccione el nombre de la imagen para el prefijo del archivo: Núcleos (seleccione el original

source: image name from NamesAndTypes module)
es: nombre de imagen del módulo NamesAndTypes)

source: Append a suffix to the image file name?: Yes
es: ¿Añadir un sufijo al nombre del archivo de imagen?: Sí

source: Text to append to the image name: Overlay (just add Overlay in the
es: Texto que se añadirá al nombre de la imagen: Superposición (añada Superposición en el campo

source: end of your original image file name)
es: al final del nombre del archivo de imagen original)

source: Saved file format: tiff (tiff is a lossless format, but you can
es: Formato de archivo guardado: tiff (tiff es un formato sin pérdidas, pero puede

source: choose others depending on what you need to do with this images)
es: elija otros en función de lo que necesite hacer con estas imágenes)

source: Image bit depth: 8-bit integer (this bit depth is easily read
es: Profundidad de bits de la imagen: entero de 8 bits (esta profundidad de bits se lee fácilmente

source: outside Cell Profiler)
es: fuera de Cell Profiler)

source: Save with lossless compression: Yes
es: Guardar con compresión sin pérdidas: Sí

source: Output file location: Default Output Folder (or create a new
es: Ubicación del archivo de salida: Carpeta de salida predeterminada (o crear una nueva

source: folder just for this images)
es: sólo para estas imágenes)

source: Overwrite existing files without warning?: No (prevent file
es: ¿Sobrescribir archivos existentes sin previo aviso? No (evita que los archivos

source: overwritten)
es: sobrescrito)

source: When to save: Every cycle (Save every image set)
es: Cuándo guardar: Cada ciclo (Guardar cada conjunto de imágenes)

source: Record the file and path information to the saved image?: No
es: Registrar el archivo y la información de la ruta a la imagen guardada?: No

source: Create subfolders in the output folder: No
es: Crear subcarpetas en la carpeta de salida: No

source: **ConvertObjectsToImage** module. Transform objects in image (provide
es: Módulo **ConvertObjectsToImage**. Transformar objetos en imagen (proporcionar

source: a 3D volume image of the segmented image)
es: una imagen de volumen 3D de la imagen segmentada)

source: Select the input objects: RealsizeNuclei (from **DilateObjects**
es: Seleccione los objetos de entrada: RealsizeNuclei (de **DilateObjects**)

source: Name the output image: NucleiObjects3D
es: Nombre de la imagen de salida: NucleiObjects3D

source: Select the color format: Grayscale
es: Seleccione el formato de color: Escala de grises

source: **Export measurements**
es: **Medidas de exportación**

source: It’s good practice to place all export modules at the end of your pipeline. CellProfiler automatically calculates execution times for each module that was run before the export module. By placing your export modules at the end of your pipeline, you will have access to module execution times for each module in your pipeline. Save the output of the measurement modules using **ExportToSpreadsheet** or **ExportToDatabase**.
es: Es una buena práctica colocar todos los módulos de exportación al final de su pipeline. CellProfiler calcula automáticamente los tiempos de ejecución para cada módulo que fue ejecutado antes del módulo de exportación. Colocando los módulos de exportación al final de su pipeline, tendrá acceso a los tiempos de ejecución de cada módulo en su pipeline. Guarde la salida de los módulos de medición utilizando **ExportToSpreadsheet** o **ExportToDatabase**.

source: **ExportToSpreadsheet** module. This module exports measurements into one or more files that can be opened in Excel or other spreadsheet programs. This module will convert the measurements to a comma-, tab-, or other character-delimited text format and save them to the hard drive in one or several files, as requested.
es: Módulo **ExportToSpreadsheet**. Este módulo exporta las mediciones a uno o varios archivos que pueden abrirse en Excel u otros programas de hojas de cálculo. Este módulo convertirá las mediciones a un formato de texto delimitado por comas, tabulaciones u otros caracteres y las guardará en el disco duro en uno o varios archivos, según se solicite.

source: Select the column delimiter: Comma (“,”)
es: Seleccione el delimitador de columna: Coma (",")

source: Output file location: Default Output Folder
es: Ubicación del archivo de salida: Carpeta de salida predeterminada

source: Add a prefix to file names: Yes
es: Añadir un prefijo a los nombres de archivo: Sí

source: Filename prefix: MyExpt\_
es: Prefijo del archivo: MiExpt\_

source: Overwrite existing files without warning: No
es: Sobrescribir archivos existentes sin previo aviso: No

source: Add image metadata columns to your object data file: No
es: Añada columnas de metadatos de imagen a su archivo de datos de objetos: No

source: Add image file and folder names to your object data file: No
es: Añade nombres de archivos de imagen y carpetas a tu archivo de datos de objetos: No

source: Representation of Nan/Inf: NaN
es: Representación de Nan/Inf: NaN

source: Select the measurements to export: Yes
es: Seleccione las mediciones que desea exportar: Sí

source: Press button to select measurements:
es: Pulse el botón para seleccionar las mediciones:

source: AreaShape: Center: X, Y and Z
es: ÁreaForma: Centro: X, Y y Z

source: Intensity: IntegratedIntensity
es: Intensidad: IntegradoIntensidad

source: Calculate the per-image mean values for object measurements?:No
es: ¿Calcular los valores medios por imagen para las mediciones de objetos?:No

source: Calculate the per-image median values for object measurements?:No
es: ¿Calcular los valores medianos por imagen para las mediciones de objetos?:No

source: Calculate the per-image standard deviation values for object
es: Calcular los valores de desviación típica por imagen para el objeto

source: measurements?:No
es: ¿Medidas?:No

source: Output file location:Default Output Folder\|
es: Ubicación del archivo de salida: Carpeta de salida predeterminada.

source: Create a GenePattern GCT file?:No
es: ¿Crear un archivo GenePattern GCT?:No

source: Export all measurement types?:No
es: ¿Exportar todos los tipos de medición?:No

source: Data to export: RealsizeNuclei
es: Datos a exportar: RealsizeNuclei

source: Use the object name for the file name?: No
es: ¿Utilizar el nombre del objeto para el nombre del archivo?: No

source: File name: Nuclei.csv
es: Nombre del archivo: Nuclei.csv

source: Data to export: Experiment
es: Datos a exportar: Experimento

source: File name: Metadata.csv
es: Nombre del archivo: Metadata.csv

source: **Results overview:**
es: **Resumen de resultados

source: **Congratulations!** The nucleus has been segmented, measured and exported. Now we need to convert the units from the csv file generated in Cell Profiler to microns and create a new table with just the values asked by the Study (X, Y, Z positions, Integrated Intensity and volume for each nuclei).
es: **El núcleo ha sido segmentado, medido y exportado. Ahora necesitamos convertir las unidades del fichero csv generado en Cell Profiler a micras y crear una nueva tabla con sólo los valores que pide el Estudio (posiciones X, Y, Z, Intensidad Integrada y volumen para cada núcleo).

source: For this purpose we create an interactive colab notebook that will ask you the X, Y and Z values to calculate the Voxel (um^3), you need to upload the csv generated by Cell Profiler to finally export a new csv file with the normalized values.
es: Para ello creamos un cuaderno de colab interactivo que te pedirá los valores X, Y y Z para calcular el Voxel (um^3), necesitas subir el csv generado por Cell Profiler para finalmente exportar un nuevo fichero csv con los valores normalizados.

source: **End**
es: **Final**
