Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/AdvancedSegmentation.po
Languages: es, pt_br

source: 10. **Mask the Mito image by the Cytoplasm object**
es: 10. **Enmascarar la imagen de Mito con el objeto Cytoplasm**
pt_br: 10. **Mascarar a imagem do Mito pelo objeto Citoplasma**

source: Now that you’ve seen an example of how to segment an organelle, you will do so for Mitochondria in the following steps.
es: Ahora que ha visto un ejemplo de cómo segmentar una organela, lo hará para las Mitocondrias en los siguientes pasos.
pt_br: Agora que você viu um exemplo de como segmentar uma organela, você o fará para a mitocôndria nas etapas a seguir.

source: **After** the IdentifyPrimaryObjects module for Nucleoli but **before** the RelateObjects modules, add a MaskImage module (from the Image Processing module category).
es: **Después** del módulo IdentifyPrimaryObjects para Nucleolos pero **antes** de los módulos RelateObjects, añada un módulo MaskImage (de la categoría de módulos Image Processing).
pt_br: **Depois do módulo IdentifyPrimaryObjects para nucléolos, mas antes dos módulos RelateObjects, adicione um módulo MaskImage (da categoria de módulo de processamento de imagens).

source: Call your output image ‘MaskedMito’.
es: Llame a su imagen de salida 'MitoMáscara'.
pt_br: Chame sua imagem de saída de 'MaskedMito'.

source: As you saw above with the Nucleoli example, mask the image via Objects, and use the Cytoplasm objects to create the mask.
es: Como ha visto anteriormente con el ejemplo de los Nucleolos, enmascare la imagen mediante Objetos, y utilice los objetos Citoplasma para crear la máscara.
pt_br: Como você viu acima com o exemplo dos nucléolos, mascare a imagem por meio de Objetos e use os objetos de Citoplasma para criar a máscara.

source: You may even experiment with doing a similar EnhanceOrSuppressFeatures step before the masking as was used for the Nucleoli; you may get greater signal-to-noise, but possibly at the expense of "fragmenting" the Mitochondria objects in the later identification steps.
es: Incluso puede experimentar haciendo un paso similar de EnhanceOrSuppressFeatures antes del enmascaramiento como se utilizó para los Nucleolos; puede obtener una mayor relación señal-ruido, pero posiblemente a expensas de "fragmentar" los objetos Mitocondrias en los pasos posteriores de identificación.
pt_br: Você pode até mesmo experimentar fazer uma etapa semelhante a EnhanceOrSuppressFeatures antes do mascaramento, como foi usado para os nucléolos; você pode obter um sinal-ruído maior, mas possivelmente às custas de "fragmentar" os objetos de mitocôndria nas etapas de identificação posteriores.

source: *Figure 7: The MaskedMito image contains only the regions of interest.*
es: *Figura 7: La imagen MitoMáscara contiene sólo las regiones de interés.*
pt_br: *Figura 7: A imagem MaskedMito contém apenas as regiões de interesse.

source: 12. **IdentifyPrimaryObjects- Mitochondria**
es: 12. **IdentifyPrimaryObjects - Mitocondrias**
pt_br: 12. **Identificar objetos primários - mitocôndrias **

source: **After** your MaskImage module but **before** the RelateObjects modules, add an IdentifyPrimary Objects module to identify Mitochondria from your MaskedMito image.
es: **Después** de su módulo MaskImage pero **antes** de los módulos RelateObjects, añada un módulo IdentifyPrimary Objects para identificar Mitocondrias a partir de su imagen MitoMáscara.
pt_br: **Após o módulo MaskImage, mas antes dos módulos RelateObjects, adicione um módulo IdentifyPrimary Objects para identificar as mitocôndrias da imagem MaskedMito.

source: You should consider using a wide range of pixel sizes here; 2-20 is a reasonable first place to start.
es: Debería considerar el uso de una amplia gama de tamaños de píxel aquí; 2-20 es un primer lugar razonable para empezar.
pt_br: Você deve considerar o uso de uma ampla gama de tamanhos de pixel aqui; 2-20 é um primeiro ponto razoável para começar.

source: If you did use EnhanceOrSuppressFeatures in the previous step, using OverlayOutlines to compare the outlines with the original image is a good idea once again.
es: Si utilizó EnhanceOrSuppressFeatures en el paso anterior, volver a utilizar OverlayOutlines para comparar los contornos con la imagen original es una buena idea.
pt_br: Se você usou EnhanceOrSuppressFeatures na etapa anterior, usar OverlayOutlines para comparar os contornos com a imagem original é uma boa ideia mais uma vez.

source: **Perform Measurements**
es: **Realizar mediciones**
pt_br: **Realizar medições**

source: 13. **Add measurement modules to your pipeline**
es: 13. **Agregar módulos de medición a su pipeline**
pt_br: 13. **Adicione módulos de medição ao seu pipeline**

source: **After** your segmentation of the mitochondria but **before** the RelateObjects modules, add as many object measurement modules as you would like.
es: **Después** de su segmentación de las mitocondrias pero **antes** de los módulos RelateObjects, añada tantos módulos de medición de objetos como desee.
pt_br: **Depois** da segmentação das mitocôndrias, mas **antes** dos módulos RelateObjects, adicione quantos módulos de medição de objetos desejar.

source: Some suggested modules to add- MeasureObjectSizeShape, MeasureObjectIntensity, MeasureGranularity, MeasureObjectNeighbors.
es: Algunos módulos sugeridos para añadir- MeasureObjectSizeShape, MeasureObjectIntensity, MeasureGranularity, MeasureObjectNeighbors.
pt_br: Alguns módulos sugeridos para adicionar: MeasureObjectSizeShape, MeasureObjectIntensity, MeasureGranularity, MeasureObjectNeighbors.

source: Which objects do you think would be valuable to measure with each of these modules? Which channels would you measure your objects in?
es: ¿Qué objetos crees que sería valioso medir con cada uno de estos módulos? ¿En qué canales mediría sus objetos?
pt_br: Quais objetos você acha que seriam valiosos para medir com cada um desses módulos? Em quais canais você mediria seus objetos?

source: For a typical Cell Painting experiment you would add as many measurements as possible, but that isn’t necessary here; however, do make sure every object gets at least some measurements.
es: Para un experimento típico de Cell Painting se añadirían tantas mediciones como fuera posible, pero eso no es necesario aquí; sin embargo, asegúrese de que cada objeto recibe al menos algunas mediciones.
pt_br: Em um experimento típico de pintura de células, você adicionaria o maior número possível de medições, mas isso não é necessário aqui; no entanto, certifique-se de que cada objeto receba pelo menos algumas medições.

source: While MeasureCorrelation, MeasureTexture, and MeasureObjectIntensityDistribution can produce valuable data for downstream profiling, they can be memory-intensive and/or slow so should not be added for this example pipeline in the interest of pipeline run time. MeasureNeurons is not well suited for this pipeline.
es: Mientras que MeasureCorrelation, MeasureTexture, y MeasureObjectIntensityDistribution pueden producir datos valiosos para el perfilado posterior, pueden ser costosos en memoria y/o lentos por lo que no deben ser añadidos para este ejemplo de procesamiento en pos del tiempo de ejecución del pipeline. MeasureNeurons no es adecuado para este pipeline.
pt_br: Embora o MeasureCorrelation, o MeasureTexture e o MeasureObjectIntensityDistribution possam produzir dados valiosos para a criação de perfis a jusante, eles podem consumir muita memória e/ou ser lentos, portanto, não devem ser adicionados a este exemplo de pipeline no interesse do tempo de execução do pipeline. O MeasureNeurons não é adequado para esse pipeline.

source: **Export data**
es: **Exportar datos**
pt_br: **Exportar dados**

source: In order to use the data visualization and machine learning tools in CellProfiler Analyst, the measurements will need to be saved to a database using the **ExportToDatabase**.
es: Para utilizar las herramientas de visualización de datos y aprendizaje automático en CellProfiler Analyst, las mediciones deberán guardarse en una base de datos mediante **ExportToDatabase**.
pt_br: Para usar as ferramentas de visualização de dados e aprendizado de máquina no CellProfiler Analyst, as medições precisarão ser salvas em um banco de dados usando **ExportToDatabase**.

source: Add a module **ExportToDatabase** located under the module *“File Processing” category*
es: Agregue un módulo **ExportToDatabase** ubicado debajo dede la categoría de módulos *“File Processing”*.
pt_br: Adicione um módulo **ExportToDatabase** localizado na categoria *“File Processing” do módulo*

source: **NOTE:** while in *Test mode*, the **ExportToDatabase** module will have a yellow warning sign in the pipeline panel and yellow- highlighted text in the module settings. Holding the mouse over the yellow-highlighted text informs the user that measurements produced in Test mode are not written to the database. This is normal behavior and does NOT indicate an error.
es: **NOTA:** mientras esté en *Test mode*, el módulo **ExportToDatabase** tendrá una señal de advertencia amarilla en el panel del pipeline y un texto resaltado en amarillo en el los ajustes del módulo. Al mantener el mouse sobre el texto resaltado en amarillo, se informa al usuario que las mediciones producidas en el modo de prueba no se escriben en la base de datos. Este es un comportamiento normal y NO indica un error.
pt_br: **NOTA:** enquanto estiver no *modo de teste*, o módulo **ExportToDatabase** terá um sinal de aviso amarelo no painel do pipeline e texto destacado em amarelo nas configurações do módulo. Manter o mouse sobre o texto destacado em amarelo informa ao usuário que as medições produzidas no modo Teste não são gravadas no banco de dados. Este é um comportamento normal e NÃO indica um erro.

source: Set up the module as in the image below:
es: Configure el módulo como en la imagen a continuación:
pt_br: Configure o módulo conforme imagem abaixo:

source: *Figure 8: The ExportToDatabase module. The yellow warning symbol warns you that since you've chosen to make individual tables for each object, you will only be able to examine one object at a time in CellProfiler Analyst.*
es: *Figura 8: El módulo ExportToDatabase. El símbolo amarillo de advertencia le avisa de que, como ha elegido hacer tablas individuales para cada objeto, sólo podrá examinar un objeto a la vez en CellProfiler Analyst.*
pt_br: *Figura 8: O módulo ExportToDatabase. O símbolo de aviso amarelo avisa que, como você optou por criar tabelas individuais para cada objeto, só será possível examinar um objeto de cada vez no CellProfiler Analyst.

source: Check the box “Write image thumbnails directly to database?” From the list-box that subsequently appears, select “rawDNA” and “rawGFP”; you can make multiple selections by using Ctrl-click (Windows) or Command-click (Mac). Leave the rest of the settings at the default values.
es: Marque la casilla “Write image thumbnails directly to database?”. En la lista desplegable que aparece a continuación, seleccione "rawDNA" y "rawGFP"; puede hacer selecciones múltiples pulsando Ctrl-clic (Windows) o Cmd-clic (Mac). Deje el resto de la configuración en los valores por defecto.
pt_br: Marque a caixa “Gravar miniaturas de imagens diretamente no banco de dados?” Na caixa de listagem que aparece posteriormente, selecione “rawDNA” e “rawGFP”; você pode fazer várias seleções usando Ctrl-clique (Windows) ou Command-clique (Mac). Deixe o restante das configurações com os valores padrão.

source: **NOTE:** Because you have different object counts for some of your different types of objects (the counts of Nuclei, Cells, and Cytoplasm will be the same, but the counts of Mitochondria and Nucleoli will not be), you will not be able to export the objects as a single data table but must instead use a different data table for each object. This will not affect the actual outcome of the experiment, but will mean that each object will get its own properties file and that you can only look at the measurement for one object at a time in CellProfiler Analyst.
es: **NOTA:** Debido a que tiene diferentes recuentos de objetos para algunos de sus diferentes tipos de objetos (los recuentos de Núcleos, Células y Citoplasma serán los mismos, pero los recuentos de Mitocondrias y Nucléolos no lo serán), no podrá exportar los objetos como una única tabla de datos, sino que deberá utilizar una tabla de datos diferente para cada objeto. Esto no afectará el resultado real del experimento, pero significará que cada objeto obtendrá su propio archivo de propiedades y que solo podrá ver la medición de un objeto a la vez en CellProfiler Analyst.
pt_br: **NOTA:** Como você tem contagens de objetos diferentes para alguns de seus diferentes tipos de objetos (as contagens de Núcleos, Células e Citoplasma serão as mesmas, mas as contagens de Mitocôndrias e Nucléolos não serão), você não será capaz de exportar os objetos como uma única tabela de dados, mas deverá usar uma tabela de dados diferente para cada objeto. Isso não afetará o resultado real do experimento, mas significará que cada objeto obterá seu próprio arquivo de propriedades e que você só poderá observar a medição de um objeto por vez no CellProfiler Analyst.

source: *Figure 9: The warning symbol warns you that since you've chosen to make individual tables for each object, you will only be able to examine one object at a time in CellProfiler Analyst.*
es: *Figura 9: El símbolo de advertencia le advierte que, dado que ha elegido crear tablas individuales para cada objeto, solo podrá examinar un objeto a la vez en CellProfiler Analyst.*
pt_br: *Figura 9: O símbolo de aviso avisa que como você optou por criar tabelas individuais para cada objeto, você só poderá examinar um objeto por vez no CellProfiler Analyst.*

source: **Relate Nucleoli and Mitochondria to their respective nuclei/cells**
es: **Relaciona los nucléolos y las mitocondrias con sus respectivos núcleos/células**
pt_br: **Relacione Nucléolos e Mitocôndrias com seus respectivos núcleos/células**

source: 14. Examine the settings of RelateObjects
es: 14. Examinar la configuración del módulo RelateObjects
pt_br: 14. Examine as configurações de RelateObjects

source: **After** your Measurement and **before** your Export modules you should find two RelateObjects modules. One relates Nucleoli to Nuclei, while the other relates Mitochondria to Cells.
es: **Después** de sus módulos Measurement y **antes** de sus módulos Export debería encontrar dos módulos RelateObjects. Uno relaciona Nucleolos con Núcleos, mientras que el otro relaciona Mitocondrias con Células.
pt_br: **Depois** dos módulos Measurement e antes** dos módulos Export, você deverá encontrar dois módulos RelateObjects. Um deles relaciona Nucléolos a Núcleos, enquanto o outro relaciona Mitocôndrias a Células.

source: Relating the objects allows you to create per-parent means (ie, for this cell what is the average size of an individual mitochondrion) and calculate distances from the child objects to the edge and/or the center of the parent (ie how far is each nucleolus from the center of the nucleus).
es: Relacionar los objetos permite crear medias por progenitor (es decir, para esta célula cuál es el tamaño medio de una mitocondria individual) y calcular distancias desde los objetos hijos hasta el borde y/o el centro del progenitor (es decir, a qué distancia está cada nucleolo del centro del núcleo).
pt_br: A relação dos objetos permite criar médias por pai (ou seja, para essa célula, qual é o tamanho médio de uma mitocôndria individual) e calcular as distâncias dos objetos filhos até a borda e/ou o centro do pai (ou seja, qual é a distância de cada nucléolo do centro do núcleo).

source: **Perform the analysis on ALL the images**
es: **Realizar el análisis de TODAS las imágenes**
pt_br: **Realize a análise em TODAS as imagens**

source: 15. **Run the pipeline (optional)**
es: 15. **Ejecute el pipeline (opcional)**
pt_br: 15. **Execute o pipeline (opcional)**

source: If you have time and/or if you’d like to play with the data in CellProfiler Analyst later, exit test mode, close the eyes next to each module, and run the pipeline
es: Si dispone de tiempo y/o si desea jugar con los datos en CellProfiler Analyst más tarde, salga del modo de prueba, cierre los ojos junto a cada módulo y ejecute el pipeline
pt_br: Se você tiver tempo e/ou se quiser trabalhar com os dados no CellProfiler Analyst mais tarde, saia do modo de teste, feche os olhos ao lado de cada módulo e execute o pipeline

source: The pipeline will create a database called BBBC022.db, containing the output of all of the measurements you have added to your pipeline
es: El pipeline creará una base de datos llamada BBBC022.db, que contendrá el resultado de todas las mediciones que haya añadido a su pipeline
pt_br: O pipeline criará um banco de dados chamado BBBC022.db, contendo a saída de todas as medições que você adicionou ao pipeline
