Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/AdvancedSegmentation.po
Languages: es, pt_br

source: Advanced segmentation and organelle analysis
es: Segmentación avanzada y análisis de organelas
pt_br: Segmentação avançada e análise de organelas

source: ***A computer exercise using the CellProfiler & CellProfiler Analyst softwares***
es: ***Un ejercicio informático utilizando los softwares CellProfiler y CellProfiler Analyst***
pt_br: ***Um exercício de computador usando os softwares CellProfiler e CellProfiler Analyst***

source: **Beth Cimini** <br> **Broad Institute of MIT and Harvard, Cambridge, MA**
pt_br: **Beth Cimini** <br> **Broad Institute do MIT e Harvard, Cambridge, MA**

source: **Background information:**
es: **Sobre las imágenes de este ejercicio:**
pt_br: **Informações de contexto:**

source: The images in this experiment come from the [Broad Bioimage Benchmark Collection](https://data.broadinstitute.org/bbbc/BBBC022/). They are 240 of 69,120 fields of U2OS cells treated with a panel of 1600 known bioactive compounds and imaged in five channels for a so-called Cell Painting assay- see Gustafsdottir et al, 2013 for more information. The compounds target a wide range of cell pathways, meaning that some cells and organelles will have very different morphologies both from each other and from the mock treated controls. This will give you an opportunity to try to find segmentation parameters that work across a wide range of conditions.
es: Las imágenes de este experimento provienen de la [Broad Bioimage Benchmark Collection] (https://data.broadinstitute.org/bbbc/BBBC022/). Son 240 de 69,120 campos de U2OS células tratadas con un panel de 1600 compuestos bioactivos conocidos y fotografiados en cinco canales para el llamado ensayo de Cell Painting; consulte Gustafsdottir et al, 2013 para obtener más información. Los compuestos se apuntan a una amplia gama de vías celulares, lo que significa que algunos células y organelas tendrán morfologías muy diferentes tanto entre sí como respecto de los controles. Esto le dará la oportunidad de intentar encontrar parámetros de segmentación que funcionen en una amplia gama de condiciones.
pt_br: As imagens neste experimento vêm da [Broad Bioimage Benchmark Collection](https://data.broadinstitute.org/bbbc/BBBC022/). Eles são 240 dos 69.120 campos de células U2OS tratados com um painel de 1.600 compostos bioativos conhecidos e imageadas em cinco canais para um chamado ensaio de pintura celular - consulte Gustafsdottir et al, 2013 para obter mais informações. Os compostos têm como alvo uma ampla gama de vias celulares, o que significa que algumas células e organelas apresentarão morfologias muito diferentes, tanto entre si quanto em relação aos controles tratados apenas com o veículo (mock). Isso lhe dará a oportunidade de tentar encontrar parâmetros de segmentação que funcionem em uma ampla gama de condições.

source: *Figure 1: Images and channels from a CellPainting assay.*
es: *Figura 1: Imágenes y canales de un ensayo de CellPainting.*
pt_br: *Figura 1: Imagens e canais de um ensaio CellPainting.

source: While in the traditional Cell Painting protocol we do not actually segment out any organelles (other than the nucleus), the large number of stained compartments make this an excellent set of images to find subcellular features. Finding the average or count of smaller objects inside a larger ‘parent’ object is a feature of many pipelines and an important skill to have in setting up a CellProfiler analysis.
es: Aunque en el protocolo tradicional de Cell Painting no segmentamos ningna organela (aparte del núcleo), el gran número de compartimentos teñidos hace que este conjunto de imágenes sea excelente para encontrar características subcelulares. Encontrar la media o el recuento de objetos más pequeños dentro de un objeto "parental" más grande es una característica de muchos pipelines y una habilidad importante para configurar un análisis CellProfiler.
pt_br: Embora no protocolo tradicional do ensaio Cell Painting nós não segmentamos de fato nenhuma organela (exceto o núcleo), o grande número de compartimentos corados faz desse um excelente conjunto de imagens para encontrar características subcelulares. Encontrar a média ou a contagem de objetos menores dentro de um objeto "parent" maior é um recurso de muitos pipelines e uma habilidade importante para a configuração de uma análise do CellProfiler.

source: Cell Painting generally consists of a few simple segmentation steps followed by adding as many measurement modules as can be reasonably included in a single pipeline; we have found that by doing this we can measure ~1500 features of each cell and from that create a ‘morphological profile’ that can be used to predict interesting biology including drug mechanisms of action, gene-pathway interactions, and more. See Bray et al 2016 and citations within for more information.
es: Cell Painting consiste generalmente en unos pocos pasos de segmentación simples seguidos de la adición de tantos módulos de medición como se puedan incluir razonablemente en una sola línea de producción; hemos descubierto que haciendo esto podemos medir ~1500 características de cada célula y a partir de ahí crear un "perfil morfológico" que se puede utilizar para predecir la biología interesante, incluyendo los mecanismos de acción de los fármacos, las interacciones entre genes y vías, y más. Para más información, véase Bray et al 2016 y sus citas.
pt_br: O Cell Painting geralmente consiste em algumas etapas simples de segmentação, seguidos pela adição do maior número possível de módulos de medição que possam ser incluídos de forma razoável em um único pipeline; constatamos que, ao fazer isso, é possível medir cerca de 1500 características de cada célula e, a partir disso, criar um “perfil morfológico” que pode ser usado para prever biologia de interesse, incluindo mecanismos de ação de fármacos, interações gene–via, entre outros. Veja Bray et al., 2016 e as citações contidas no trabalho para mais informações.

source: **Goals of this exercise:**
es: **Objetivos de este ejercicio:**
pt_br: **Objetivos deste exercício:**

source: This exercise will give you practice at finding segmentation parameters that will be robust across whatever variability may exist in your sample. This is not always straightforward, so examining your segmentation across a wide range of images will be necessary.
es: Este ejercicio le servirá de práctica para encontrar parámetros de segmentación que sean robustos frente a cualquier variabilidad que pueda existir en su muestra. Esto no siempre es sencillo, por lo que será necesario examinar la segmentación en una amplia gama de imágenes.
pt_br: Este exercício lhe dará prática para encontrar parâmetros de segmentação que serão robustos em qualquer variabilidade que possa existir em sua amostra. Isso nem sempre é simples, portanto, será necessário examinar sua segmentação em uma ampla gama de imagens.

source: *Figure 2: Examples of varied nuclei found in this data set.*
es: *Figura 2: Ejemplos de núcleos variados encontrados en este conjunto de datos.*
pt_br: *Figura 2: Exemplos da diversidade de núcleos encontrados nesse conjunto de dados.

source: This exercise will additionally show you some ways to pull out smaller features in your image by segmenting organelles within the cells and nuclei. You will also be shown how to use RelateObjects so that you can study the average counts, distances, and measurements of the smaller organelles inside their larger parent objects.
es: Este ejercicio le mostrará además algunas formas de extraer características más pequeñas de su imagen segmentando organelas dentro de las células y núcleos. También se le mostrará cómo utilizar RelateObjects para que pueda estudiar los recuentos medios, las distancias y las medidas de las organelas más pequeñas dentro de sus objetos parentales más grandes.
pt_br: Além disso, este exercício mostrará algumas maneiras de extrair recursos menores da imagem segmentando organelas dentro das células e dos núcleos. Também será mostrado como usar o RelateObjects para que você possa estudar as contagens médias, as distâncias e as medidas das organelas menores dentro de seus objetos maiores (parent).

source: **Materials necessary for this exercise:**
es: **Materiales necesarios para este ejercicio:**
pt_br: **Materiais necessários para este exercício:**

source: These 1200 images (240 sites in 5 channels) represent 120 wells from a single 384 well plate, either mock treated with DMSO or treated with a variety of bioactive compounds. A CSV file containing associated drug treatment information has also been included.
es: Estas 1200 imágenes (240 campos en 5 canales) representan 120 pocillos de una única placa de 384 pocillos, tratados con DMSO o con una variedad de compuestos bioactivos. También se ha incluido un archivo CSV con la información asociada al tratamiento farmacológico.
pt_br: Essas 1200 imagens (240 sítios em 5 canais) representam 120 poços de uma única placa de 384 poços, tratados com DMSO (mock/veículo) ou com uma variedade de compostos bioativos. Também foi incluído um arquivo CSV contendo as informações associadas aos tratamentos com os fármacos.

source: It is additionally expected that you are generally familiar with CellProfiler, preferably after completing the Translocation tutorial or a similar introductory exercise.
es: Además, se espera que esté familiarizado con CellProfiler, preferiblemente después de completar el tutorial de Translocación o un ejercicio introductorio similar.
pt_br: Além disso, espera-se que você já tenha familiaridade geral com o CellProfiler, de preferência após concluir o tutorial de Translocation ou algum exercício introdutório semelhante.

source: **Input images and configure metadata**
es: **Ingrese imágenes y configure metadatos**
pt_br: **Inserir imagens e configurar metadados**

source: 1. **Load images and metadata**
es: 1. **Cargar imágenes y metadatos**
pt_br: 1. **Carregar imagens e metadados**

source: Start CellProfiler by double-clicking the desktop icon <img src="./TutorialImages/CellProfilerLogo.png" alt="CellProfiler icon" width="35"/>
es: Inicie CellProfiler haciendo doble clic en el icono del escritorio <img src="./TutorialImages/CellProfilerLogo.png" alt="CellProfiler icon" width="35"/>
pt_br: Inicie o CellProfiler clicando duas vezes no ícone da área de trabalho <img src="./TutorialImages/CellProfilerLogo.png" alt="CellProfiler icon" width="35"/>

source: CellProfiler icon
es: Icono de CellProfiler
pt_br: Ícone do CellProfiler

source: Drag and drop the ‘BBBC022_Analysis_Start.cppipe’ file into the ‘Analysis modules’ box. 7 modules should pop up, and almost all of them will show errors. **This is the expected behavior.**
es: Arrastre y suelte el archivo 'BBBC022_Analysis_Start.cppipe' en la casilla 'Módulos de análisis' )Analysis Modules). Deberían aparecer 7 módulos, y casi todos mostrarán errores. **Este es el comportamiento esperado.
pt_br: Arraste e solte o arquivo "BBBC022_Analysis_Start.cppipe" na caixa "Analysis modules". Deverão aparecer 7 módulos, e quase todos eles mostrarão erros. **Esse é o comportamento esperado.**

source: Drag and drop the ‘BBBC022_20585_AE’ folder into the ‘File list’ box. It should automatically populate. Notice that illumination correction images (with a file extension of ‘.npy’) are included in this data set.
es: Arrastre y suelte la carpeta 'BBBC022_20585_AE' en el cuadro 'Lista de archivos'. Debería rellenarse automáticamente. Observe que las imágenes de corrección de iluminación (con extensión '.npy') están incluidas en este conjunto de datos.
pt_br: Arraste e solte a pasta "BBBC022_20585_AE" na caixa "File list". Ela ira preencher automaticamente. Observe que as imagens de correção de iluminação (com uma extensão de arquivo '.npy') estão incluídas nesse conjunto de dados.

source: 2. **Import metadata from the CSV**
es: 2. **Importar metadatos desde CSV**
pt_br: 2. **Importar metadados do CSV**

source: So that we can explore what cells treated with different drugs look like later in the exercise, we must add this information into CellProfiler from the CSV. Provided with this exercise is a CSV called ‘20585_AE.csv’ detailing drug treatment info for each image.
es: Para poder explorar el aspecto de las células tratadas con diferentes fármacos más adelante en el ejercicio, debemos añadir esta información a CellProfiler desde el CSV. Con este ejercicio se proporciona un CSV llamado '20585_AE.csv' que detalla la información del tratamiento farmacológico para cada imagen.
pt_br: Para que possamos explorar a morfologia das células tratadas com diferentes medicamentos mais adiante no exercício, devemos adicionar essas informações ao CellProfiler a partir do arquivo CSV. Este exercício inclui um CSV chamado "20585_AE.csv" que detalha as informações sobre o tratamento medicamentoso de cada imagem.

source: In the ‘Metadata’ module, three metadata extraction methods should already be present and fully configured:
es: En el módulo "Metadata", ya deberían estar presentes y totalmente configurados tres métodos de extracción de metadatos:
pt_br: No módulo "Metadata", três métodos de extração de metadados já devem estar presentes e totalmente configurados:

source: The first pulls Well, Site, and Channel metadata from all of the image files except for the illumination correction functions
es: La primera extrae los metadatos de Pocillo, Campo y Canal de todos los archivos de imagen excepto de las funciones de corrección de iluminación
pt_br: A primeira extrai metadados do poço (Well), sítio (Site) e canal (Channel) de todos os arquivos de imagem, exceto das funções de correção de iluminação

source: The second pulls Plate metadata from the image folder
es: El segundo extrae los metadatos de la Placa de la carpeta de imágenes
pt_br: O segundo extrai os metadados da placa (Plate) da pasta de imagens

source: The third pulls Plate metadata from the illumination correction functions
es: El tercero extrae metadatos de Placa de las funciones de corrección de iluminación
pt_br: O terceiro extrai metadados de placa (Plate) das funções de correção de iluminação

source: The fourth metadata extraction step requires you to tell CellProfiler the location of the CSV file. It is looking for it in CellProfiler's Default Input Folder, which we must therefore configure.
es: El cuarto paso de extracción de metadatos requiere que le indique a CellProfiler la ubicación del archivo CSV. Lo busca en la Carpeta de Entrada Predeterminada de CellProfiler, que por lo tanto debemos configurar.
pt_br: A quarta etapa de extração de metadados exige que você informe ao CellProfiler o local do arquivo CSV. Ele inicialmente procura na pasta de entrada padrão (Default Input Folder) do CellProfiler, que deve ser configurada.

source: Select the <img src="./TutorialImages/OutputSettings.png" width="120"/> button in the bottom left corner of the screen.
es: Seleccione el botón <img src="./TutorialImages/OutputSettings.png" width="120"/> en la esquina inferior izquierda de la pantalla.
pt_br: Selecione o botão <img src="./TutorialImages/OutputSettings.png" width="120"/> no canto inferior esquerdo da tela.

source: Set the ‘Default Input Folder’ to the location of ‘20585_AE.csv’ within the exercise folder
es: Establezca la 'Carpeta de entrada por defecto' ('Default Input Folder') en la ubicación de '20585_AE.csv' dentro de la carpeta del ejercicio.
pt_br: Defina a pasta do exercício, que contém o arquivo "20585_AE.csv", como pasta de entrada padrão (Default Input Folder).

source: Return to the ‘Metadata’ module and press ‘Update’. You should now see a number of columns in the Metadata window.
es: Vuelva al módulo "Metadatos" y pulse "Actualizar". Ahora debería ver una serie de columnas en la ventana Metadatos.
pt_br: Volte ao módulo "Metadata" e pressione atualizar (Update). Agora você deve ver várias colunas na janela Metadados.

source: If you like, examine the CSV and how the ‘Match file and image’ settings are configured:
es: Si lo desea, examine el CSV y cómo están configurados los ajustes de "Coincidir archivo e imagen" ('Match file and image'):
pt_br: Se desejar, examine o arquivo CSV e como as configurações de "Match file and image" estão definidas:

source: Image_Metadata_PlateID (from the spreadsheet) is matched to Plate (extracted from the folder name by the second extraction step)
es: Image_Metadata_PlateID (de la hoja de cálculo) se empareja con Plate (extraído del nombre de la carpeta por el segundo paso de extracción)
pt_br: Image_Metadata_PlateID (da planilha) é correspondido a Plate (extraído do nome da pasta pela segunda etapa de extração)

source: Image_Metadata_CPD_WELL_POSITION (from the spreadsheet) is matched to Well (extracted from the file name by the first extraction step)
es: Image_Metadata_CPD_WELL_POSITION (de la hoja de cálculo) se corresponde con Well (extraído del nombre del archivo mediante el primer paso de extracción)
pt_br: Image_Metadata_CPD_WELL_POSITION (da planilha) corresponde a Well (extraído do nome do arquivo pela primeira etapa de extração)

source: 3. **Examine the channel mappings in NamesAndTypes (optional)**
es: 3. **Examine las asignaciones de canales en NamesAndTypes (opcional)**
pt_br: 3. **Examine os mapeamentos de canais em NamesAndTypes (opcional)**

source: The channel mapping here is a bit more complicated than anything we've worked with before- we have a single set of illumination correction images that map to each and every well and site. We can use the metadata we extracted in the last module to make that association possible.
es: La asignación de canales es un poco más complicada que cualquier otra cosa con la que hayamos trabajado antes: tenemos un único conjunto de imágenes de corrección de la iluminación que se asignan a todos y cada uno de los pocillos y campos. Podemos utilizar los metadatos que extrajimos en el último módulo para hacer posible esa asociación.
pt_br: O mapeamento de canais aqui é um pouco mais complicado do que qualquer coisa com que tenhamos trabalhado antes - temos um único conjunto de imagens de correção de iluminação que mapeia cada poço e local. Podemos usar os metadados que extraímos no último módulo para tornar essa associação possível.

source: Two different ways of mapping images to channel names are demonstrated here. There are several others, and often you could create several correct mappings for a given set of images, but these may serve as a helpful example to refer to in your own work.
es: Aquí se muestran dos formas diferentes de asignar imágenes a nombres de canales. Hay muchas otras, y a menudo se podrían crear varias asignaciones correctas para un conjunto dado de imágenes, pero éstas pueden servir como ejemplo útil para referirse a ellas en su propio trabajo.
pt_br: Duas maneiras diferentes de mapear imagens para nomes de canais são demonstradas aqui. Há várias outras e, muitas vezes, você poderia criar vários mapeamentos corretos para um determinado conjunto de imagens, mas esses podem servir como um exemplo útil para consultar em seu próprio trabalho.

source: The ‘.tif’ image files are assigned a name by the Metadata extracted in the previous module (specifically ChannelNumber)
es: A los archivos de imagen '.tif' se les asigna un nombre mediante los metadatos extraídos en el módulo anterior (concretamente ChannelNumber)
pt_br: Os arquivos de imagem '.tif' recebem um nome atribuído pelos metadados extraídos no módulo anterior (especificamente ChannelNumber)

source: The ‘.npy’ illumination correction functions are assigned a name based on a unique string in the name (such as ‘IllumER’)
es: A las funciones de corrección de la iluminación '.npy' se les asigna un nombre basado en una cadena única en el nombre (como 'IllumER')
pt_br: As funções de correção de iluminação '.npy' recebem um nome com base em uma string exclusiva no nome (como "IllumER")

source: As there is only one set of illumination correction functions for each entire plate, the image sets cannot simply be constructed by using ‘Image set matching’ as ‘Order’.
es: Dado que solo hay un conjunto de funciones de corrección de iluminación para toda la placa, los conjuntos de imágenes no pueden construirse simplemente utilizando 'Image set matching' como 'Order'.
pt_br: Como há apenas um conjunto de funções de correção de iluminação para cada placa inteira, os conjuntos de imagens não podem ser simplesmente construídos usando "Image set matching" como "Order".

source: Scroll to the bottom of the ‘NamesAndTypes’ to see how the image sets are constructed
es: Desplácese hasta la parte inferior de "NamesAndTypes" para ver cómo se construyen los conjuntos de imágenes
pt_br: Role até a parte inferior da seção "NamesAndTypes" para ver como os conjuntos de imagens são construídos

source: ‘Image set matching’ is set to ‘Metadata’
es: La "Coincidencia de conjunto de imágenes" ("Image set matching") se establece en "Metadata".
pt_br: 'Image set matching' está definido como 'Metadata'

source: Each image channel is set to ‘Plate->Well->Site’.
es: Cada canal de imagen se ajusta a 'Placa->Pocillo->Campo'.
pt_br: Cada canal de imagem é definido como "Plate-&gt;Well-&gt;Site".

source: Each illumination correction function is set to ‘Plate->(None)->(None)’
es: Cada función de corrección de iluminación se establece en 'Placa->(Ninguna)->(Ninguna)'.
pt_br: Cada função de correção de iluminação é definida como "Plate-&gt;(None)-&gt;(None)

source: Metadata based matching can be useful in any circumstance where a larger group of images needs to be mapped with a smaller one, such as every plate in an image set having its own illumination correction function or every movie in a series of timelapse movies being matched to its own unique cropping mask.
es: El emparejamiento basado en metadatos puede ser útil en cualquier circunstancia en la que sea necesario emparejar un grupo más grande de imágenes con otro más pequeño, como por ejemplo que cada placa de un conjunto de imágenes tenga su propia función de corrección de la iluminación o que cada película de una serie de vídeos timelapse se empareje con su propia máscara de recorte única.
pt_br: A correspondência baseada em metadados pode ser útil em qualquer circunstância em que um grupo maior de imagens precise ser mapeado com um grupo menor, como, por exemplo, cada placa em um conjunto de imagens com sua própria função de correção de iluminação ou cada filme em uma série de filmes de lapso de tempo sendo correspondido à sua própria máscara de corte exclusiva.

source: *Figure 3: A section of the ‘Image set matching’ dialog.*
es: *Figura 3: Sección del cuadro de diálogo "Coincidencia de conjuntos de imágenes " ("Image set matching")*.
pt_br: *Figura 3: Uma seção da caixa de diálogo "Image set matching".

source: **Illumination correction**
es: **Correción de Iluminación**
pt_br: **Correção de iluminação**

source: 4. **Examine the output of the CorrectIlluminationApply module (optional)**
es: 4. **Examine la salida del módulo CorrectIlluminationApply (opcional)**
pt_br: 4. **Examine a saída do módulo CorrectIlluminationApply (opcional)**
