Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/AdvancedSegmentation.po
Languages: es, pt_br

source: Since microscope objectives don't typically have a completely uniform illumination pattern, applying an illumination correction function can help make segmentation better and measurements more even by compensating for this. Pay close attention to the top of the field of view to see the greatest effect.
es: Dado que los objetivos de microscopio no suelen tener un patrón de iluminación completamente uniforme, la aplicación de una función de corrección de iluminación puede ayudar a mejorar la segmentación y a que las mediciones sean más uniformes al compensar este hecho. Preste mucha atención a la parte superior del campo de visión para ver el mayor efecto.
pt_br: Como as objetivas do microscópio não costumam ter um padrão de iluminação completamente uniforme, a aplicação de uma função de correção de iluminação pode ajudar a melhorar a segmentação e tornar as medições mais uniformes, compensando esse fato. Preste muita atenção na parte superior do campo de visão para ver o maior efeito.

source: Enter test mode and hit ‘Step’ to run the CorrectIlluminationApply module.
es: Entre en el modo de prueba y pulse 'Paso' ('Step') para ejecutar el módulo CorrectIlluminationApply.
pt_br: Entre no modo de teste e pressione "Step" para executar o módulo CorrectIlluminationApply.

source: Briefly examine the output of the CorrectIlluminationApply module- you can see that the illumination correction functions show significant heterogeneity across the field of view.
es: Examine brevemente la salida del módulo CorrectIlluminationApply: puede ver que las funciones de corrección de iluminación muestran una heterogeneidad significativa en todo el campo de visión.
pt_br: Examine brevemente a saída do módulo CorrectIlluminationApply - você pode ver que as funções de correção de iluminação mostram uma heterogeneidade significativa no campo de visão.

source: These functions were created by averaging and smoothing all 3456 images from this plate, indicating the image captured is consistently dimmer in those regions for nearly all images.
es: Estas funciones se crearon promediando y suavizando las 3456 imágenes de esta placa, lo que indica que la imagen captada es sistemáticamente más tenue en esas regiones en casi todas las imágenes.
pt_br: Essas funções foram criadas pela média e suavização de todas as 3456 imagens dessa placa, indicando que a imagem capturada é consistentemente mais escura nessas regiões em quase todas as imagens.

source: Also note that while the illumination correction functions for each channel are similar, they aren’t identical; each channel in your own experiments should therefore be illumination corrected independently.
es: - También ten en cuenta que, aunque las funciones de corrección de iluminación para cada canal son similares, no son idénticas; por lo tanto, cada canal en tus propios experimentos debe corregirse independientemente.
pt_br: Observe também que, embora as funções de correção de iluminação para cada canal sejam semelhantes, elas não são idênticas; portanto, cada canal em seus próprios experimentos deve ser corrigido independentemente.

source: *Figure 4: Application of the illumination correction functions.*
es: *Figura 4: Aplicación de las funciones de corrección de iluminación.*
pt_br: *Figura 4: Aplicação das funções de correção de iluminação.

source: **Segmenet Nuclei, Cells and Cytoplasm**
es: **Segmentar Núcleos , Células y Citoplasma**
pt_br: **Núcleos, células e citoplasma segmentados**

source: 5. **IdentifyPrimaryObjects- Nuclei**
es: 5. **IdentifyPrimaryObjects - Núcleos**
pt_br: 5. **IdentificarPrimaryObjects- Núcleos**

source: Next we'll take a first pass at identifying nuclei and cells in our initial image.
es: A continuación, realizaremos una primera pasada para identificar núcleos y células en nuestra imagen inicial.
pt_br: Em seguida, faremos uma primeira tentativa de identificar núcleos e células em nossa imagem inicial.

source: **After** the CorrectIlluminationApply module but **before** any others, add an IdentifyPrimaryObjects module (from the ‘Object Processing’ module category).
es: **Después** del módulo CorrectIlluminationApply pero **antes** de cualquier otro, añade un módulo IdentifyPrimaryObjects (de la categoría de módulos 'Procesamiento de objetos').
pt_br: **Depois** do módulo CorrectIlluminationApply, mas **antes** de qualquer outro, adicione um módulo IdentifyPrimaryObjects (da categoria de módulo 'Object Processing').

source: Create objects called Nuclei by segmenting on the Hoechst channel. Hit ‘Step’ to run the module. How does your segmentation look?
es: Cree objetos llamados Núcleos segmentando en el canal Hoechst. Pulse 'Paso' para ejecutar el módulo. ¿Cómo se ve su segmentación?
pt_br: Crie objetos chamados Nuclei segmentando no canal Hoechst. Pressione "Step" para executar o módulo. Qual é a aparência de sua segmentação?

source: Use the magnifying glass at the top of the window to zoom in on an area that was segmented poorly, then update some of your parameters in IdentifyPrimaryObjects and hit ‘Step’ to rerun the segmentation.
es: Utilice la lupa situada en la parte superior de la ventana para ampliar un área que se haya segmentado mal, actualice algunos de los parámetros en IdentifyPrimaryObjects y pulse "Paso" para volver a ejecutar la segmentación.
pt_br: Use a lupa na parte superior da janela para ampliar uma área que foi mal segmentada e, em seguida, atualize alguns de seus parâmetros em IdentifyPrimaryObjects e clique em "Step" para executar novamente a segmentação.

source: Adjust the segmentation parameters until you feel you’re ready to move on to identifying the cells around the nuclei; as you will test the parameters for robustness later, however, the identification should be good but doesn’t need to be perfect before you move on.
es: Ajuste los parámetros de segmentación hasta que considere que está listo para pasar a la identificación de las células alrededor de los núcleos; sin embargo, como más adelante comprobará la solidez de los parámetros, la identificación debe ser buena pero no es necesario que sea perfecta antes de pasar a la siguiente fase.
pt_br: Ajuste os parâmetros de segmentação até sentir que está pronto para passar a identificar as células ao redor dos núcleos; como você testará a robustez dos parâmetros mais tarde, no entanto, a identificação deve ser boa, mas não precisa ser perfeita, antes de prosseguir.

source: 6. **IdentifySecondaryObjects- Cells**
es: 6. **IdentifySecondaryObjects - Células**
pt_br: 6. **IdentificarSecondaryObjects-Células**

source: **After** the IdentifyPrimaryObjects module but **before** the EnhanceOrSuppressFeatures module, add an IdentifySecondaryObjects module.
es: **Después** del módulo IdentifyPrimaryObjects pero **antes** del módulo EnhanceOrSuppressFeatures, añada un módulo IdentifySecondaryObjects.
pt_br: **Depois do módulo IdentifyPrimaryObjects, mas antes do módulo EnhanceOrSuppressFeatures, adicione um módulo IdentifySecondaryObjects.

source: Create an object called Cells that is seeded on the Nuclei primary objects that you just created; use the Ph_golgi image.
es: Cree un objeto llamado Células que se siembra en los objetos primarios Núcleos que acaba de crear; utilice la imagen Ph_golgi.
pt_br: Crie um objeto chamado Cells que seja semeado nos objetos primários Nuclei que você acabou de criar; use a imagem Ph_golgi.

source: For the purposes of this exercise, you need not worry about excluding cell bodies that touch the edge of the image.
es: A efectos de este ejercicio, no debe preocuparse por excluir los cuerpos celulares que tocan el borde de la imagen.
pt_br: Para fins deste exercício, você não precisa se preocupar em excluir os corpos celulares que tocam a borda da imagem.

source: Examine the segmentation and adjust the segmentation parameters until you feel you’re ready to test them on another image; they need not be perfect before you move on.
es: Examine la segmentación y ajuste los parámetros de segmentación hasta que considere que está preparado para probarlos en otra imagen; no es necesario que sean perfectos antes de seguir adelante.
pt_br: Examine a segmentação e ajuste os parâmetros de segmentação até sentir que está pronto para testá-los em outra imagem; eles não precisam estar perfeitos antes de prosseguir.

source: 7. **Test the robustness of your segmentation parameters across multiple compounds**
es: 7. **Pruebe la robustez de sus parámetros de segmentación en múltiples compuestos**
pt_br: 7. **Teste a robustez dos seus parâmetros de segmentação em vários compostos**

source: It's (relatively!) easy to come up with a good set of segmentation parameters for a single image or a set of similar images; this data set however contains images from cells treated with many different classes of drugs, many of which have very different phenotypes. It's valuable to learn how to create a set of parameters that can segment cells that display a variety of morphologies since you may come across a similar problem in your own experiments!
es: Es (¡relativamente!) fácil conseguir un buen conjunto de parámetros de segmentación para una sola imagen o un conjunto de imágenes similares; sin embargo, este conjunto de datos contiene imágenes de células tratadas con muchas clases diferentes de fármacos, muchas de las cuales tienen fenotipos muy distintos. Es valioso aprender a crear un conjunto de parámetros que puedan segmentar células que muestren una variedad de morfologías, ¡ya que puede encontrarse con un problema similar en sus propios experimentos!
pt_br: É (relativamente!) fácil criar um bom conjunto de parâmetros de segmentação para uma única imagem ou um conjunto de imagens semelhantes; no entanto, esse conjunto de dados contém imagens de células tratadas com muitas classes diferentes de medicamentos, muitas das quais têm fenótipos muito diferentes. É importante aprender a criar um conjunto de parâmetros que possa segmentar células que exibem uma variedade de morfologias, pois você pode se deparar com um problema semelhante em seus próprios experimentos!

source: Go to Test->Choose Image Set to bring up a list of the images in your experiment.
es: Vaya a 'Test->Choose Image Set ' para que aparezca una lista de las imágenes de su experimento.
pt_br: Vá para Test-&gt;Choose Image Set para exibir uma lista das imagens em seu experimento.

source: *Figure 5: A section of the ‘Choose Image Set’ menu.*
es: *Figura 5: Sección del menú "Elegir conjunto de imágenes "*.
pt_br: *Figura 5: Uma seção do menu 'Choose Image Set'.

source: Look at the column titled ‘Image_Metadata_SOURCE_COMPOUND_NAME’ to see what chemical was used in each well of the experiment. You may click on the column to sort the whole table by the values in it if you so desire.
es: Mire la columna titulada 'Image_Metadata_SOURCE_COMPOUND_NAME' para ver qué producto químico se utilizó en cada pocillo del experimento. Si lo desea, puede hacer clic en la columna para ordenar toda la tabla por los valores que contiene.
pt_br: Observe a coluna intitulada "Image_Metadata_SOURCE_COMPOUND_NAME" para ver qual produto químico foi usado em cada poço do experimento. Você pode clicar na coluna para classificar a tabela inteira pelos valores nela contidos, se desejar.

source: Choose a row where ‘Image_Metadata_SOURCE_COMPOUND_NAME’ is blank- this will be a mock treated well. Press the ‘OK’ button, then run that image in test mode for your first 3 modules (through your IdentifySecondaryObjects step). Examine the output – did your nuclear and cellular segmentation hold up compared to the first images you looked at? Once your segmentation is good, try it on one additional mock treated image.
es: Elija una fila en la que 'Image_Metadata_SOURCE_COMPOUND_NAME' esté en blanco - será un control con DMSO. Pulse el botón "OK" y ejecute la imagen en modo de prueba para los 3 primeros módulos (a través del paso IdentifySecondaryObjects). Examine el resultado: ¿se ha mantenido la segmentación nuclear y celular en comparación con las primeras imágenes? Una vez que su segmentación sea buena, pruébela en una imagen tratada adicional.
pt_br: Escolha uma linha em que "Image_Metadata_SOURCE_COMPOUND_NAME" esteja em branco - essa será uma simulação bem tratada. Pressione o botão "OK" e, em seguida, execute essa imagem no modo de teste para seus três primeiros módulos (por meio da etapa IdentifySecondaryObjects). Examine o resultado - a segmentação nuclear e celular se manteve em comparação com as primeiras imagens que você examinou? Quando sua segmentação estiver boa, experimente-a em mais uma imagem simulada tratada.

source: Test your segmentation on images from a few different compounds- you may choose ones you’ve worked with before, random ones, or some combination therein; if possible avoid using multiple compounds you KNOW have the same mechanism of action, though it’s alright if they occasionally do. Update your segmentation parameters until they work well on a few different compound wells, then go back to a mock treated well to make sure it still works well there.
es: Pruebe su segmentación en imágenes de algunos compuestos diferentes - puede elegir algunos con los que haya trabajado antes, otros al azar, o alguna combinación de los mismos; si es posible evite utilizar múltiples compuestos que usted SABE que tienen el mismo mecanismo de acción, aunque no pasa nada si ocasionalmente lo tienen. Actualice sus parámetros de segmentación hasta que funcionen bien en unos cuantos pocillos de compuestos diferentes, y luego vuelva a un pocillo Control para asegurarse de que sigue funcionando bien allí.
pt_br: Teste sua segmentação em imagens de alguns compostos diferentes - você pode escolher aqueles com os quais já trabalhou antes, os aleatórios ou alguma combinação deles; se possível, evite usar vários compostos que você SABE que têm o mesmo mecanismo de ação, embora não haja problema se ocasionalmente tiverem. Atualize seus parâmetros de segmentação até que eles funcionem bem em alguns poços de compostos diferentes e, em seguida, volte a um poço tratado simulado para ter certeza de que ainda funciona bem lá.

source: You’re encouraged to explore the compound list on your own, but if you find yourself consistently ending up with images that look similar you can try adding images from the following list of wells- A08, A12, B12, B18, C7, D6, D19, D22, E3
es: Te animamos a que explores la lista de compuestos por tu cuenta, pero si te encuentras constantemente con imágenes parecidas, puedes intentar añadir imágenes de la siguiente lista de pocillos: A08, A12, B12, B18, C7, D6, D19, D22, E3.
pt_br: Incentivamos você a explorar a lista de compostos por conta própria, mas se acabar sempre com imagens semelhantes, tente adicionar imagens da seguinte lista de poços: A08, A12, B12, B18, C7, D6, D19, D22, E3

source: Some hints on what to play with: \- In both IdentifyPrimaryObjects and IdentifySecondaryObjects adjusting the threshold limits can be a good thing for when wells are empty, confluent, or have bright debris in them \- In both IdentifyPrimaryObjects and IdentifySecondaryObjects adjusting the threshold method may lead to better (or worse!) results. \- In IdentifyPrimaryObjects, adjusting the declumping settings (make sure to turn 'Use advanced settings?' on) will probably be necessary for a robust segmentation \- In IdentifySecondaryObjects, you will want to test the effects of using the various methods for identifying secondary objects (Propagation, Watershed-Image, Distance-N, etc) and, if using Propagation, the regularization factor.
es: Algunos consejos sobre con qué parámetros jugar: \- Tanto en IdentifyPrimaryObjects como en IdentifySecondaryObjects, ajustar los límites de umbralización puede ser una buena opción cuando los pocillos están vacíos, confluentes o tienen residuos brillantes. \- Tanto en IdentifyPrimaryObjects como en IdentifySecondaryObjects, ajustar el método de umbralización puede conducir a mejores (¡o peores!) resultados. \- En IdentifyPrimaryObjects, probablemente sea necesario ajustar la configuración de desagregación (declumping) (asegúrese de activar 'Use advanced settings?') para una segmentación robusta. \- En IdentifySecondaryObjects, querrá probar los efectos del uso de los distintos métodos para identificar objetos secundarios (Propagation, Watershed-Image, Distance-N, etc) y, si se usa Propagation, el factor de regularización.
pt_br: Algumas dicas sobre o que brincar: \- Em ambos IdentificarPrimaryObjects e IdentificarSecondaryObjects ajustar os limites pode ser uma boa coisa para quando os poços estão vazios, confluentes ou têm detritos brilhantes neles \- Em ambos IdentificarPrimaryObjects e IdentificarSecondaryObjects ajustar o método de limite pode levar a resultados melhores (ou piores!). \- Em IdentifiquePrimaryObjects, o ajuste das configurações de desagregação (certifique-se de ativar 'Usar configurações avançadas?') provavelmente será necessário para uma segmentação robusta \- Em IdentifiqueSecondaryObjects, você desejará testar os efeitos do uso de vários métodos para identificar secundários objetos (Propagação, Imagem da Bacia Hidrográfica, Distância-N, etc) e, se estiver usando Propagação, o fator de regularização.

source: 8. **IdentifyTertiaryObjects- Cytoplasm**
es: 8. **IdentifyTertiaryObjects - Citoplasma**
pt_br: 8. **IdentificarObjetos Terciários - Citoplasma**

source: **After** the IdentifySecondaryObjects module but **before** the EnhanceOrSuppressFeatures module, add an IdentifyTertiaryObjects module.
es: **Después** del módulo IdentifySecondaryObjects pero **antes** del módulo EnhanceOrSuppressFeatures, añada un módulo IdentifyTertiaryObjects.
pt_br: **Após o módulo IdentifySecondaryObjects, mas antes do módulo EnhanceOrSuppressFeatures, adicione um módulo IdentifyTertiaryObjects.

source: Create an object called Cytoplasm using the Cell and Nuclei objects you’ve created; ‘Shrink smaller object prior to subtraction?’ should both set to ‘No’.
es: Cree un objeto llamado Citoplasma utilizando los objetos Célula y Núcleo que ha creado; '¿Reducir objeto más pequeño antes de la sustracción?' ("Shrink smaller object prior to subtraction?") debe estar en 'No'.
pt_br: Crie um objeto chamado Cytoplasm usando os objetos Cell e Nuclei que você criou; a opção "Shrink smaller object prior to subtraction?" deve ser definida como "No".

source: **Segment Nucleoli inside the Nuclei**
es: **Segmentar nucléolos dentro de los núcleos**
pt_br: **Segmentar Nucléolos dentro dos Núcleos**

source: 9. **Examine the steps used to segment the Nucleoli**
es: 9. **Examine los pasos utilizados para segmentar los nucléolos**
pt_br: 9. **Examine as etapas usadas para segmentar os nucléolos**

source: The next 3 modules have to do with the creation of the Nucleoli objects. Look at the output from each to see how the image is transformed to aid in segmentation.
es: Los siguientes 3 módulos tienen que ver con la creación de los objetos Nucleolos. Observa la salida de cada uno para ver cómo la imagen se transforma para ayudar en la segmentación.
pt_br: Os próximos três módulos têm a ver com a criação dos objetos Nucléolos. Observe a saída de cada um deles para ver como a imagem é transformada para ajudar na segmentação.

source: EnhanceOrSuppressFeatures is a module that helps enhance particular parts of an image- in this case, punctate objects or ‘Speckles’. By specifying the feature size, you can enhance different parts of the object. As we are looking for nucleoli, we apply this to the RNA channel (Syto) image, and call the output ‘FilteredRNA’. (See Fig 6 below)
es: EnhanceOrSuppressFeatures es un módulo que ayuda a realzar partes concretas de una imagen - en este caso, objetos punteados o 'Speckles'. Especificando el tamaño de la característica, puede realzar diferentes partes del objeto. Como estamos buscando nucleolos, aplicamos esto a la imagen del canal de ARN (Syto), y llamamos al resultado 'FilteredRNA'. (Véase la figura 6)
pt_br: EnhanceOrSuppressFeatures é um módulo que ajuda a aprimorar partes específicas de uma imagem - neste caso, objetos pontuais ou "Speckles". Ao especificar o tamanho do recurso, você pode aprimorar diferentes partes do objeto. Como estamos procurando nucléolos, aplicamos isso à imagem do canal de RNA (Syto) e chamamos o resultado de "FilteredRNA". (Veja a Figura 6 abaixo)

source: MaskImage allows you to create a version of the ‘FilteredRNA’ image called ‘SytoNuclei’ where all of the pixels except the ones you specify are set to an intensity of 0- in this case, we set to 0 any pixel not inside a nucleus. By doing this, we can decrease the likelihood of detecting the cytoplasmic RNA dots.
es: MaskImage le permite crear una versión de la imagen 'FilteredRNA' llamada 'SytoNuclei' donde todos los píxeles excepto los que usted especifique se ajustan a una intensidad de 0- en este caso, ajustamos a 0 cualquier píxel que no esté dentro de un núcleo. Haciendo esto, podemos disminuir la probabilidad de detectar los puntos de ARN citoplasmático.
pt_br: A MaskImage permite criar uma versão da imagem "FilteredRNA" chamada "SytoNuclei", em que todos os pixels, exceto os que você especificar, são definidos com intensidade 0 - nesse caso, definimos como 0 qualquer pixel que não esteja dentro de um núcleo. Ao fazer isso, podemos diminuir a probabilidade de detectar os pontos de RNA citoplasmáticos.

source: IdentifyPrimaryObjects is used to find the Nucleoli- this is a Primary object segmentation because we are not using another object as a seed to grow around, but only segmenting based off the intensity in our ‘SytoNuclei’ image.
es: IdentifyPrimaryObjects se utiliza para encontrar los Nucleolos - esta es una segmentación de objetos primarios porque no estamos utilizando otro objeto como una semilla para crecer alrededor, pero sólo la segmentación basada en la intensidad en nuestra imagen 'SytoNuclei'.
pt_br: IdentifyPrimaryObjects é usado para encontrar o nucléolo - essa é uma segmentação de objeto primário porque não estamos usando outro objeto como semente para crescer, mas apenas segmentando com base na intensidade da nossa imagem "SytoNuclei".

source: If you like, you can add an "OverlayOutlines" module at this point to overlay the identified nucleoli on the original Syto image to assure yourself that the segmentation not only matches the speckle-enhanced ‘SytoNuclei’ image, but also looks accurate on the unprocessed image as well. This is not necessary but can be a nice "sanity check".
es: Si lo desea, puede añadir un módulo "OverlayOutlines" en este punto para superponer los nucleolos identificados en la imagen Syto original para asegurarse de que la segmentación no sólo coincide con la imagen 'SytoNuclei' con 'Speckles' mejorados, sino que también es precisa en la imagen sin procesar. Esto no es necesario, pero puede ser una buena comprobación de la bondad de la segmentación.
pt_br: Se desejar, você pode adicionar um módulo "OverlayOutlines" neste ponto para sobrepor os nucléolos identificados na imagem original do Syto para garantir que a segmentação não apenas corresponda à imagem "SytoNuclei" aprimorada por manchas, mas também pareça precisa na imagem não processada. Isso não é necessário, mas pode ser uma boa "verificação de sanidade".

source: *Figure 6: Enhancing the Syto image allows you to isolate nucleoli against the nucleoplasmic background signal.*
es: *Figura 6: La mejora de la imagen Syto permite aislar los nucleolos frente a la señal de fondo nucleoplásmica.*
pt_br: *Figura 6: O aprimoramento da imagem Syto permite isolar os nucléolos em relação ao sinal de fundo do nucleoplasma.

source: **Segment the Mitochondria inside the Cytoplasm**
es: **Segmentar las mitocondrias dentro del citoplasma**
pt_br: **Segmentar as mitocôndrias dentro do citoplasma**
