Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/BeginnerSegmentation.po
Languages: es, pt_br

source: Command line execution of Cellpose
es: Ejecución de Cellpose desde la línea de comando
pt_br: Execução de linha de comando do Cellpose

source: Loading the label masks into CellProfiler
es: Cargando las máscaras etiquetadas en CellProfiler
pt_br: Carregando as máscaras de rótulo no CellProfiler

source: Open up a clean copy of CellProfiler (or run File -> New Project) and drag `bonus_1_import_masks.cppipe` into the pipeline panel.
es: Abre una copia limpia de CellProfiler (o ejecuta File -> New Project) y arrastra `bonus_1_import_masks.cppipe` al panel de flujo de trabajo.
pt_br: Abra uma cópia limpa do CellProfiler (ou execute Arquivo -> Novo Projeto) e arraste `bonus_1_import_masks.cppipe` para o painel do pipeline.

source: Drag the `images_Illum-corrected` subfolder from the main Beginner Segmentation exercise and also the `cellpose_masks_cells` subfolder from this exercise. *Do not drag in the `cellpose_masks_nuclei` folder.*
es: Arrastra la subcarpeta `images_Illum-corrected` del ejercicio principal de Segmentación para Principiantes y también la subcarpeta `cellpose_masks_cells` de este ejercicio. **No arrastres a la carpeta `cellpose_masks_nuclei`.**
pt_br: Arraste a subpasta `images_Illum-corriged` do exercício principal de segmentação para iniciantes e também a subpasta `cellpose_masks_cells` deste exercício. *Não arraste a pasta `cellpose_masks_nuclei`.*

source: Put CellProfiler into TestMode <img src="./TutorialImages/startTestMode.png" width="120"/>, open the eye icon <img src="./TutorialImages/EyeOpen.png" width="50"/> next to OverlayOutlines, and then hit <img src="./TutorialImages/Step.png" width="120"/> 3 times to create a classical segmentation and compare it with the Cellpose-generated version. You can check the settings in the OverlayOutlines module to see which outline color corresponds to which segmentation in the output.
es: Coloca CellProfiler en Modo de Prueba (TestMode) <img src="./TutorialImages/startTestMode.png" width="120"/>, abre el ícono del ojo <img src="./TutorialImages/EyeOpen.png" width="50"/> junto a OverlayOutlines y luego presiona <img src="./TutorialImages/Step.png" width="120"/> 3 veces para crear una segmentación clásica y compararla con la versión generada por Cellpose. Puedes verificar la configuración en el módulo OverlayOutlines para ver qué color de contorno corresponde a qué segmentación en la salida.
pt_br: Coloque o CellProfiler em TestMode <img src="./TutorialImages/startTestMode.png" width="120"/>, abra o ícone de olho <img src="./TutorialImages/EyeOpen.png" width="50"/> próximo a OverlayOutlines e clique em <img src="./TutorialImages/Step.png" width="120"/> 3 vezes para criar uma segmentação clássica e compará-la com a versão gerada pelo Cellpose. Você pode verificar as configurações no módulo OverlayOutlines para ver qual cor de contorno corresponde a qual segmentação na saída.

source: Optionally, open the Workspace Viewer using <img src="./TutorialImages/ViewWorkspace.png" width="120"/> to create easily on-the-fly customizable overlays.
es: Opcionalmente, abre el Visor de Espacio de Trabajo (Workspace Viewer) usando <img src="./TutorialImages/ViewWorkspace.png" width="120"/> para crear superposiciones fácilmente personalizables sobre la marcha.
pt_br: Opcionalmente, abra o Visualizador do Espaço de Trabalho usando <img src="./TutorialImages/ViewWorkspace.png" width="120"/> para criar sobreposições personalizáveis e em tempo real.

source: Hit <img src="./TutorialImages/NextImageSet.png" width="120"/> and repeat a couple of times to examine the segmentations on more images.
es: Presiona <img src="./TutorialImages/NextImageSet.png" width="120"/> y repite un par de veces para examinar las segmentaciones en más imágenes.
pt_br: Clique em <img src="./TutorialImages/NextImageSet.png" width="120"/> e repita algumas vezes para examinar as segmentações em mais imagens.

source: Question for you
es: Una pregunta para ti
pt_br: Pergunta para você

source: Are there cases where you think classical segmentation typically performs better? Where Cellpose performs better?
es: ¿Hay casos en los que crees que la segmentación clásica suele funcionar mejor? ¿Dónde funciona mejor Cellpose?
pt_br: Existem casos em que você acha que a segmentação clássica normalmente tem melhor desempenho? Onde o Cellpose tem melhor desempenho?

source: Visualization of images and objects in the Workspace Viewer
es: Visualización de imágenes y objetos en el Workspace Viewer.
pt_br: Visualização de imagens e objetos no Workspace Viewer

source: Reverse engineer how this worked
es: Haz ingeniería reversa cómo funcionó esto
pt_br: Faça engenharia reversa, como isso funcionou?

source: Open the NamesAndTypes module.
es: Abre el módulo NamesAndTypes.
pt_br: Abra o módulo NamesAndTypes.

source: Scroll down in NamesAndTypes to find the entry that adds the masks - is there any setting you notice about it that is different than for the other images?
es: Desplázate hacia abajo en NamesAndTypes para encontrar la entrada que agrega las máscaras. ¿Observas alguna configuración que sea diferente a la de las otras imágenes?
pt_br: Role para baixo em NamesAndTypes para encontrar a entrada que adiciona as máscaras - há alguma configuração que você observe que seja diferente das outras imagens?

source: Find the entry in NamesAndTypes that has 2 rules the image has to pass, not just one - do you understand why that is?
es: Busca la entrada en NamesAndTypes que tiene 2 reglas que la imagen debe pasar, no solo una. ¿Entiendes por qué?
pt_br: Encontre a entrada em NamesAndTypes que possui 2 regras pelas quais a imagem deve passar, não apenas uma - você entende por que isso acontece?

source: Bonus-to-the-Bonus - add the provided nuclear segmentations as well
es: Para créditos extra: agrega tembién las segmentaciones nucleares proporcionadas.
pt_br: Bônus ao bônus - adicione também as segmentações nucleares fornecidas

source: Drag and drop the `cellpose_masks_nuclei` folder in the Images module to add the nuclear masks to the image list.
es: Arrastra y suelta la carpeta `cellpose_masks_nuclei` en el módulo Images para agregar las máscaras nucleares a la lista de imágenes.
pt_br: Arraste e solte a pasta `cellpose_masks_nuclei` no módulo Imagens para adicionar as máscaras nucleares à lista de imagens.

source: Go to the NamesAndTypes module and configure it so both kinds of masks can be loaded (hint: there's a duplicate button you can use to make a second copy of a channel!)
es: Ve al módulo NamesAndTypes y configúralo para que se puedan cargar ambos tipos de máscaras (pista: hay un botón duplicado que puedes usar para hacer una segunda copia de un canal).
pt_br: Vá para o módulo NamesAndTypes e configure-o para que ambos os tipos de máscaras possam ser carregados (dica: há um botão de duplicação que você pode usar para fazer uma segunda cópia de um canal!)

source: You'll probably have to modify the existing settings for loading the cell masks by changing its rule or adding a second rule. Do you understand how/why?
es: Probablemente tendrás que modificar la configuración existente para cargar las máscaras celulares cambiando su regla o agregando una segunda regla. ¿Entiendes cómo/por qué?
pt_br: Você provavelmente terá que modificar as configurações existentes para carregar as máscaras de células, alterando sua regra ou adicionando uma segunda regra. Você entende como/por quê?

source: **Exercise 2: Running ilastik locally or from a Docker container**
es: **Ejercicio 2: Ejecutar ilastik localmente o desde un contenedor Docker**
pt_br: **Exercício 2: Executando o ilastik localmente ou de um contêiner Docker**

source: Classical segmentation requires the thing you care about in an image be bright and every single other pixel dark(er). If you have a good clean fluorescent signal for the thing you care about, great! If not, you may need to resort to some tricks.
es: La segmentación clásica requiere que lo que nos interesa en una imagen sea brillante y que todos los demás píxeles sean (más) oscuros. Si tienes una buena señal fluorescente para lo que te importa, ¡genial! Si no es así, es posible que tengas que recurrir a algunos trucos.
pt_br: A segmentação clássica exige que o que lhe interessa em uma imagem seja claro e todos os outros pixels escuros (mais). Se você tiver um bom sinal fluorescente limpo para aquilo que lhe interessa, ótimo! Caso contrário, talvez seja necessário recorrer a alguns truques.

source: One such trick is to train a classifier on a pixel-by-pixel basis to say "here is what I think is the likelihood that this is a pixel you want to end up in your segmentation"; this classifier then ends up creating for each pixel a *probability value* that corresponds to how likely it thinks it is you want to segment that pixel. If your classifier is good, that will give you an image where the pixels you care about are high-probability (bright) and everywhere else is low-probability (dark). That's exactly what we want! Life scientists tend to call this **"Pixel Classification"**; computer scientists will sometimes refer to it as **"Semantic Segmentation"**.
es: Uno de esos trucos consiste en entrenar un clasificador píxel por píxel para que diga "esta es la probabilidad que estimo de que este sea un píxel que deseas que termine incluido en tu segmentación"; luego, este clasificador termina creando para cada píxel un *valor de probabilidad* que corresponde a la probabilidad de que desee segmentar ese píxel. Si tu clasificador es bueno, obtendrás una imagen en la que los píxeles que te interesan tienen una alta probabilidad (brillantes) y el resto tienen una baja probabilidad (oscuros). ¡Eso es exactamente lo que queremos! Los científicos biológicos tienden a llamar a esto **"Clasificación de píxeles"**; Los informáticos a veces se refieren a ella como **"Segmentación semántica"**.
pt_br: Um desses truques é treinar um classificador de pixel por pixel para dizer "aqui está o que eu acho que é a probabilidade de que este seja um pixel que você deseja em sua segmentação"; esse classificador acaba criando para cada pixel um *valor de probabilidade* que corresponde à probabilidade de você querer segmentar aquele pixel. Se o seu classificador for bom, você obterá uma imagem em que os pixels de seu interesse são de alta probabilidade (claros) e em todos os outros lugares são de baixa probabilidade (escuros). É exatamente isso que queremos! Os cientistas da vida tendem a chamar isso de **"Classificação de Pixel"**; os cientistas da computação às vezes se referem a isso como **"Segmentação Semântica"**.

source: There are a few popular Fiji plugins for doing this, including Weka Trainable Segmentation and Labkit, and you should absolutely use them if they work better for you! We tend to use ilastik, because it makes it easy to automate creating a classifier from a very small number of images and then bulk-applying it to many others in "Batch Processing" mode. You can check out a tutorial we have written for running ilastik, and *then* CellProfiler at [tutorials.cellprofiler.org](https://tutorials.cellprofiler.org/) (look for Pixel-based Classification).
es: Hay algunos complementos populares de Fiji para hacer esto, incluidos Weka Trainable Segmentation y Labkit, ¡y definitivamente deberías usarlos si funcionan mejor para ti! Solemos usar ilastik porque facilita la automatización de la creación de clasificadores a partir de una cantidad muy pequeña de imágenes y luego su aplicación masiva a muchas otras en el modo "Batch Processing" o "Procesamiento en Lotes". Puedes consultar un tutorial que hemos escrito para ejecutar ilastik y *luego* CellProfiler en [tutorials.cellprofiler.org](https://tutorials.cellprofiler.org/) (busca "Clasificación basada en píxeles").
pt_br: Existem alguns plug-ins populares de Fiji para fazer isso, incluindo Weka Trainable Segmentation e Labkit, e você deve absolutamente usá-los se funcionarem melhor para você! Tendemos a usar o ilastik, porque torna mais fácil automatizar a criação de um classificador a partir de um número muito pequeno de imagens e, em seguida, aplicá-lo em massa a muitas outras no modo "Processamento em lote". Você pode conferir um tutorial que escrevemos para executar o ilastik e *depois* o CellProfiler em [tutorials.cellprofiler.org](https://tutorials.cellprofiler.org/) (procure Classificação baseada em Pixel).

source: ilastik's Batch Processing mode
es: Modo de procesamiento por lotes de ilastik
pt_br: Modo de processamento em lote do ilastik

source: Why do two steps though, when you can do one instead? In this tutorial we'll take a pre-trained ilastik classifer and run it inside our CellProfiler pipeline, so we can find and measure objects all in one step.
es: ¿Por qué hacer dos pasos cuando puedes hacer uno? En este tutorial, tomaremos un clasificador ilastik previamente entrenado y lo ejecutaremos dentro de nuestro pipeline de CellProfiler, para poder encontrar y medir objetos, todo en un solo paso.
pt_br: Por que seguir duas etapas, quando você pode executar uma? Neste tutorial, pegaremos um classificador ilastik pré-treinado e o executaremos dentro de nosso pipeline CellProfiler, para que possamos encontrar e medir objetos em uma única etapa.

source: You will need either ilastik or Docker Desktop installed on your computer for this exercise. If ilastik, make sure it is CLOSED, if Docker Desktop, make sure it is OPEN. We recommend installing ilastik because it is a good and helpful tool, and will allow you to do this exercise's bonus challenge.
es: Necesitarás ilastik o Docker Desktop instalado en tu computadora para este ejercicio. Si usas ilastik, asegúrate de que esté CERRADO, si es Docker Desktop, asegúrate de que esté ABIERTO al momento de ejecutar el pipeline. Recomendamos instalar ilastik porque es una herramienta buena y útil y te permitirá realizar el desafío adicional de este ejercicio.
pt_br: Você precisará do ilastik ou do Docker Desktop instalado em seu computador para este exercício. Se for ilastik, certifique-se de que esteja FECHADO, se for Docker Desktop, certifique-se de que esteja ABERTO. Recomendamos instalar o ilastik porque é uma ferramenta boa e útil e permitirá que você faça o desafio bônus deste exercício.

source: If you are on Windows, execute RunIlastik in Local mode (working on an installed copy of ilastik, rather than a copy inside a Docker file), this exercise will work in TestMode, but not will not run in analysis mode - we are working with the ilastik developers to determine why that is. This is fine for the purpose of this exercise; if you have a lot of your own data you want to run later, you can still use ilastik in a two step process, and/or use Dockerized ilastik.
es: Si estás en Windows, ejecuta el módulo `RunIlastik` en modo `Local` (trabajando en una copia instalada de ilastik, en lugar de una copia dentro de un archivo Docker). Este ejercicio funcionará en Modo de Prueba, pero no se ejecutará en el Modo de Análisis; estamos trabajando con los desarrolladores de ilastik para determinar por qué ocurre esto. Sin embargo, alcanza para el propósito de este ejercicio. Si tienes muchos datos propios que deseas ejecutar más adelante, aún puede usar ilastik en un proceso de dos pasos y/o usar ilastik Dockerizado.
pt_br: Se você estiver no Windows, execute o RunIlastik no modo Local (trabalhando em uma cópia instalada do ilastik, em vez de uma cópia dentro de um arquivo Docker), este exercício funcionará no TestMode, mas não será executado no modo de análise - estamos trabalhando com os desenvolvedores do ilastik para determinar o porquê disso. Isto é adequado para o propósito deste exercício; se você tiver muitos dados próprios que deseja executar posteriormente, ainda poderá usar o ilastik em um processo de duas etapas e/ou usar o ilastik Dockerizado.

source: Only if you are curious - how did we train the classifier?
es: Sólo si tienes curiosidad: ¿cómo entrenamos al clasificador?
pt_br: Somente se você estiver curioso – como treinamos o classificador?

source: This classifer was made in ilastik 1.4.1b5 by training on 4 images (A14_site1, E18_site1, D16_site1, and C12_site1) in which we labeled just two classes: one class for nucleoli (yellow in the figure below), and one class for every other part of the image (blue in the imagebelow). One COULD have made more classes, but this, in practice, worked.
es: Este clasificador se creó en ilastik 1.4.1b5 entrenando en 4 imágenes (A14_site1, E18_site1, D16_site1 y C12_site1) en las que etiquetamos solo dos clases: una clase para nucléolos (amarilla en la figura siguiente) y una clase para el resto de la imagen (azul en la imagen de abajo). PODRÍAMOS haber hecho más clases, cierto, pero esta manera funciona bien para nuestro objetivo.
pt_br: Este classificador foi feito no ilastik 1.4.1b5 treinando em 4 imagens (A14_site1, E18_site1, D16_site1 e C12_site1) nas quais rotulamos apenas duas classes: uma classe para nucléolos (amarelo na figura abaixo) e uma classe para todas as outras parte da imagem (azul na imagem abaixo). PODERIAMOS ter feito mais classes, mas isso, na prática, funcionou.

source: Screenshot of this ilastik classifer
es: Captura de pantalla de nuestro clasificador de Ilastik.
pt_br: Captura de tela deste classificador ilastik

source: When using ilastik for fluorescence microscopy, you will likely get the best performance if you **keep your annotations extremely minimal** - the classifier you're going to use was trained by using 31 total pixels of annotation across the 4 images (13 pixels of annotation inside nucleoli, and 18 pixels outside of them); no image had more than 14 pixels annotated in total. We strongly suggest you make your classifiers one pixel at a time, doing point annotations! Resist the urge to draw squiggly lines all over the image! This feels counterintuitive but we promise it's true.
es: Cuando utilices ilastik para microscopía de fluorescencia, probablemente obtendrás el mejor rendimiento si **mantienes tus anotaciones al mínimo**: el clasificador que va a utilizar se entrenó utilizando un total de 31 píxeles de anotaciones en las 4 imágenes (13 píxeles de anotación dentro de los nucléolos, y 18 píxeles fuera de ellos); ninguna imagen tenía más de 14 píxeles anotados en total. Te recomendamos encarecidamente que crees tus clasificadores un píxel a la vez, haciendo anotaciones puntuales. ¡Resiste la tentación de dibujar líneas onduladas por toda la imagen! Esto parece contradictorio, pero prometemos que es cierto.
pt_br: Ao usar o ilastik para microscopia de fluorescência, você provavelmente obterá o melhor desempenho se **manter suas anotações extremamente mínimas** - o classificador que você usará foi treinado usando 31 pixels totais de anotação nas 4 imagens (13 pixels de anotação dentro dos nucléolos e 18 pixels fora deles); nenhuma imagem teve mais de 14 pixels anotados no total. Sugerimos fortemente que você faça seus classificadores um pixel por vez, fazendo anotações de pontos! Resista à tentação de desenhar linhas onduladas por toda a imagem! Isso parece contra-intuitivo, mas prometemos que é verdade.

source: Grab the Runilastik plugin
es: Habilitar el complemento Runilastik
pt_br: Pegue o plugin Runilastik

source: Download [the plugin](https://github.com/CellProfiler/CellProfiler-plugins/blob/master/active_plugins/runilastik.py) into a folder on your local computer. As stated above, we strongly suggest a folder that contains ONLY plugins.
es: Descarga [el complemento] (https://github.com/CellProfiler/CellProfiler-plugins/blob/master/active_plugins/runilastik.py) en una carpeta en tu computadora local. Como se indicó anteriormente, recomendamos fuertemente que lo guardes una carpeta que contenga SÓLO complementos.
pt_br: Baixe [o plugin](https://github.com/CellProfiler/CellProfiler-plugins/blob/master/active_plugins/runilastik.py) em uma pasta em seu computador local. Conforme declarado acima, sugerimos fortemente uma pasta que contenha APENAS plugins.

source: In CellProfiler's File -> Preferences menu (CellProfiler -> Preferences in Mac), set the `CellProfiler plugins directory` to the folder containing the plugin.
es: En el menú Archivo -> Preferencias de CellProfiler (CellProfiler -> Preferencias en Mac), configura el `directorio de complementos de CellProfiler` (`CellProfiler Plugins Directory`) en la carpeta que contiene el complemento.
pt_br: No menu Arquivo -> Preferências do CellProfiler (CellProfiler -> Preferências no Mac), defina o `diretório de plugins do CellProfiler` para a pasta que contém o plugin.

source: Close and reopen CellProfiler to load the plugin.
es: Cierra y vuelve a abrir CellProfiler para cargar el complemento.
pt_br: Feche e reabra o CellProfiler para carregar o plugin.

source: Load the classifier and evaluate it
es: Cargar el clasificador y evaluarlo.
pt_br: Carregue o classificador e avalie-o

source: Drag `bonus_2_ilastik.cppipe` into the pipeline panel.
es: Arrastra el archivo `bonus_2_ilastik.cppipe` al panel de pipeline.
pt_br: Arraste `bonus_2_ilastik.cppipe` para o painel do pipeline.

source: Drag the `images_Illum-corrected` subfolder from the main exercise into the Images panel.
es: Arrastra la subcarpeta `images_Illum-corrected` desde el ejercicio principal al panel Imágenes.
pt_br: Arraste a subpasta `images_Illum-corriged` do exercício principal para o painel Imagens.

source: Open the RunIlastik module, set the path to your project file (`NucleoliDetection.ilp`) and then also:
es: Abre el módulo RunIlastik, establece la ruta a su archivo de proyecto (`NucleoliDetection.ilp`) y luego también:
pt_br: Abra o módulo RunIlastik, defina o caminho para o arquivo do seu projeto (`NucleoliDetection.ilp`) e também:

source: ilastik-installed (recommended): set the path to your local installation of ilastik.
es: ilastik-instalado (recomendado): establece la ruta a tu instalación local de ilastik.
pt_br: ilastik-installed (recomendado): defina o caminho para sua instalação local do ilastik.

source: Docker-installed: change the top setting from Local to Docker.
es: Instalado en Docker: cambie la configuración superior de Local a Docker.
pt_br: Docker instalado: altere a configuração superior de Local para Docker.

source: Put CellProfiler into TestMode <img src="./TutorialImages/startTestMode.png" width="120"/>, open the eye icons <img src="./TutorialImages/EyeOpen.png" width="50"/> next to Runilastik and OverlayOutlines, and then hit <img src="./TutorialImages/Run.png" width="120"/>. You can check the settings in the OverlayOutlines module to see which outline color corresponds to which segmentation in the output.
es: Coloca CellProfiler en Modo de Prueba (TestMode) <img src="./TutorialImages/startTestMode.png" width="120"/>, abre los íconos de ojo <img src="./TutorialImages/EyeOpen.png" width="50"/> junto a `Runilastik` y `OverlayOutlines`, y luego presiona <img src="./TutorialImages/Run.png" width="120"/>. Puedes verificar la configuración en el módulo `OverlayOutlines` para ver qué color de contorno corresponde a qué segmentación en la salida.
pt_br: Coloque CellProfiler em TestMode <img src="./TutorialImages/startTestMode.png" width="120"/>, abra os ícones de olho <img src="./TutorialImages/EyeOpen.png" width="50"/> ao lado de Runilastik e OverlayOutlines e clique em <img src="./TutorialImages/Run.png" width="120"/>. Você pode verificar as configurações no módulo OverlayOutlines para ver qual cor de contorno corresponde a qual segmentação na saída.
