Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/BeginnerSegmentation.po
Languages: es, pt_br

source: You may wish to put a pause <img src="./TutorialImages/Pause.png" width="50"/> next to SaveImages, or uncheck it <img src="./TutorialImages/InactivatedModule.png" width="50"/>, to keep it from saving images, but that's up to you.
es: Si lo deseas, puedes poner una pausa <img src="./TutorialImages/Pause.png" width="50"/> junto a `SaveImages`, o desmarcarlo <img src="./TutorialImages/InactivatedModule.png" width="50"/>, para evitar que guarde imágenes.
pt_br: Você pode colocar uma pausa <img src="./TutorialImages/Pause.png" width="50"/> ao lado de SaveImages ou desmarcá-la <img src="./TutorialImages/InactivatedModule.png" width="50"/>, para evitar que ele salve imagens, mas isso é você decide.

source: If using Docker, the very first time you execute the Runilastik module, it will need to download a ~5GB file, which may be slow depending on your internet connection. You only need to do this step once, however!
es: Si usas Docker, la primera vez que ejecutes el módulo `Runilastik`, deberás descargar un archivo de ~5 GB, que puede ser lento dependiendo de tu conexión a Internet. ¡Sin embargo, solo necesitas realizar este paso una vez!
pt_br: Se estiver usando Docker, na primeira vez que você executar o módulo Runilastik, será necessário baixar um arquivo de aproximadamente 5 GB, que pode ser lento dependendo da sua conexão com a Internet. No entanto, você só precisa executar esta etapa uma vez!

source: Evaluate your prediction in Runilastik across a few image sets - how well does it perform? Does it perform worse on images it wasn't trained on?
es: Evalúa tu predicción en `Runilastik` a través de algunos conjuntos de imágenes: ¿cómo tan bien funciona? ¿Funciona peor en imágenes en las que no fue entrenado?
pt_br: Avalie a segmentação do Runilastik em alguns conjuntos de imagens - qual é o seu desempenho? O desempenho é pior em imagens nas quais não foi treinado?

source: Screenshot of the Runilastik module
es: Captura de pantalla del módulo `Runilastik`
pt_br: Captura de tela do módulo Runilastik

source: Evaluate your segmentations across a few image sets using OverlayOutlines and/or the WorkspaceViewer - are there cases where you think the ilastik model-based segmentation performs better? The filtering-and-masking segmentation?
es: Evalúa tus segmentaciones en algunos conjuntos de imágenes utilizando `OverlayOutlines` y/o la herramienta `WorkspaceViewer`. ¿Hay casos en los que crees que la segmentación basada en modelos de ilastik funciona mejor? ¿Y la segmentación de filtrado y enmascaramiento?
pt_br: Avalie suas segmentações em alguns conjuntos de imagens usando OverlayOutlines e/ou WorkspaceViewer - há casos em que você acha que a segmentação baseada no modelo ilastik tem melhor desempenho? O filtro-mascara de segmentação?

source: Evaluating segmentations in the Workspace Viewer
es: Evaluación de segmentaciones en el `WorkspaceViewer`
pt_br: Avaliando segmentações no Workspace Viewer

source: Bonus-to-the-Bonus - train your own ilastik model
es: Bonus del bonus: entrena tu propio modelo ilastik!
pt_br: O bônus do bônus - treine seu próprio modelo ilastik

source: Based on your evaluations above, can you identify some places where additional training might help fix some issues in the ilastik model?
es: Según tus evaluaciones anteriores, ¿puedes identificar algunos lugares donde entrenamiento adicional podría ayudar a solucionar algunos problemas en el modelo ilastik?
pt_br: Com base nas avaliações acima, você consegue identificar alguns locais onde treinamento adicional pode ajudar a resolver alguns problemas no modelo ilastik?

source: Open `NucleoliDetection.ilp` in ilastik.
es: Abre el archivo `NucleoliDetection.ilp` en ilastik.
pt_br: Abra `NucleoliDetection.ilp` no ilastik.

source: Navigate to the `Training` tab.
es: Ve a la pestaña "Training".
pt_br: Navegue até a guia `Treinamento`.

source: Turn `LiveUpdate` on.
es: Activa "LiveUpdate".
pt_br: Ative o `LiveUpdate`.

source: Pick an image you think needed some help and add (a very small number of single-pixel) annotations. Did things get better or worse?
es: Elije una imagen que creas que necesita ayuda y agrega anotaciones (una cantidad muy pequeña de anoteciones de un solo píxel!). ¿Las cosas mejoraron o empeoraron?
pt_br: Escolha uma imagem que você acha que precisa de ajuda e adicione anotações (um número muito pequeno de pixel único). As coisas melhoraram ou pioraram?

source: Add some very large annotations (a long, squiggly line, for example) to one image, then switch images in order to prove to yourself large annotations can actually harm in some cases rather than help (if you want to save your classifier, go back and use the eraser tool to delete these!).
es: Agrega algunas anotaciones muy grandes (una línea larga y ondulada, por ejemplo) a una imagen, luego cambia de imagen para demostrarte a tí mismo que las anotaciones grandes en realidad pueden dañar en algunos casos en lugar de ayudar (si deseas rescatar tu clasificador, regresa y usa la herramienta de borrador para eliminar estas anotaciones grandes!).
pt_br: Adicione algumas anotações muito grandes (uma linha longa e ondulada, por exemplo) a uma imagem e, em seguida, troque as imagens para provar a si mesmo que anotações grandes podem realmente prejudicar em alguns casos, em vez de ajudar (se você quiser salvar seu classificador, volte e use a ferramenta borracha para excluí-los!).

source: If you think you've sufficiently improved the prediction, save this model and return to CellProfiler. Did it help in the cases where you thought it would?
es: Si crees que has mejorado lo suficiente la predicción, guarda este nuevo modelo y regresa a CellProfiler. ¿Ayudó en los casos en los que pensabas que ayudaría?
pt_br: Se você acha que a segmentação melhorou, salve este modelo e retorne ao CellProfiler. Ajudou nos casos em que você pensou que ajudaria?

source: **Exercise 3: Running Cellpose from a Docker container**
es: **Ejercicio 3: Ejecutar Cellpose desde un contenedor Docker**
pt_br: **Exercício 3: Executando Cellpose a partir de um contêiner Docker**

source: RunCellpose is by far our most popular plugin, simply because a) Cellpose is awesome! and b) `conda` installing software when you aren't very computationally comfortable isn't. You can use the plugin in either of two modes - using a local `conda` or `python` installation that contains both CellProfiler and Cellpose, OR using Docker. The run time with Docker is substantially slower (about a minute more per image, in our testing), but if installation would take you a long time and be frustrating, in this sense you can "trade" your personal hands-on frustration time for time where CellProfiler is running on your computer (but you aren't there). For many people, this is a good trade!
es: RunCellpose es, con mucho, nuestro complemento más popular, simplemente porque a) ¡Cellpose es genial! y b) instalar software usando `conda` cuando no te sientes muy cómodo computacionalmente no lo es. Puede usar el complemento en de dos modos diferentes: usando una instalación local `conda` o `python` que contenga tanto CellProfiler como Cellpose o usando Docker. El tiempo de ejecución con Docker es sustancialmente más lento (alrededor de un minuto más por imagen, en nuestras pruebas), pero si la instalación te llevaría mucho tiempo y sería frustrante, en este sentido puedes "intercambiar" tu tiempo de frustración personal tiempo de ejecución de CellProfiler en tu computadora (mientras, tú puedes hacer otra cosa!). ¡Para muchas personas, este es un buen intercambio!
pt_br: RunCellpose é de longe nosso plugin mais popular, simplesmente porque: a) Cellpose é incrível! e b) `conda` instalar software quando você não está muito confortável computacionalmente não é. Você pode usar o plug-in em um dos dois modos - usando uma instalação local `conda` ou `python` que contém CellProfiler e Cellpose, OU usando Docker. O tempo de execução com o Docker é substancialmente mais lento (cerca de um minuto a mais por imagem, em nossos testes), mas se a instalação levar muito tempo e for frustrante, nesse sentido você pode "trocar" seu tempo pessoal de frustração por horário em que o CellProfiler está sendo executado no seu computador (mas você não está lá). Para muitas pessoas, esta é uma boa troca!

source: Start Docker Desktop
es: Iniciar el Docker Desktop
pt_br: Inicie o Docker Desktop

source: If you have not already installed Docker Desktop from the link above, please do so! This may involve rebooting your computer.
es: Si aún no has instalado Docker Desktop desde el enlace anterior, ¡hazlo ahora! Esto puede implicar reiniciar tu computadora.
pt_br: Se você ainda não instalou o Docker Desktop do link acima, faça-o! Isso pode envolver a reinicialização do computador.

source: Start Docker Desktop.
es: Inicia Docker Desktop.
pt_br: Inicie o Docker Desktop.

source: Optional but strongly recommended - once Docker Desktop opens, use the search functionality to search `Cellpose` and look for the `cellprofiler/runcellpose_with_pretrained` model and pull it. If for whatever reason this isn't working, move on, but it will save you some time later.
es: Opcional pero muy recomendable: una vez que se abra Docker Desktop, usa la función de búsqueda para buscar `Cellpose` y busca el modelo `cellprofiler/runcellpose_with_pretrained` y extráelo. Si por alguna razón esto no funciona, sigue adelante con el ejercicio, pero est te ahorrará tiempo más adelante.
pt_br: Opcional, mas fortemente recomendado - assim que o Docker Desktop abrir, use a funcionalidade de pesquisa para pesquisar `Cellpose` e procure o modelo `cellprofiler/runcellpose_with_pretrained` e extraia-o. Se por algum motivo isso não funcionar, siga em frente, mas você economizará algum tempo depois.

source: Grab the RunCellpose plugin
es: Toma el complemento `RunCellpose`
pt_br: Pegue o plugin RunCellpose

source: Download [the plugin](https://github.com/CellProfiler/CellProfiler-plugins/blob/11b46ee7f6eb78f97f784a731c5a1931b66c90d4/active_plugins/runcellpose.py) into a folder on your local computer. As stated above, we strongly suggest a folder that contains ONLY plugins.
es: Descarga [el complemento] (https://github.com/CellProfiler/CellProfiler-plugins/blob/11b46ee7f6eb78f97f784a731c5a1931b66c90d4/active_plugins/runcellpose.py) en una carpeta en tu computadora. Como se indicó anteriormente, recomendamos fuertemente guardarlo una carpeta que contenga SÓLO complementos.
pt_br: Baixe [o plugin](https://github.com/CellProfiler/CellProfiler-plugins/blob/11b46ee7f6eb78f97f784a731c5a1931b66c90d4/active_plugins/runcellpose.py) em uma pasta em seu computador local. Conforme declarado acima, sugerimos fortemente uma pasta que contenha APENAS plugins.

source: In CellProfiler's File -> Preferences menu, set the `CellProfiler plugins directory` to the folder containing the plugin.
es: En el menú File -> Preferences de CellProfiler, configura el Directorio de Complementos de CellProfiler (CellProfiler plugins directory) en la carpeta que contiene el complemento.
pt_br: No menu Arquivo -> Preferências do CellProfiler, defina o `diretório de plugins do CellProfiler` para a pasta que contém o plugin.

source: Load the pipeline and evaluate segmentation
es: Carga pipeline y evalúa la segmentación
pt_br: Carregue o pipeline e avalie a segmentação

source: Drag `bonus_3_cellpose.cppipe` into the pipeline panel.
es: Arrastra `bonus_3_cellpose.cppipe` al panel de pipeline.
pt_br: Arraste `bonus_3_cellpose.cppipe` para o painel do pipeline.

source: Drag the `images_Illum-corrected` subfolder from the main exercise into the Images module
es: Arrastra la subcarpeta `images_Illum-corrected` desde el ejercicio principal al módulo `Images`.
pt_br: Arraste a subpasta `images_Illum-corriged` do exercício principal para o módulo Imagens

source: Put CellProfiler into TestMode <img src="./TutorialImages/startTestMode.png" width="120"/>, open the eye icons <img src="./TutorialImages/EyeOpen.png" width="50"/> next to RunCellpose and OverlayOutlines, and then hit <img src="./TutorialImages/Run.png" width="120"/>
es: Coloca CellProfiler en Modo de Prueba <img src="./TutorialImages/startTestMode.png" width="120"/>, abre los íconos de ojos <img src="./TutorialImages/EyeOpen.png" width="50"/> junto a `RunCellpose` y `OverlayOutlines`, y luego presiona <img src="./TutorialImages/Run.png" width="120"/>
pt_br: Coloque CellProfiler em TestMode <img src="./TutorialImages/startTestMode.png" width="120"/>, abra os ícones de olho <img src="./TutorialImages/EyeOpen.png" width="50"/> ao lado de RunCellpose e OverlayOutlines e clique em <img src="./TutorialImages/Run.png" width="120"/>

source: You may wish to put a pause next to SaveImages, or uncheck it, to keep it from saving images, but that's up to you
es: Si lo deseas, puedes poner una pausa junto a `SaveImages`, o desmarcarlo, para evitar que guarde imágenes.
pt_br: Você pode querer colocar uma pausa ao lado de SaveImages, ou desmarcá-la, para evitar que ele salve imagens, mas isso é com você

source: If you didn't already pull the container in the Docker Desktop section above, the very first time you hit the RunCellpose module, it will need to download a ~13GB file, which may be slow depending on your connection. You only need to do this step once however!
es: Si aún no extrajiste el contenedor en la sección anterior (Docker Desktop), la primera vez que ejecutes el módulo `RunCellpose`, deberás descargar un archivo de ~13 GB,lo cual puede ser lento dependiendo de tu conexión a internet. ¡Sin embargo, solo necesitas realizar este paso una vez!
pt_br: Se você ainda não extraiu o contêiner na seção Docker Desktop acima, na primeira vez que acessar o módulo RunCellpose, será necessário baixar um arquivo de aproximadamente 13 GB, que pode ser lento dependendo da sua conexão. No entanto, você só precisa executar esta etapa uma vez!

source: The output of the RunCellpose module
es: La salida del módulo `RunCellpose`
pt_br: Resultado do módulo RunCellpose

source: As before, using OverlayOutlines and/or the WorkspaceViewer, evaluate segmentation on a few images. Where is CellProfiler doing better, and where is Cellpose doing better?
es: Como antes, utilizando `OverlayOutlines` y/o `WorkspaceViewer`, evalúa la segmentación en algunas imágenes. ¿Dónde le está yendo mejor a CellProfiler y dónde le está yendo mejor a Cellpose?
pt_br: Como antes, usando OverlayOutlines e/ou WorkspaceViewer, avalie a segmentação em algumas imagens. Onde o CellProfiler está melhor e onde o Cellpose está melhor?

source: Use the <img src="./TutorialImages/Info.png" width="35"> button to learn more about the different parameters you can pass to Cellpose (we don't offer all of them, but many!) - how does tweaking these affect your output? How about changing the model you're using, and/or the image you're segmenting?
es: Utiliza el botón <img src="./TutorialImages/Info.png" width="35"> para obtener más información sobre los diferentes parámetros que puedes pasarle a Cellpose (¡no los ofrecemos todos, pero sí muchos!). ¿Cómo afecta cambiar estos parámetros al resultado? ? ¿Qué tal cambiar el modelo que estás usando y/o la imagen que estás segmentando?
pt_br: Use o botão <img src="./TutorialImages/Info.png" width="35"> para saber mais sobre os diferentes parâmetros que você pode passar para o Cellpose (não oferecemos todos eles, mas muitos!) - como os ajustes afetam sua saída ? Que tal mudar o modelo que você está usando e/ou a imagem que você está segmentando?

source: Bonus-to-the-Bonus 1 - test on a more varied data set
es: Bonus del bonus 1: prueba con un conjunto de datos más variado
pt_br: Bônus-para-o-bônus 1 - teste em um conjunto de dados mais variado

source: The data we gave you in this exercise was all very clean, and all from the negative control wells of this experiment. The [folder linked here](https://drive.google.com/file/d/10kZMhr2bVR14vMP7kG5iZGujjUI3Nn3Y/view?usp=sharing) contains images with a broader variety of phenotypes - try replacing the images in the `Images` module with this folder instead and see how well the two kinds of segmentation work in different conditions!
es: Los datos que te proporcionamos en este ejercicio estaban muy limpios y todos provenían de los pocillos de control negativo de este experimento. [Esta carpeta](https://drive.google.com/file/d/10kZMhr2bVR14vMP7kG5iZGujjUI3Nn3Y/view?usp=sharing) contiene imágenes con una variedad más amplia de fenotipos. Prueba reemplazar las imágenes en el módulo "Images" con las de esta carpeta y fíjate cómo funcionan los dos tipos de segmentación en diferentes condiciones.
pt_br: Os dados que demos a você neste exercício eram todos muito limpos, e todos dos poços de controle negativo deste experimento. A [pasta vinculada aqui](https://drive.google.com/file/d/10kZMhr2bVR14vMP7kG5iZGujjUI3Nn3Y/view?usp=sharing) contém imagens com uma variedade maior de fenótipos - tente substituir as imagens no módulo `Images` por esta pasta e veja como os dois tipos de segmentação funcionam bem em condições diferentes!

source: A broader range of phenotypes can be harder to consistently account for in conducting segmentation.
es: Una gama más amplia de fenotipos puede resultar más difícil de tener en cuenta de manera consistente al realizar la segmentación.
pt_br: Uma gama mais ampla de fenótipos pode ser mais difícil de ser contabilizada consistentemente na condução da segmentação.

source: You’re encouraged to explore the performance in some random images on your own (you can do this from the `Test` menu with the `Random Image Set` option), but if you find yourself consistently ending up with images that look similar you can try examining images from the following list of wells- A08, A12, B12, B18, C7, D6, D19, D22, E3. You can pick these with `Test` -> `Choose Image Set`
es: Te recomendamos explorar el rendimiento en algunas imágenes aleatorias por tu cuenta (puedes hacerlo desde el menú `Test` con la opción `Random Image Set`), pero si te das cuenta de que siempre terminas con imágenes que se parecen, puedes intentar examinar imágenes de la siguiente lista de pocillos: A08, A12, B12, B18, C7, D6, D19, D22, E3. Puedes seleccionarlos con `Test` -> `Choose Image Set`
pt_br: Você é encorajado a explorar o desempenho em algumas imagens aleatórias por conta própria (você pode fazer isso no menu `Test` com a opção `Random Image Set`), mas se você se encontrar consistentemente terminando com imagens que parecem semelhantes, você pode tentar examinar imagens da seguinte lista de poços - A08, A12, B12, B18, C7, D6, D19, D22, E3. Você pode escolher estes com `Test` -> `Choose Image Set`

source: Bonus-to-the-Bonus 2 - improve Cellpose segmentation
es: Bonus del Bonus 2: mejora la segmentación de Cellpose
pt_br: Bônus-para-o-Bônus 2 - melhore a segmentação do Cellpose

source: Based on your evaluations above, can you identify some places where additional training might help fix some issues in the Cellpose model? If you happen to have Cellpose on your computer (or want to try installing it - see Exercise 1 for a link to the official install instructions), open Cellpose with some of the `Ch1` images and see if you can train a model that will perform better.
es: En función de las evaluaciones anteriores, ¿puedes identificar casos en los que entrenamiento adicional podría ayudar a solucionar algunos problemas en el modelo Cellpose? Si tienes Cellpose en tu computadora (o deseas intentar instalarlo - consulta el Ejercicio 1 para obtener un enlace a las instrucciones de instalación oficiales), abre Cellpose con algunas de las imágenes `Ch1` y fíjate si puedes entrenar un modelo que funcione mejor.
pt_br: Com base em suas avaliações acima, você pode identificar alguns lugares onde treinamento adicional pode ajudar a corrigir alguns problemas no modelo Cellpose? Se você tiver o Cellpose em seu computador (ou quiser tentar instalá-lo - veja o Exercício 1 para um link para as instruções oficiais de instalação), abra o Cellpose com algumas das imagens `Ch1` e veja se você pode treinar um modelo que terá melhor desempenho.

source: Bonus-to-the-Bonus 3 - test your classical segmentation skills
es: Bonus del Bonus 3: prueba tus habilidades de segmentación clásica
pt_br: Bônus do Bônus 3 - teste suas habilidades clássicas de segmentação

source: The classical segmentation parameters provided here are based on expert tuning from a very experienced CellProfiler user - how close can you get? Add another IdentifyPrimaryObjects module to the pipeline, tune it yourself, and then look in the workspace viewer to see how it performs, especially in the more diverse image set from Bonus-to-the-Bonus 1. Compare your parameters to the expert ones - how do they differ? Do you understand why some of these settings may have been chosen?
es: Los parámetros de segmentación clásicos que se proporcionan aquí se basan en el ajuste experto de una usuaria de CellProfiler con mucha experiencia. ¿Hasta dónde puede llegar? Agrega otro módulo `IdentifyPrimaryObjects` al pipeline, ajústalo tú mismo y luego observa el Workspace Viewer para ver cómo funciona, especialmente en el conjunto de imágenes más diverso de "Bonus del Bonus 1". Compara tus parámetros con los de la experta: ¿en qué se diferencian? ¿Entiendes por qué se pueden haber elegido algunas de estas configuraciones?
pt_br: Os parâmetros de segmentação clássicos fornecidos aqui são baseados no ajuste especializado de um usuário muito experiente do CellProfiler - quão perto você pode chegar? Adicione outro módulo IdentifyPrimaryObjects ao pipeline, ajuste-o você mesmo e, em seguida, olhe no visualizador do espaço de trabalho para ver como ele funciona, especialmente no conjunto de imagens mais diversificado do Bonus-to-the-Bonus 1. Compare seus parâmetros com os de especialistas - como eles diferem? Você entende por que algumas dessas configurações podem ter sido escolhidas?

source: What next? Want to know more about CellProfliler plugins and modules?
es: ¿Qué sigue? ¿Quieres saber más sobre los complementos y módulos de CellProfliler?
pt_br: Qual o proximo? Quer saber mais sobre plug-ins e módulos do CellProfliler?

source: Read the [CellProfiler-plugins paper](https://pubmed.ncbi.nlm.nih.gov/37690102/)
es: Lee el [paper de complementos de CellProfiler](https://pubmed.ncbi.nlm.nih.gov/37690102/)
pt_br: Leia o [artigo CellProfiler-plugins](https://pubmed.ncbi.nlm.nih.gov/37690102/)

source: Watch this [video](https://www.youtube.com/watch?v=fgF_YueM1b8) to learn how to write a module
es: Mira este [video](https://www.youtube.com/watch?v=fgF_YueM1b8) para aprender a escribir tu propio complemento!
pt_br: Assista a este [vídeo](https://www.youtube.com/watch?v=fgF_YueM1b8) para aprender como escrever um módulo

source: Beginner segmentation and organelle analysis:
es: Segmentación y Análisis de Organelas para Principiantes:
pt_br: Segmentação e análise de organelas para iniciantes :

source: A computer exercise using CellProﬁler
es: Un ejercicio de computadora usando CellProfiler
pt_br: Um exercício de computador usando CellProfiler

source: Beth Cimini, Barbara Diaz-Rohrer, Esteban Miglietta, Paula Llanos, Mario Cruz and Rebecca Senft. <br> Broad Institute of MIT and Harvard, Cambridge, MA.
es: Beth Cimini, Barbara Diaz-Rohrer, Esteban Miglietta, Paula Llanos, Mario Cruz y Rebecca Senft. <br> Broad Institute del MIT y Harvard, Cambridge, MA.
pt_br: Beth Cimini, Barbara Diaz-Rohrer, Esteban Miglietta, Paula Llanos, Mario Cruz e Rebecca Senft. <br> Broad Institute do MIT e Harvard, Cambridge, MA.

source: **Background information:**
es: **Sobre las imágenes de este ejercicio:**
pt_br: **Informações gerais:**
