Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/BeginnerSegmentation.po
Languages: es, pt_br

source: The usefulness of building a pipeline is that you can apply the same series of processing/analysis steps to all the image dataset, which makes the analysis both fast and reproducible. However, while constructing the pipeline, we don't want to run our unfinished pipeline on ALL the images every time we try something new. That's why CellProfiler has a `'Test Mode'`, which allows you to run every step individually and separately one a SINGLE IMAGE at a time. Once your pipeline has at least one non-input module in it, you can activate this mode by clicking on <img src="./TutorialImages/startTestMode.png" width="120"/> in the lower-left of the window. When you are done developing your pipeline, you can exit the `'Test Mode'` by clicking on <img src="./TutorialImages/exitTestMode.png" width="120"/> and then finally run the entire pipeline on your complete image dataset using the <img src="./TutorialImages/analyzeImages.png" width="120"/> button.
es: La utilidad de crear un pipeline es que puedes aplicar la misma serie de pasos de procesamiento/análisis a todo el conjunto de imágenes, lo que hace que el análisis sea rápido y reproducible. Sin embargo, mientras construimos el pipeline, no queremos ejecutar nuestro pipeline en construcciónen TODAS las imágenes cada vez que intentamos algo nuevo. Es por eso que CellProfiler tiene un "Modo de prueba" (Test Mode), que te permite ejecutar cada módulo de forma individual y por separado, UNA IMAGEN a la vez. Una vez que tu pipeline tenga al menos un módulo que no sea de entrada, puedes activar este modo haciendo clic en <img src="./TutorialImages/startTestMode.png" width="120"/> en la parte inferior-izquierda de la ventana. Cuando hayas terminado de desarrollar tu pipeline, puedes salir del `'Modo de prueba'` haciendo clic en <img src="./TutorialImages/exitTestMode.png" width="120"/> y finalmente ejecutar todo el pipeline en tu conjunto completo de imágenes usando el botón <img src="./TutorialImages/analyzeImages.png" width="120"/>.
pt_br: A utilidade de construir um pipeline é que você pode aplicar a mesma série de etapas de processamento/análise a todo o conjunto de dados de imagem, o que torna a análise rápida e reproduzível. No entanto, ao construir o pipeline, não queremos executar nosso pipeline inacabado em TODAS as imagens toda vez que tentamos algo novo. É por isso que o CellProfiler possui um `'Modo de Teste'`, que permite executar cada etapa individualmente e separadamente, uma ÚNICA IMAGEM por vez. Quando seu pipeline tiver pelo menos um módulo sem entrada, você poderá ativar esse modo clicando em <img src="./TutorialImages/startTestMode.png" width="120"/> no canto inferior esquerdo da janela. Quando terminar de desenvolver seu pipeline, você pode sair do `'Modo de Teste'` clicando em <img src="./TutorialImages/exitTestMode.png" width="120"/> e finalmente executar todo o pipeline em seu conjunto de dados de imagem completo usando o <span botão class='notranslate'><img src="./TutorialImages/analyzeImages.png" width="120"/></span>.

source: *Overview of the final **pipeline** that you will be building with the general aim of each section*
es: *Descripción general del **pipeline** final que construirás con el objetivo general de cada sección*
pt_br: *Visão geral do **pipeline** final que você construirá com o objetivo geral de cada seção*

source: **4. IdentifyPrimaryObjects – Nuclei (10min)**
es: **4. Identificar objetos primarios - Núcleos (10 min)**
pt_br: **4. IdentifyPrimaryObjects – Núcleos (10min)**

source: **AIM: use the nuclear channel to segment (isolate and identify all the pixels belonging to) each nuclei.**
es: **OBJETIVO: utilizar el canal nuclear para segmentar (aislar e identificar todos los píxeles que pertenecen a) cada núcleo.**
pt_br: **OBJETIVO: usar o canal nuclear para segmentar (isolar e identificar todos os pixels pertencentes a cada núcleo.**

source: Add an **IdentifyPrimaryObjects** module to the pipeline. Do this by clicking on the <img src="./TutorialImages/AddModule.png" width="35"/> button in the bottom left corner of the CellProfiler window, which will pop up a small window called `‘Add modules’`. Navigate to the `Object Processing` category and select **IdentifyPrimaryObjects**. Double click on the module or click on <img src="./TutorialImages/AddToPipeline.png" width="120"/>.
es: Agrega un módulo **IdentifyPrimaryObjects** al pipeline. Haz esto haciendo clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> en la esquina inferior izquierda de la ventana de CellProfiler, lo que abrirá una pequeña ventana llamada "Add modules". Navega hasta la categoría "Object processing" y selecciona **IdentifyPrimaryObjects**. Haz doble clic en el módulo o haz clic en <img src="./TutorialImages/AddToPipeline.png" width="120"/>.
pt_br: Adicione um módulo **IdentifyPrimaryObjects** ao pipeline. Faça isso clicando no botão <img src="./TutorialImages/AddModule.png" width="35"/> no canto inferior esquerdo da janela do CellProfiler, que abrirá uma pequena janela chamada ``Add modules`. Navegue até a categoria `Object Processing` e selecione **IdentifyPrimaryObjects**. Clique duas vezes no módulo ou clique em <img src="./TutorialImages/AddToPipeline.png" width="120"/>.

source: **Tip**: You can also use the `'Find Modules'` search bar at the top of the ‘Add modules’ window to search all modules by name.
es: **Consejo**: También puedes utilizar la barra de búsqueda "Find modules" en la parte superior de la ventana "Add modules" para buscar todos los módulos por nombre.
pt_br: **Dica**: Você também pode usar a barra de pesquisa `'Encontrar Módulos'` na parte superior da janela ‘Add modules’ para pesquisar todos os módulos por nome.

source: *Figure 8: The 'Add Modules' window, modules are divided in categories based on their function*
es: *Figura 8: La ventana 'Add modules', los módulos se dividen en categorías según su función*
pt_br: *Figura 8: Na janela 'Add modules', os módulos são divididos em categorias com base em sua função*

source: Select `'OrigDNA'` image as your input image from the drop-down menu. `'OrigDNA'` is the name assigned to the nuclei channel in **NamesAndTypes** module. You can check it in the setting of Input Modules described before.
es: Selecciona la imagen `'OrigDNA'` como imagen de entrada en el menú desplegable. `'OrigDNA'` es el nombre asignado al canal nuclear en el módulo **NamesAndTypes**. Puedes comprobarlo en la configuración de los módulos de entrada descrita anteriormente.
pt_br: Selecione a imagem `'OrigDNA'` como sua imagem de entrada no menu suspenso. `'OrigDNA'` é o nome atribuído ao canal de núcleos no módulo **NamesAndTypes**. Você pode verificar isso na configuração dos Módulos de Entrada descrita anteriormente.

source: Change the name of the output objects to ‘Nuclei’.
es: Cambia el nombre de los objetos de salida a 'Nuclei'.
pt_br: Altere o nome dos objetos de saída para ‘Nuclei’.

source: Enter '`Test Mode'` by clicking on <img src="./TutorialImages/startTestMode.png" width="120"/>.\
es: Ingresa al '`Modo de prueba'` haciendo clic en <img src="./TutorialImages/startTestMode.png" width="120"/>.
pt_br: Entre no '`Modo de Teste'` clicando em <img src="./TutorialImages/startTestMode.png" width="120"/>.\

source: Hit <img src="./TutorialImages/Step.png" width="120"/> to run the module. A new window will pop up showing you the original input image (top left) and the results of running the module.
es: Presiona <img src="./TutorialImages/Step.png" width="120"/> para ejecutar el módulo. Aparecerá una nueva ventana que te mostrará la imagen de entrada original (arriba a la izquierda) y los resultados de ejecutar el módulo.
pt_br: Clique em <img src="./TutorialImages/Step.png" width="120"/> para executar o módulo. Uma nova janela aparecerá mostrando a imagem de entrada original (canto superior esquerdo) e os resultados da execução do módulo.

source: In this case, you can see the segmented nuclei both as outlines on top of the original image (bottom left) and as labeled objects (top right).
es: En este caso, puedes ver los núcleos segmentados como contornos en la parte superior de la imagen original (abajo a la izquierda) y como objetos etiquetados (arriba a la derecha).
pt_br: Neste caso, você pode ver os núcleos segmentados tanto como contornos no topo da imagem original (canto inferior esquerdo) quanto como objetos rotulados (canto superior direito).

source: Notice that the colors in the labeled objects are assigned at random and might change ecery time you run the module.
es: Ten en cuenta que los colores de los objetos etiquetados se asignan al azar y pueden cambiar cada vez que ejecutes el módulo.
pt_br: Observe que as cores nos objetos rotulados são atribuídas aleatoriamente e podem mudar toda vez que você executa o módulo.

source: On the outlines display pane (bottom left) you can see three different colors; green is for accepted objects, orange for objects touching the border, and pink for objects outside the diameter range.
es: En el panel de visualización de contornos (esquina inferior izquierda) puedes ver tres colores diferentes; el VERDE es para objetos aceptados, el ANARANJADO para objetos que tocan el borde y el MAGENTA para objetos fuera del rango de diámetro.
pt_br: No painel de exibição de contornos (canto inferior esquerdo), você pode ver três cores diferentes; verde é para objetos aceitos, laranja para objetos que tocam a borda e magenta para objetos fora do tamanho.

source: On the table pane (bottom right) there is useful information that you can use to adjust your segmentation settings, like the median diameter, and the threshold.
es: En el panel de tabla (esquina inferior derecha) hay información útil que puedes usar para ajustar tus configuraciones de segmentación, como el mediana del diámetro y el umbral.
pt_br: No painel da tabela (canto inferior direito) há informações úteis que você pode usar para ajustar suas configurações de segmentação, como o diâmetro médio e o limite (threshold).

source: **How does your segmentation look?**
es: **¿Cómo se ve tu segmentación?**
pt_br: **Como está sua segmentação?**

source: *Figure 9: The **IdentifyPrimaryObjects** module output, you can use the information in this window to modify your segmentation parameters*
es: *Figura 9: Salida del módulo **IdentifyPrimaryObjects**. Puede utilizar la información de esta ventana para modificar sus parámetros de segmentación*
pt_br: *Figura 9: Resultado do módulo **IdentifyPrimaryObjects**, você pode usar as informações nesta janela para modificar seus parâmetros de segmentação*

source: Use the <img src="./TutorialImages/Zoom.png" width="35"/> at the top of the window to activate the Zoom tool. Click and drag the mouse on the image to zoom in on an area that was segmented poorly.
es: Utiliza <img src="./TutorialImages/Zoom.png" width="35"/> en la parte superior de la ventana para activar la herramienta Zoom. Haz clic y arrastra el mouse sobre la imagen para acercar un área que esté mal segmentada.
pt_br: Use o <img src="./TutorialImages/Zoom.png" width="35"/> na parte superior da janela para ativar a ferramenta Zoom. Clique e arraste o mouse sobre a imagem para ampliar uma área que foi mal segmentada.

source: **🔴 TO DO**: Improve your segmentation of nuclei:
es: **🔴 PARA HACER: Mejora tu segmentación de núcleos:**
pt_br: **🔴 PARA FAZER**: Melhore sua segmentação de núcleos:

source: Select `‘Yes’` for the `‘Use advanced settings?’` option, then change some of the parameters:
es: Selecciona ``Yes'' para la opción `‘Use advanced settings?’` (¿Usar configuración avanzada?), luego cambia algunos de los parámetros:
pt_br: Selecione ``Yes'` para a opção `‘Use advanced settings?’` e altere alguns dos parâmetros:

source: Adjust the threshold method, may lead to better (or worse!) results.
es: Ajusta el método de umbralización ('Thresholding method'). Esto puede dar mejores (o peores!) resultados.
pt_br: Ajustar o método de limite (threshold) pode levar a resultados melhores (ou piores!).

source: Adjust the declumping settings.
es: Ajusta la configuración de desagrupamiento ('Method to distinguish clumped objects').
pt_br: Ajuste as configurações de desagregação de objetos (declumping).

source: Hit <img src="./TutorialImages/Step.png" width="120"/> after each change to rerun the module and see how the new parameters affect the segmentation.
es: Presiona <img src="./TutorialImages/Step.png" width="120"/> después de cada cambio para volver a ejecutar el módulo y ver cómo los nuevos parámetros afectan la segmentación.
pt_br: Clique em <img src="./TutorialImages/Step.png" width="120"/> após cada alteração para executar novamente o módulo e ver como os novos parâmetros afetam a segmentação.

source: Adjust the segmentation parameters until you feel you’re ready to move on to identifying the cells around the nuclei.
es: Ajusta los parámetros de segmentación hasta que sientas que estás lista/o para pasar a identificar las células alrededor de los núcleos.
pt_br: Ajuste os parâmetros de segmentação até sentir que está pronto para identificar as células ao redor dos núcleos.

source: The segmentation should be good but **doesn’t need to be perfect** before you move on.
es: La segmentación debe ser buena, pero **no es necesario que sea perfecta** antes de continuar.
pt_br: A segmentação deve ser boa, mas **não precisa ser perfeita** antes de prosseguir.

source: On that topic, we recommend checking this blog post on [When To Say ‘Good Enough’](https://carpenter-singh-lab.broadinstitute.org/blog/when-to-say-good-enough).
es: Sobre ese tema, recomendamos consultar esta publicación de blog sobre [Cuándo decir ‘suficientemente bueno’](https://carpenter-singh-lab.broadinstitute.org/blog/when-to-say-good-enough).
pt_br: Sobre esse assunto, recomendamos verificar esta postagem do blog em [Quando dizer ‘bom o suficiente’](https://carpenter-singh-lab.broadinstitute.org/blog/when-to-say-good-enough).

source: **5. IdentifySecondaryObjects – Cells (5min)**
es: **5. Identificar objetos secundarios: células (5 min)**
pt_br: **5. IdentifySecondaryObjects – Células (5min)**

source: **AIM: segment each cell individually using the previously segmented nuclei as a guide**
es: **OBJETIVO: segmentar cada célula individualmente utilizando los núcleos previamente segmentados como guía**
pt_br: **OBJETIVO: segmentar cada célula individualmente usando os núcleos previamente segmentados como guia**

source: Since we don't have a cellular marker that labels homogenously the whole cell, we will use the `'OrigActin_Golgi_Membrane'` channel, which is the closest we have.
es: Como no tenemos un marcador celular que marque homogéneamente toda la célula, usaremos el canal `'OrigActin_Golgi_Membrane'`, que es el más cercano que tenemos.
pt_br: Como não temos um marcador celular que marque homogeneamente toda a célula, usaremos o canal `'OrigActin_Golgi_Membrane'`, que é o mais próximo que temos.

source: After the **IdentifyPrimaryObjects**, add a **IdentifySecondaryObjects** module.
es: Después de **IdentifyPrimaryObjects**, agrega un módulo **IdentifySecondaryObjects**.
pt_br: Após **IdentifyPrimaryObjects**, adicione um módulo **IdentifySecondaryObjects**.

source: Select the `'OrigActin_Golgi_Membrane'` image as your input image, select the `'Nuclei'` objects (created by the previous module) as input objects and change the name to `'Cells'`.
es: Selecciona la imagen `'OrigActin_Golgi_Membrane'` como imagen de entrada, seleccione los objetos `'Nuclei'` (creados por el módulo anterior) como objetos de entrada y cambie el nombre a `'Cells'`.
pt_br: Selecione a imagem `'OrigActin_Golgi_Membrane'` como sua imagem de entrada, selecione os objetos `'Nuclei'` (criados pelo módulo anterior) como objetos de entrada e mude o nome para `'Cells'`.

source: The **IdentifySecondaryObject** module uses a "primary" object (in this case, the `'Nuclei'`) as a reference to find a "secondary" object, which contains the "primary". The "primary" is used as seed from which the "secondary" expands out.
es: El módulo **IdentifySecondaryObject** utiliza un objeto "primario" (en este caso, los `'Nuclei'`) como referencia para encontrar un objeto "secundario", que contiene el "primario". El "primario" sirve, entonces como semilla a partir de la cual se expande el "secundario".
pt_br: O módulo **IdentifySecondaryObject** usa um objeto "primário" (neste caso, o `'Nuclei'`) como referência para encontrar um objeto "secundário", que contém o "primário". O “primário” é usado como semente a partir do qual o “secundário” se expande.

source: Hit <img src="./TutorialImages/Step.png" width="120"/> to run the module.
es: Presiona <img src="./TutorialImages/Step.png" width="120"/> para ejecutar el módulo.
pt_br: Clique em <img src="./TutorialImages/Step.png" width="120"/> para executar o módulo.

source: In this module output, the outline colors correspond to the seed object (green-Nuclei) and the segmented objects (magenta-Cell)
es: En la salida de este módulo, los colores del contorno corresponden al objeto semilla (núcleos verdes) y a los objetos segmentados (células magenta)
pt_br: Na janela de resultados deste módulo, as cores do contorno correspondem ao objeto semente (núcleos verdes) e aos objetos segmentados (células magenta)

source: *Figure 10: The **IdentifySecondaryObjects** module output*
es: *Figura 10: Salida del módulo **IdentifySecondaryObjects***
pt_br: *Figura 10: Resultado do módulo **IdentifySecondaryObjects***

source: **🔴 TO DO**: Improve cell segmentation
es: **🔴 PARA HACER:** Mejora la segmentación celular
pt_br: **🔴 PARA FAZER**: Melhorar a segmentação da célula

source: Adjust the thresholding method.
es: Ajusta el método de umbralización.
pt_br: Ajuste o método de limite (threshold).

source: Test the effects of using the various methods for identifying secondary objects (Propagation, Watershed-Image Distance-N, etc) and, if using Propagation, the regularization factor.
es: Prueba el efecto de usar diversos métodos para identificar los objetos secundarios (Propagation, Watershed-Image Distance-N, etc) y, si usas Propagation, el factor de regularización (regularization factor).
pt_br: Teste os efeitos da utilização dos diversos métodos de identificação de objetos secundários (Propagation, Watershed-Image Distance-N, etc) e, se utilizar Propagation, teste também o fator de regularização.

source: Examine the segmentation and adjust the module parameters until you feel you’re ready to test them on another image
es: Examina la segmentación y ajusta los parámetros del módulo hasta que sientas que está listo para probarlos en otra imagen.
pt_br: Examine a segmentação e ajuste os parâmetros do módulo até sentir que está pronto para testá-los em outra imagem

source: Remember, **they don’t need to be perfect!**
es: Recuerda, **¡no es necesario que sean perfectos!**
pt_br: Lembre-se, **a segmentação não precisa ser perfeita!**

source: **6. Test the robustness of your segmentation parameters across images (5min)**
es: **6. Prueba la robustez de tus parámetros de segmentación en varias imágenes (5 min)**
pt_br: **6. Teste a robustez dos seus parâmetros de segmentação em outras imagens (5min)**

source: It’s (relatively!) easy to come up with a good set of segmentation parameters for a single image however we aim to create a set of parameters that can segment cells on all the images on an experiment.
es: Es (relativamente) fácil encontrar un buen conjunto de parámetros de segmentación para una sola imagen, sin embargo, nuestro objetivo es crear un conjunto de parámetros que pueda segmentar células en todas las imágenes de un experimento.
pt_br: É (relativamente!) fácil criar um bom conjunto de parâmetros de segmentação para uma única imagem, mas nosso objetivo é criar um conjunto de parâmetros que possa segmentar células em todas as imagens de um experimento.

source: To test the parameters, there are two options to change the image you are working on in Test Mode:
es: Para probar los parámetros, hay dos opciones para cambiar la imagen en la que está trabajando en el modo de prueba:
pt_br: Para testar os parâmetros, existem duas opções para alterar a imagem em que você está trabalhando a primeira no Modo de Teste (Test Mode):

source: Click on the <img src="./TutorialImages/NextImageSet.png" width="120"/> at the bottom left corner,
es: Haz clic en <img src="./TutorialImages/NextImageSet.png" width="120"/> en la esquina inferior izquierda,
pt_br: Clique em <img src="./TutorialImages/NextImageSet.png" width="120"/> no canto inferior esquerdo,

source: or
es: o
pt_br: ou

source: Go to `‘Test’` on the top menu bar → `Choose Image Set` to bring up a list of the images in your experiment, select the image you want to test, and press the `‘OK’` button.
es: Ve a `‘Test’` en la barra de menú superior → `Choose Image Set` para que aparezca una lista de las imágenes de tu experimento, selecciona la imagen que deseas probar y presiona el botón `‘OK’`.
pt_br: Vá para ``Test'` na barra de menu superior → `Choose Image Set` para abrir uma lista das imagens em seu experimento, selecione a imagem que deseja testar e pressione o botão ``OK'`.

source: You can also use the `'Test'` menu to choose a random image set
es: También puedes utilizar el menú `'Test'` para elegir un conjunto de imágenes aleatorio.
pt_br: Você também pode usar o menu `'Test'` para escolher um conjunto de imagens de forma aleatória

source: *Figure 11: A section of the `‘Choose Image Set’` menu.*
es: *Figura 11: Una sección del menú `‘Choose Image Set’`.*
pt_br: *Figura 11: Uma seção do menu ``Choose Image Set'`.*

source: Run tthe new image set you selected in test mode for your ﬁrst 2 modules (through your **IdentifySecondaryObjects** step).
es: Ejecuta el nuevo conjunto de imágenes que seleccionaste en modo de prueba ("Test mode") para los primeros 2 módulos (hasta **IdentifySecondaryObjects** inclusive).
pt_br: Execute o novo conjunto de imagens selecionado no modo de teste para seus dois primeiros módulos (por meio da etapa **IdentifySecondaryObjects**).

source: You can do it by clicking the <img src="./TutorialImages/Step.png" width="120"/> button, or
es: Puedes hacerlo haciendo clic en el botón <img src="./TutorialImages/Step.png" width="120"/>, o
pt_br: Você pode fazer isso clicando no botão <img src="./TutorialImages/Step.png" width="120"/> ou

source: You can activate the pause button (<img src="./TutorialImages/Pause.png" width="40"/>) on the module after **IdentifySecondaryObjects** and hit <img src="./TutorialImages/Run.png" width="120"/>, this will run all modules before the pause.
es: Puede activar el botón de pausa (<img src="./TutorialImages/Pause.png" width="40"/>) en el módulo después de **IdentifySecondaryObjects** y presionar <img src="./TutorialImages/Run.png" width="120"/>, esto ejecutará todos los módulos antes de la pausa.
pt_br: Você pode ativar o botão de pausa (<img src="./TutorialImages/Pause.png" width="40"/>) no módulo após **IdentifySecondaryObjects** e clicar em <img src="./TutorialImages/Run.png" width="120"/>, isso executará todos módulos antes da pausa.

source: *Figure 12: A section of the ‘Analysis modules’ pane.*
es: *Figura 12: Una sección del panel de módulos de análisis*
pt_br: *Figura 12: Uma seção do painel ‘Analysis modules’.*

source: Examine the output – did your nuclear and cellular segmentation hold up compared to the ﬁrst images you looked at?
es: Examina la salida: ¿se mantuvo tu segmentación nuclear y celular en comparación con las primeras imágenes que observaste?
pt_br: Examine o resultado – a qualidade da sua segmentação nuclear e celular se manteve em comparação com as primeiras imagens que você viu?
