Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/BeginnerSegmentation.po
Languages: es, pt_br

source: The images in this experiment come from the [Broad Bioimage Benchmark Collection](https://data.broadinstitute.org/bbbc/BBBC022/). They are ﬁelds of U2OS cells imaged in ﬁve channels (Cell Painting assay; see Gustafsdottir et al., 2013).
es: Las imágenes de este experimento provienen de la [Broad Bioimage Benchmark Collection] (https://data.broadinstitute.org/bbbc/BBBC022/). Son imágenes de campos de células U2OS adquiridas en cinco canales (Cell Painting Assay ver Gustafsdottir et al., 2013).
pt_br: As imagens neste experimento vêm do [Broad Bioimage Benchmark Collection](https://data.broadinstitute.org/bbbc/BBBC022/). Elas são campos de células U2OS contendo cinco canais (ensaio Cell Painting; ver Gustafsdottir et al., 2013).

source: The Cell Painting assay
es: El ensayo de Cell Painting
pt_br: O ensaio de Cell Painting (Pintura celular)

source: is a high-content, high-throughput imaging technique used to capture a wide array of cellular phenotypes in response to diverse perturbations. Briefly, cells are treated with a variety of drugs, environmental changes or genetic perturbations (using CRISPR, for example) and then fixed and stained with six fluorescent dyes that mark different cellular compartments, including nuclei, cytoplasm, endoplasmic reticulum, Golgi apparatus, mitochondria, and actin.
es: es una técnica de imágenes de alto contenido y alto rendimiento que se utiliza para capturar una amplia gama de fenotipos celulares en respuesta a diversas perturbaciones. Brevemente, los células se tratan con una variedad de medicamentos, cambios ambientales o perturbaciones genéticas (usando CRISPR, por ejemplo) y luego se fijan y tiñen con seis tintes fluorescentes que marcan diferentes compartimentos celulares incluyendo núcleos, citoplasma, retículo endoplásmico, aparato de Golgi, mitocondrias y actina.
pt_br: é uma técnica de imagem de alto conteúdo e alto rendimento usada para capturar uma ampla gama de fenótipos celulares em resposta a diversas perturbações. Resumidamente, as células são tratadas com uma variedade de medicamentos, alterações ambientais ou perturbações genéticas (usando CRISPR, por exemplo) e depois fixadas e coradas com seis corantes fluorescentes que marcam diferentes compartimentos celulares, incluindo núcleos, citoplasma, retículo endoplasmático, aparelho de Golgi, mitocôndrias. e actina.

source: High-resolution images are then captured using automated fluorescence microscopy, and image analysis algorithms (like the one we will use in this tutorial) are applied to extract thousands of morphological features. These features are used to create a high dimensional **"morphological profile"** (consisting of up to several thousand features) for each perturbation.
es: Luego, se capturan imágenes de alta resolución mediante microscopía de fluorescencia automatizada y se aplican algoritmos de análisis de imágenes (como los que usaremos en este tutorial) para extraer miles de características morfológicas. Estas características se utilizan para crear un **"perfil morfológico"** de alta dimensión (que consta de hasta varios miles de características) para cada perturbación.
pt_br: Imagens de alta resolução são então capturadas usando microscopia de fluorescência automatizada, e algoritmos de análise de imagem (como o que usaremos neste tutorial) são aplicados para extrair milhares de características morfológicas. Esses recursos são usados para criar um **"perfil morfológico"** de alta dimensão (consistindo de até vários milhares de medidas) para cada perturbação.

source: Finally, by comparing and clustering the morphological profiles of cells treated with different compounds, researchers can identify potential new drug candidates, assess their toxicity or understand the mechanism of action of existing drugs; or, in combination with genetic perturbations, these profiles assays can be used to determine the function of genes or to understand the underlying mechanisms of genetic diseases and potential therapeutic interventions.
es: Finalmente, al comparar y agrupar los perfiles morfológicos de células tratadas con diferentes compuestos, los investigadores pueden identificar posibles nuevos fármacos candidatos, evaluar su toxicidad o comprender el mecanismo de acción de fármacos existentes; o, en combinación con perturbaciones genéticas, estos ensayos de perfiles pueden usarse para determinar la función de los genes o para comprender los mecanismos subyacentes de las enfermedades genéticas y hallar posibles intervenciones terapéuticas.
pt_br: Finalmente, ao comparar e agrupar os perfis morfológicos das células tratadas com diferentes compostos, os investigadores podem identificar potenciais novos candidatos a medicamentos, avaliar a sua toxicidade ou compreender o mecanismo de ação dos medicamentos existentes; ou, em combinação com perturbações genéticas, estes ensaios de perfis podem ser utilizados para determinar a função dos genes ou para compreender os mecanismos subjacentes de doenças genéticas e potenciais intervenções terapêuticas.

source: Figure 1: Cell Painting assays are commonly run on multiwell plates and several Images ('Sites') are taken from each well. Each image contains information of 6 different cellular dyes, imaged in 5 channels.
es: Figura 1: Los ensayos de Cell Painting se suelen realizar en placas multipocillos y se toman varias imágenes ("Sitios") en cada pocillo. Cada imagen contiene información de 6 sondas fluorescentes diferentes, capturadas en 5 canales.
pt_br: Figura 1: Os ensaios de pintura celular são comumente executados em placas multipoços e várias imagens (“Sites”) são adquiridas de cada poço. Cada imagem contém informações de 6 corantes celulares diferentes, visualizados em 5 canais.

source: **Goals of this exercise:**
es: **Objetivos de este ejercicio:**
pt_br: **Objetivos deste exercício:**

source: This exercise will give you the chance to practice ﬁnding segmentation parameters for larger “parent” objects (nucleus, cell, and cytoplasm) and show you ways to pull out smaller features in your image by segmenting organelles within the cells and nuclei (like nucleoli or mitochondria). You will also be shown how to use RelateObjects so that you can relate the average counts, distances, and measurements of the smaller “child” organelles to their larger “parent” objects (i.e., cell and nucleus).
es: Este ejercicio te dará la oportunidad de practicar la búsqueda de parámetros de segmentación para objetos "principales" más grandes (núcleo, célula y citoplasma) y te mostrará formas de extraer características más pequeñas de tu imagen segmentando organelas dentro de células y núcleos (como nucléolos o mitocondrias). También te mostrará cómo utilizar el módulo RelateObjects para relacionar los recuentos, distancias y medidas promedio de las organelas "hijas" más pequeñas con sus objetos "parentales" más grandes (es decir, <span class='notranslate'>célula y núcleo).
pt_br: Este exercício lhe dará a oportunidade de praticar e encontrar os parâmetros de segmentação para objetos “pais” maiores (núcleo, célula e citoplasma) e mostrará maneiras de extrair características menores em sua imagem, segmentando organelas dentro das células e núcleos (como nucléolos ou mitocôndria). Também será mostrado como usar RelateObjects (um módulo do CellProfiler) para que você possa relacionar as contagens médias, distâncias e medidas das organelas “filhas” menores com seus objetos “pais” maiores (ou seja, célula e núcleo).

source: **Materials necessary for this exercise:**
es: **Materiales necesarios para este ejercicio:**
pt_br: **Materiais necessários para este exercício:**

source: The images are contained in the **images** folder; these 50 images (10 sites imaged in 5 channels) represent 5 mock treated wells from a single 384 well plate experiment.
es: Las imágenes están contenidas en la carpeta **images**; estas 50 imágenes (10 imágenes en 5 canales) representan 5 pocillos tratados de un experimento de una placa de 384 pocillos.
pt_br: As imagens estão contidas na pasta **images**; essas 50 imagens (5 canais de 10 campos diferentes) representam 5 poços com tratamento simulado de um único experimento em uma placa de 384 poços.

source: **Exercise instructions:**
es: **Instrucciones del ejercicio**
pt_br: **Instruções para exercício:**

source: Read through the steps below and follow instructions where stated. Steps where you must figure out a solution are marked with 🔴 **TO DO.**
es: Lee los pasos a continuación y sigue las instrucciones donde se indican. Los pasos en los que debes encontrar una solución están marcados con 🔴 **PARA HACER.**
pt_br: Leia as etapas abaixo e siga as instruções onde indicado. As etapas nas quais você deve encontrar uma solução estão marcadas com 🔴 **PARA FAZER.**

source: **1. Load starting pipeline (2 min)**
es: **1. Cargar el pipeline de inicio (2 min)**
pt_br: **1. Carregar o pipeline inicial (2 min)**

source: Start CellProﬁler by double-clicking the desktop icon: <img src="./TutorialImages/CellProfilerLogo.png" width="40">
es: Inicia CellProfiler haciendo doble clic en el icono del escritorio: <img src="./TutorialImages/CellProfilerLogo.png" width="40">
pt_br: Inicie o CellProﬁler clicando duas vezes no ícone da área de trabalho: <img src="./TutorialImages/CellProfilerLogo.png" width="40">

source: Figure 2: **Main CellProfiler window**. To load images, drag and drop images into the right area. To load a pipeline (.ccpipe or .ccproj files), drag and drop the pipeline file into the left area.
es: Figura 2: **Ventana principal de CellProfiler**. Para cargar imágenes, arrastra y suelta imágenes en el área derecha. Para cargar un pipeline (archivos .ccpipe o .ccproj), arrastra y suelta el archivo pipeline en el área izquierda.
pt_br: Figura 2: **Janela principal do CellProfiler**. Para carregar imagens, arraste e solte as imagens na área à direita. Para carregar um pipeline (arquivos .ccpipe ou .ccproj), arraste e solte o arquivo do pipeline na área esquerda.

source: Drag and drop the `‘segmentation_start.cppipe’` ﬁle into the `‘Analysis modules’` pane on the left.
es: Arrastra y suelta el archivo ``segmentation_start.cppipe'' en el panel de ``Módulos de análisis'' de la izquierda.
pt_br: Arraste e solte o arquivo ``segmentation_start.cppipe'` no painel ``Módulos de análise'` à esquerda.

source: Alternatively, you can also import a pipeline by going to `File` in the main menu (top), then `Import > Pipeline from file`
es: Alternativamente, también puedes importar un pipeline yendo a `File` en el menú principal (arriba), luego `Import > Pipeline from file`
pt_br: Alternativamente, você também pode importar um pipeline acessando `Arquivo` no menu principal (parte superior) e depois `Importar > Pipeline do arquivo`

source: Figure 2b: **Loading the starting pipeline**. When you succesfully load the `‘segmentation_start.cppipe’` file into CellProfiler, you will notice a welcome message in the Notes panel. This initial pipeline has no analysis modules (you will fix that soon!) but has all the Loading modules already configured for you (see **Step 3** for more details)
es: Figura 2b: **Cargando el archivo del pipeline inicial**. Al cargar correctamente el archivo `‘segmentation_start.cppipe’` en CellProfiler, verás un mensaje de bienvenida en el panel de Notas. Este pipeline inicial no tiene ningún módulo de análisis aún (¡tú pronto solucionarás esto!), pero sí tiene todos los módulos de carga ya configurados (consulta el **Paso 3** para más detalles).
pt_br: Figura 2b: **Carregando o pipeline inicial**. Ao carregar com sucesso o arquivo `‘segmentation_start.cppipe’` no CellProfiler, você verá uma mensagem de boas-vindas no painel Notas. Este pipeline inicial não possui módulos de análise (você corrigirá isso em breve!), mas já possui todos os módulos de carregamento configurados para você (consulte a **Etapa 3** para mais detalhes).

source: **2. Load images**
es: **2. Cargar imágenes**
pt_br: **2. Carregar imagens**

source: Click on the **Images** module in the top left corner of the **Input** pane on CellProfiler window.
es: Haz clic en el módulo **Images** en la esquina superior izquierda del panel **Input** en la ventana de CellProfiler.
pt_br: Clique no módulo **Images** no canto superior esquerdo do painel **Input** na janela do CellProfiler.

source: Drag and drop the folder named `'images_Illum-corrected'` into the `Drop files and folders here` pane. It should automatically populate.
es: Arrastra y suelta la carpeta denominada `'images_Illum-corrected'` en el panel que dice `Soltar archivos y carpetas aquí` (`Drop files and folders here` ). Debería completarse automáticamente.
pt_br: Arraste e solte a pasta chamada `'images_Illum-corrected'` no painel `Drop files and folders here`. O módulo deve se preencher automaticamente.

source: Alternatively, you can also load the images by double clicking in the `Drop files and folders here` pane and using the pop-up window to select them.
es: Alternativamente, también puedes cargar las imágenes haciendo doble clic en el panel "Soltar archivos y carpetas aquí" y usando la ventana emergente para seleccionarlas.
pt_br: Alternativamente, você também pode carregar as imagens clicando duas vezes no painel `Drop files and folders here` e usando a janela pop-up para selecioná-las.

source: *Figure 3: The **Images** module, grey out files will **not** be available for downstream modules*
es: *Figura 3: El módulo **Images**, los archivos en gris **no** estarán disponibles para los módulos posteriores*
pt_br: *Figura 3: Módulo **Images**, arquivos com os nomes mais claros (cinzas) **não** estarão disponíveis para módulos subjacentes*

source: **TIP**: You can use the `‘Filter images?’` options to filter out any file that you don't want CellProfiler to process. For example, if `‘Images only’` is selected, all files that are not images will be filtered out (they appear greyed out).
es: **CONSEJO**: Puedes utilizar las opciones ``Filter images?'' para filtrar cualquier archivo que no desees que CellProfiler procese. Por ejemplo, si se selecciona "Images only", todos los archivos que no sean imágenes se filtrarán (aparecen en gris).
pt_br: **DICA**: Você pode usar as opções `‘Filter images?’` (``Filtrar imagens?'`) para filtrar qualquer arquivo que você não deseja que o CellProfiler processe. Por exemplo, se `‘Images only’` (``Somente imagens'`) for selecionado, todos os arquivos que não são imagens serão filtrados (eles aparecem em cinza).

source: You can open and examine any image by double clicking on them
es: Puedes abrir y examinar cualquier imagen haciendo doble clic en ella.
pt_br: Você pode abrir e examinar qualquer imagem clicando duas vezes nela

source: 🔴 **TO DO.** Open an image and familiarize yourself with the tools in the image toolbar: <img src="./TutorialImages/ImageToolbar.png" width="220">
es: 🔴 **PARA HACER.** Abre una imagen y familiarízate con las herramientas disponibles en la barra de herramientas de imágenes: <img src="./TutorialImages/ImageToolbar.png" width="220">
pt_br: 🔴 **PARA FAZER.** Abra uma imagem e familiarize-se com as ferramentas na barra de ferramentas de imagens: <img src="./TutorialImages/ImageToolbar.png" width="220">

source: **TIP** you can manually adjust brightness and contrast in the image display by right-clicking on it and going to `'Adjust Contrast'`
es: **CONSEJO** puedes ajustar manualmente el brillo y el contraste en la visualización de la imagen haciendo clic derecho sobre ella y yendo a `'Adjust Contrast'`
pt_br: **DICA** você pode ajustar manualmente o brilho e o contraste na exibição da imagem clicando com o botão direito sobre ela e indo em `'Adjust Contrast'`

source: 3. [OPTIONAL STEP] Set up the input modules
es: 3. [PASO OPCIONAL] Configura los módulos de entrada
pt_br: 3. [ETAPA OPCIONAL] Configurar os módulos de entrada

source: *We suggest you skip this step for now, it will not affect the rest of the pipeline, as these modules have been properly set up in the starting pipeline (`segmentation_start.cpipe`).*
es: *Te sugerimos que omitas este paso por ahora, no afectará al resto del pipeline, ya que estos módulos ya han sido configurados correctamente en el pipeline inicial (`segmentation_start.cpipe`).*
pt_br: *Sugerimos que você pule esta etapa por enquanto, pois ela não afetará o restante do pipeline, pois esses módulos foram configurados corretamente no pipeline inicial (`segmentation_start.cpipe`).*

source: *At the end of this tutorial you will find instructions on how to set up the input modules*
es: *Al final de este tutorial encontrarás instrucciones sobre cómo configurar los módulos de entrada*
pt_br: *No final deste tutorial você encontrará instruções sobre como configurar os módulos de entrada*

source: Build the analysis pipeline
es: Construye el pipeline de análisis
pt_br: Construa o pipeline de análise

source: Now, you are ready to start building your image analysis pipeline. But, **what IS an analysis pipeline?**
es: Ahora estás listo/a para comenzar a crear tu propio pipeline de análisis de imágenes. Pero, **¿qué ES un pipeline de análisis?**
pt_br: Agora você está pronto para começar a construir seu pipeline de análise de imagem. Mas, **o que É um pipeline de análise?**

source: Basically, it is a series of sequential processes, in which the output of one process serves as the input of one of the following ones.
es: Básicamente, se trata de una serie de procesos secuenciales, en los que la salida de un proceso sirve como entrada de uno de los siguientes.
pt_br: Basicamente, é uma série de módulos sequenciais, em que a saída de um módulo serve como entrada de um ou mais dos seguintes.

source: Thus, the order in which this processes are executed is **very** important, as is the proper naming of the inputs and the outputs (as you will see in this tutorial)
es: Por lo tanto, el orden en el que se ejecutan estos procesos es **muy** importante, al igual que la asignación de nombres adecuados para las entradas y salidas (como verás en este tutorial).
pt_br: Assim, a ordem em que esses módulos são executados é **muito** importante, assim como a nomenclatura adequada das entradas e saídas (como você verá neste tutorial)

source: During the construction of the pipeline, you will see two symbols appearing next to the modules:
es: Durante la construcción del pipeline, verás aparecer dos símbolos junto a los módulos:
pt_br: Durante a construção do pipeline, você verá dois símbolos aparecendo ao lado dos módulos:

source: <img src="./TutorialImages/Check.png" width="35"/> Checked box means that the module is activated and well configured
es: <img src="./TutorialImages/Check.png" width="35"/> La casilla marcada significa que el módulo está activado y bien configurado
pt_br: <img src="./TutorialImages/Check.png" width="35"/> A caixa marcada significa que o módulo está ativado e bem configurado

source: <img src="./TutorialImages/Error.png" width="35"/> This means that there is an error in the configuration of the module. You can hover with your mouse on it to get information on the problem.
es: <img src="./TutorialImages/Error.png" width="35"/> Esto significa que hay un error en la configuración del módulo. Puedes pasar el mouse sobre él para obtener información sobre el problema.
pt_br: <img src="./TutorialImages/Error.png" width="35"/> Isso significa que há um erro na configuração do módulo. Você pode parar o mouse sobre o ícone para obter informações sobre o problema.

source: Because the pipeline is sequential, it is possible that changing an upstream module will generate errors on a downstream module.
es: Debido a que el pipeline es secuencial, es posible que cambiar un módulo "río arriba" genere errores en un módulo "río abajo".
pt_br: Como o pipeline é sequencial, é possível que a alteração de um módulo acima gere erros em um módulo baixo.

source: You can click on any of the two symbols above to inactivate the module, which is signaled as <img src="./TutorialImages/InactivatedModule.png" width="35"/>. This means that the module (and any output it produces) is no longer a part of the pipeline and will be skipped.
es: Puedes hacer clic en cualquiera de los dos símbolos anteriores para desactivar el módulo, que se indica como <img src="./TutorialImages/InactivatedModule.png" width="35"/>. Esto significa que el módulo (y cualquier resultado que produzca) ya no forma parte del pipeline y se omitirá.
pt_br: Você pode clicar em qualquer um dos dois símbolos acima para desativar o módulo, que é sinalizado como <img src="./TutorialImages/InactivatedModule.png" width="35"/>. Isso significa que o módulo (e qualquer saída que ele produz) não faz mais parte do pipeline e será ignorado.

source: The <img src="./TutorialImages/open_eyes.png" width="35"/> icon means that the module output will be visible (it will pop-up in a new window or tab) when you run the pipeline.
es: El ícono <img src="./TutorialImages/open_eyes.png" width="35"/> significa que la salida del módulo será visible (aparecerá en una nueva ventana o pestaña) cuando ejecute <span class='notranslate'>pipeline.
pt_br: O ícone <img src="./TutorialImages/open_eyes.png" width="35"/> significa que o resultado do módulo estará visível (aparecerá em uma nova janela ou guia) quando você executar o pipeline.

source: The <img src="./TutorialImages/close_eyes.png" width="35"/> icon means that the module output will not be visible when you run the pipeline.
es: El icono <img src="./TutorialImages/close_eyes.png" width="35"/> significa que la salida del módulo no será visible cuando ejecute pipeline.
pt_br: O ícone <img src="./TutorialImages/close_eyes.png" width="35"/> significa que o resultado do módulo não estará visível quando você executar o pipeline.
