Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/BeginnerSegmentation.po
Languages: es, pt_br

source: **🔴 TO DO**: Adjust the parameters to get comparable results to the first image. Once your segmentation is good, try it on another image.
es: **🔴 PARA HACER: Ajusta los parámetros para obtener resultados comparables a los de la primera imagen. Una vez que tu segmentación sea buena, pruébala en otra imagen.**
pt_br: **🔴 PARA FAZER**: Ajuste os parâmetros para obter resultados comparáveis aos da primeira imagem. Quando sua segmentação estiver boa, experimente em outra imagem.

source: **7. IdentifyTertiaryObjects- Cytoplasm (2min)**
es: **7. Identificar objetos terciarios - Citoplasma (2min)**
pt_br: **7. IdentifyTertiaryObjects - Citoplasma (2min)**

source: **AIM: Identify the Cytoplasm of the cell**
es: **OBJETIVO: Identificar el citoplasma de las células**
pt_br: **OBJETIVO: Identificar o citoplasma da célula**

source: The `'Cells'` objects that we just identified contain both the cytoplasm of the cells and the nucleus. However the nucleus and the cytoplasm are two very distinct cellular compartments and, thus, we want to be able to make measurements in each of them separately.
es: Los objetos `'Cells'` que acabamos de identificar contienen tanto el citoplasma del células como el núcleo. Sin embargo, el núcleo y el citoplasma son dos compartimentos celulares muy distintos y, por ello, queremos poder realizar mediciones en cada uno de ellos por separado.
pt_br: Os objetos `'Cells'' que acabamos de identificar contêm tanto o citoplasma das células quanto o núcleo. Porém o núcleo e o citoplasma são dois compartimentos celulares muito distintos e, assim, queremos poder fazer medições em cada um deles separadamente.

source: Fortunately, to identify the cytoplasm, all we have to do is to subtract the `'Nuclei'` object, from the `'Cells'`object. We can do this using the **IdentifyTertiaryObjects** module
es: Afortunadamente, para identificar el citoplasma, todo lo que tenemos que hacer es restar el objeto `'Nuclei'` del objeto `'Cells'`. Podemos hacer esto usando el módulo **IdentifyTertiaryObjects**
pt_br: Felizmente, para identificar o citoplasma, basta subtrair o objeto `'Nuclei'` do objeto `'Cells'`. Podemos fazer isso usando o módulo **IdentifyTertiaryObjects**

source: After the **IdentifySecondaryObjects** module, add an **IdentifyTertiaryObjects** module.
es: Después del módulo **IdentifySecondaryObjects**, agregue un módulo **IdentifyTertiaryObjects**.
pt_br: Após o módulo **IdentifySecondaryObjects**, adicione o módulo **IdentifyTertiaryObjects**.

source: Create an object called `'Cytoplasm'` using the `'Cells'` and `'Nuclei'` objects you’ve created.
es: Cree un objeto llamado `'Cytoplasm'` usando los objetos `'Cells'` y `'Nuclei'` que ha creado.
pt_br: Crie um objeto chamado `'Cytoplasm'` usando os objetos `'Cells'` e `'Nuclei'` que você criou.

source: Select the larger and smaller identified objects from the drop-down menu.
es: Selecciona los objetos identificados más grandes y más pequeños del menú desplegable.
pt_br: Selecione os objetos identificados maiores e menores no menu suspenso.

source: Change the name of the objects to be identified.
es: Cambia el nombre de los objetos a identificar.
pt_br: Altere o nome dos objetos a serem identificados.

source: ‘Shrink smaller object prior to subtraction?’ should both set to ‘No’.
es: La opción 'Reducir el tamaño del objeto más pequeño antes de la sustracción' ('Shrink smaller object prior to subtraction?') debe estar configurada en 'No'.
pt_br: ‘Shrink smaller object prior to subtraction?’ (‘Reduzir o objeto menor antes da subtração?’) devem ambos ser definidos como ‘No’.

source: **8. Segment the nucleoli (15min)**
es: **8. Segmentar los nucléolos (15min)**
pt_br: **8. Segmentar os nucléolos (15min)**

source: **AIM: Segment a more challenging cellular compartment: the nucleoli**
es: **OBJETIVO: Segmentar un compartimento celular más desafiante: los nucléolos**
pt_br: **OBJETIVO: Segmentar um compartimento celular mais desafiador: os nucléolos**

source: So far, we have used untransformed images for object detection, but not all objects can be segmented from raw images. CellProfiler contains a variety of image processing modules that can aid segmentation. For this exercise, we will use two such modules, but there are other ones you can explore.
es: Hasta ahora, hemos utilizado imágenes no transformadas para la detección de objetos, pero no todos los objetos pueden ser segmentados a partir de imágenes en bruto. CellProfiler contiene una variedad de módulos de procesamiento de imágenes que pueden ayudar en la segmentación. Para este ejercicio, utilizaremos dos de estos módulos, pero hay otros que puedes explorar.
pt_br: Até agora, usamos imagens não transformadas (processadas) para detecção de objetos, mas nem todos os objetos podem ser segmentados a partir de imagens brutas. O CellProfiler contém uma variedade de módulos de processamento de imagem que podem auxiliar na segmentação. Para este exercício, usaremos dois desses módulos, mas existem outros que você pode explorar.

source: We will segment the nucleoli using the `'OrigRNA'` channel, in which all nucleic acids (DNA and RNA) are labeled, both inside and outside the nucleus (using Syto, a commercial dye). This means some trouble, because:
es: Segmentaremos los nucléolos a partir del canal `'OrigRNA'', en el que se marcan todos los ácidos nucleicos (ADN y ARN), tanto dentro como fuera del núcleo (utilizando Syto, un marcador comercial). Esto nos implica algunos problemas, porque:
pt_br: Segmentaremos os nucléolos usando o canal `'OrigRNA'`, no qual todos os ácidos nucléicos (DNA e RNA) são marcados, tanto dentro quanto fora do núcleo (usando Syto, um corante comercial). Isso resulta em alguns problemas, porque:

source: Not only the nucleoli but also the nuclei are labeled, which means that the nucleoli will not contrast so well with their background (the nucleus)
es: No solo los nucléolos sino también los núcleos están marcados, lo que significa que los nucléolos no contrastarán tan bien con su fondo (el núcleo)
pt_br: Não apenas os nucléolos, mas também os núcleos são marcados, o que significa que os nucléolos não contrastarão tão bem com o seu fundo (o núcleo)

source: There are RNA spots in the cytoplasm which are NOT nucleoli, and we don't want to identify those.
es: Hay cúmulos de ARN en el citoplasma que NO son nucléolos y no queremos identificarlos.
pt_br: Existem manchas de RNA no citoplasma que NÃO são nucléolos e não queremos identificá-las.

source: The next 3 modules will help address these issues to create the `'Nucleoli'` object. Look at the output from each to see how the image is transformed to aid in segmentation.
es: Los siguientes 3 módulos nos ayudarán a abordar estos problemas para crear el objeto `'Nucleoli'`. Observa el resultado de cada uno para ver cómo se transforma la imagen para ayudar en la segmentación.
pt_br: Os próximos 3 módulos ajudarão a resolver esses problemas para criar o objeto `'Nucleoli'`. Observe o resultado de cada um para ver como a imagem é transformada para auxiliar na segmentação.

source: After the **IdentifyTertiaryObjects** module, add an **EnhanceOrSuppressFeatures** module.
es: Después del módulo **IdentifyTertiaryObjects**, agrega un módulo **EnhanceOrSuppressFeatures**.
pt_br: Após o módulo **IdentifyTertiaryObjects**, adicione um módulo **EnhanceOrSuppressFeatures** (Melhorar ou suprimir características).

source: **EnhanceOrSuppressFeatures** is a module that helps enhance parts of an image, in this case, punctate objects or `‘Speckles’`. As we are looking for nucleoli, we apply this to the RNA channel (`'OrigRNA'`) image and call the output `‘FilteredRNA’`.
es: **EnhanceOrSuppressFeatures** es un módulo que ayuda a mejorar partes de una imagen, en este caso, objetos punteados o `‘Speckles’`. Dado que buscamos identificar nucléolos, aplicamos este procesamiento a la imagen del canal de ARN (`'OrigRNA'`) y llamamos a la salida ``FilteredRNA''.
pt_br: **EnhanceOrSuppressFeatures** é um módulo que ajuda a aprimorar partes de uma imagem, neste caso, objetos pontilhados ou ``Speckles'`. Como procuramos nucléolos, aplicamos isso à imagem do canal de RNA (`'OrigRNA'`) e chamamos o resultado de ``FilteredRNA'`.

source: **🔴 TO DO: Enhance nucleoli spots**
es: **🔴 PARA HACER: Mejorar las spots de los nucleolos**
pt_br: **🔴 PARA FAZER: Melhore marcação de nucléolos**

source: Change the input image from the drop-down menu to `‘OrigRNA’`
es: Cambia la imagen de entrada del menú desplegable a ``OrigRNA''
pt_br: Altere a imagem de entrada no menu suspenso para ``OrigRNA'`

source: Change the name of the output image to `‘FilteredRNA’`
es: Cambia el nombre de la imagen de salida a ``FilteredRNA''
pt_br: Altere o nome da imagem de saída para ``FilteredRNA'`

source: Change the feature size to see how this affects the output and find a value that works well.
es: - Cambia el 'Feature Size' para ver cómo afecta la salida y encuentra un valor que funcione bien.
pt_br: Altere o valor do tamanho da característica para ver como isso afeta o resultado e encontre um valor que funcione bem.

source: **NOTE**: be careful when using large numbers as the module might take a long time to run
es: **NOTA**: ten cuidado al utilizar números grandes ya que el módulo puede tardar mucho en ejecutarse
pt_br: **NOTA**: tenha cuidado ao usar números grandes, pois o módulo pode demorar muito para ser executado

source: See below for an example of results to aim for:
es: - Ver a continuación un ejemplo de los resultados a los que se debe apuntar:
pt_br: Veja abaixo um exemplo de um bom resultado:

source: *Figure 13. The **EnhanceOrSuppress** module output, enhancing the OrigRNA image allows you to isolate nucleoli against the nucleoplasmic background signal.*
es: *Figura 13. La salida del módulo **EnhanceOrSuppressFeatures**, al realzar la imagen de OrigRNA, permite aislar los nucléolos frente a la señal nucleoplásmica de fondo.*
pt_br: *Figura 13. Resultado do módulo **EnhanceOrSuppress**, aprimorando a imagem OrigRNA, permite isolar nucléolos contra o sinal de fundo nucleoplasmático.*

source: After the **EnhanceOrSuppressFeatures** module, add an **MaskImage** module.
es: Después del módulo **EnhanceOrSuppressFeatures**, agrega un módulo **MaskImage**.
pt_br: Após o módulo **EnhanceOrSuppressFeatures**, adicione um módulo **MaskImage**.

source: **MaskImage** allows you to create a version of the `‘FilteredRNA’` image called `‘RNA_in_Nuclei’` where all the pixels except the ones you specify are set to an intensity of 0. In this case, we set to 0 any pixel not inside a nucleus. By doing this, we can decrease the likelihood of detecting cytoplasmic RNA dots.
es: **MaskImage** te permite crear una versión de la imagen `'FilteredRNA'` llamada `'RNA_in_Nuclei'` donde todos los píxeles, excepto los que especifiques, se establecen en una intensidad de 0. En este caso, configuramos en 0 cualquier píxel que no esté dentro de un núcleo. Al hacer esto, podemos disminuir la probabilidad de detectar puntos de ARN en el citoplasma.
pt_br: **MaskImage** permite que você crie uma versão da imagem `'FilteredRNA'` chamada `'RNA_in_Nuclei'` onde todos os pixels, exceto aqueles que você especificou, são definidos com uma intensidade 0. Neste caso, definimos como 0 qualquer pixel que não esteja dentro de um núcleo. Ao fazer isso, podemos diminuir a probabilidade de detecção de pontos de RNA citoplasmático.

source: **🔴 TO DO: Mask the RNA image to show only the nuclear region**
es: **🔴 PARA HACER: Enmascara la imagen de ARN para mostrar solo la región nuclear**
pt_br: **🔴 PARA FAZER: Mascarar a imagem do RNA para mostrar apenas a região nuclear**

source: Change the input image from the drop-down menu to ‘FilteredRNA’.
es: Cambia la imagen de entrada del menú desplegable a 'FilteredRNA'.
pt_br: Altere a imagem de entrada no menu suspenso para ‘FilteredRNA’.

source: Change the name of the output image to ‘RNA_in_Nuclei’.
es: Cambia el nombre de la imagen de salida a 'RNA_in_Nuclei'.
pt_br: Altere o nome da imagem de saída para ‘RNA_in_Nuclei’.

source: Use the objects ‘Nuclei’ as the mask.
es: Usar los objetos 'Nuclei' como máscara.
pt_br: Use os objetos ‘Nuclei’ como máscara.

source: *Figure 14. The **MaskImage** module output, the contrast was adjusted to show that the intensity of the pixels outside the nuclei are now set to 0.*
es: *Figura 14. En la salida del módulo **MaskImage**, el contraste se ajustó para mostrar que la intensidad de los píxeles fuera de los núcleos ahora está establecida en 0.*
pt_br: *Figura 14. Resultado do módulo **MaskImage**, o contraste foi ajustado para mostrar que a intensidade dos pixels fora dos núcleos agora está definida como 0.*

source: After the **MaskImage** module, add an **IdentifyPrimaryObject** module.
es: Después del módulo **MaskImage**, agrega un módulo **IdentifyPrimaryObject**.
pt_br: Após o módulo **MaskImage**, adicione um módulo **IdentifyPrimaryObject**.

source: **IdentifyPrimaryObjects** is used to ﬁnd the nucleoli. This is a Primary object segmentation because we are not using another object as a seed (i.e., starting point), and are only segmenting based off the intensity in our `‘RNA_in_Nuclei’` image.
es: **IdentifyPrimaryObjects** se utiliza para encontrar los nucléolos. Esta es una segmentación de objeto primario porque no estamos usando otro objeto como semilla (es decir, punto de partida) y sólo estamos segmentando en función de la intensidad en nuestra imagen `‘RNA_in_Nuclei’`.
pt_br: **IdentifyPrimaryObjects** é usado para encontrar os nucléolos. Esta é uma segmentação de objeto primário porque não estamos usando outro objeto como semente (ou seja, ponto de partida), e estamos apenas segmentando com base na intensidade em nossa imagem ``RNA_in_Nuclei'`.

source: **🔴 TO DO: Segment nucleoli**
es: **🔴 PARA HACER: Segmentar los nucleolos**
pt_br: **🔴 PARA FAZER: segmentar nucléolos**

source: Change the input image from the drop-down menu to `‘RNA_in_Nuclei’`
es: Cambia la imagen de entrada del menú desplegable a ``RNA_in_Nuclei''
pt_br: Altere a imagem de entrada no menu suspenso para ``RNA_in_Nuclei'`

source: Change the name of the objects to `‘Nucleoli’`
es: Cambia el nombre de los objetos a ``Nucleoli''
pt_br: Mude o nome dos objetos para ``Nucleoli'`

source: Adjust the segmentation parameters until you are satisfied with the results.
es: Ajusta los parámetros de segmentación hasta que esté satisfecho con los resultados.
pt_br: Ajuste os parâmetros de segmentação até ficar satisfeito com os resultados.

source: **Tip**: you can use a similar strategy to segment mitochondria using the `'OrigMito'` channel
es: **Consejo**: puedes utilizar una estrategia similar para segmentar las mitocondrias usando el canal `'OrigMito'`
pt_br: **Dica**: você pode usar uma estratégia semelhante para segmentar mitocôndrias usando o canal `'OrigMito'`

source: **🔴 TO DO**: Add an **OverlayOutlines** module at this point to overlay the identiﬁed nucleoli on the `'Orig_RNA'` image to assure yourself that the segmentation not only matches the speckle enhanced `'FilteredRNA'` image, but also looks accurate on the unprocessed image as well. This is not strictly necessary but can be a nice “sanity check”.
es: **🔴 PARA HACER**: Agrega un módulo **OverlayOutlines** en este punto para superponer los nucléolos identiﬁcados en la imagen `'Orig_RNA'` para asegurarse de que la segmentación no solo coincida con la imagen ``FilteredRNA'` mejorada con motas. , pero también parece preciso en la imagen sin procesar como pocillo. Esto no es estrictamente necesario, pero puede ser un buen control de calidad.
pt_br: **🔴 PARA FAZER**: Adicione um módulo **OverlayOutlines** ao pipeline para sobrepor os nucléolos identificados na imagem `'Orig_RNA'`, isto é necessário para garantir que a segmentação feita na imagem `'FilteredRNA'` aprimorada pelo módulo **EnhanceOrSupressFeatures**, corresponda ao que você gostaria na imagem não processada. Isso não é estritamente necessário, mas pode ser uma boa “verificação de sanidade”.

source: **Goal**: display outlines of your nucleoli and your nuclei on the unprocessed `'OrigRNA'` image.
es: **Objetivo**: mostrar los contornos de tus nucléolos y núcleos en la imagen ``OrigRNA'' sin procesar.
pt_br: **Objetivo**: exibir contornos de seus nucléolos e seus núcleos na imagem `'OrigRNA'` não processada.

source: Name the output image `'SanityCheck'`
es: Nombra la imagen de salida `'SanityCheck'`
pt_br: Nomeie a imagem de saída como `'SanityCheck'`

source: Here’s an example of what that could look like (red=Nuclei, green=Nucleoli):
es: A continuación se muestra un ejemplo de cómo podría verse (ROJO = núcleos, VERDE = nucléolos):
pt_br: Aqui está um exemplo de como seria o resultado (vermelho=Núcleos, verde=Nucléolos):

source: *Figure 15. The **OverlayOutlines** module output, all detected nucleoli are within the nuclei.*
es: *Figura 15. En la salida del módulo **OverlayOutlines**, todos los nucléolos detectados están dentro de los núcleos.*
pt_br: *Figura 15. Resultado do módulo **OverlayOutlines** mostra que todos os nucléolos detectados estão dentro dos núcleos.*

source: **9. 🔴 TO DO: Add measurement modules to your pipeline (10min)**
es: **9. 🔴 PARA HACER: Agregar módulos de medición a tu pipeline (10min)**
pt_br: **9. 🔴 PARA FAZER: Adicione módulos de medição ao seu pipeline (10min)**

source: After your segmentation of the nucleoli, add as many object measurement modules as you would like.
es: Después de la segmentación de los nucléolos, agrega tantos módulos de medición de objetos como desees.
pt_br: Após a segmentação dos nucléolos, adicione quantos módulos de medição de objetos desejar.

source: Some suggested modules to add: **MeasureObjectIntensity**, **MeasurebjectSizeShape**, **MeasureColocalization**, **MeasureObjectNeighbors**.
es: Algunos módulos sugeridos para agregar son: **MeasureObjectIntensity**, **MeasurebjectSizeShape**, **MeasureColocalization**, **MeasureObjectNeighbors**.
pt_br: Alguns módulos sugeridos são: **MeasureObjectIntensity**, **MeasurebjectSizeShape**, **MeasureColocalization**, **MeasureObjectNeighbors**.

source: **IMPORTANT!**
es: **¡IMPORTANTE!**
pt_br: **IMPORTANTE!**

source: If you choose to include the **MeasureColocalization** module, we highly recommend setting the `'Calculate the Manders coefficients using Costes auto threshold'` option to `'NO'`. Otherwise, this module can be very time-consuming
es: Si eliges incluir el módulo **MeasureColocalization**, te recomendamos fuertemente configurar la opción `'Calculate the Manders coefficients using Costes auto threshold'` en `'NO'`. De lo contrario, este módulo puede llevar mucho tiempo en ejecutarse.
pt_br: Se você optar por incluir o módulo **MeasureColocalization**, é altamente recomendável definir a opção `'Calcular os coeficientes de Manders usando o limite automático de custos'` como `'NÃO'`. Caso contrário, este módulo pode consumir muito tempo

source: Which objects do you think would be valuable to measure with each of these modules?
es: ¿Qué objetos crees que sería valioso medir con cada uno de estos módulos?
pt_br: Quais objetos você acha que seriam valiosos para medir com cada um desses módulos?

source: Which channels would you measure your objects in?
es: ¿En qué canales medirías tus objetos?
pt_br: Em quais canais você mediria seus objetos?

source: For a typical Cell Painting experiment you would add as many measurements as possible, but that isn’t necessary here; however, do make sure every object gets at least some measurements.
es: Para un experimento típico de Cell Painting se añadirían tantas mediciones como fuera posible, pero eso no es necesario aquí; sin embargo, asegúrate de que cada objeto recibe al menos alguna de las mediciones.
pt_br: Para um experimento típico de pintura celular (Cell Painting Assay), você adicionaria tantas medidas quanto possível, mas aqui isso não é necessário; no entanto, certifique-se de que cada objeto tenha alguma medição.

source: **IMPORTANT NOTE**: there are many more measurement modules and, while we encourage you to explore them and some of them like **MeasureCorrelation**, **MeasureTexture** and **MeasureObjectIntensityDistribution** can produce valuable data for downstream proﬁling, they can be memory-intensive and/or slow. So, for the sake of running this analysis within a reasonable time, they should **not** be added for this example pipeline.
es: **NOTA IMPORTANTE**: hay muchos más módulos de medición y, si bien te alentamos a explorarlos y algunos de ellos como **MeasureCorrelation**, **MeasureTexture** y **MeasureObjectIntensityDistribution** pueden producir datos valiosos para el análisis de perfiles posterior, pueden consumir mucha memoria y/o ser lentos. Por lo tanto, para poder ejecutar este análisis en un tiempo razonable, **no** deben agregarse para este pipeline de ejemplo.
pt_br: **NOTA IMPORTANTE**: existem outros módulos de medição e, embora encorajemos você a explorá-los, alguns deles como **MeasureCorrelation**, **MeasureTexture** e **MeasureObjectIntensityDistribution** podem produzir dados valiosos para a criação de perfil, eles podem consumir muita memória e/ou ser lentos. Portanto, para executar esta análise dentro de um prazo razoável, eles **não** devem ser adicionados a este pipeline de exemplo.

source: **10. Relate Nucleoli to their corresponding Nuclei using the RelateObjects module (5min)**
es: **10. Relaciona los nucléolos con sus núcleos correspondientes usando el módulo RelateObjects (5min)**
pt_br: **10. Relacione Nucléolos com seus Núcleos correspondentes usando o módulo RelateObjects (5min)**

source: Right now, you have segmented the nucleoli independently. However, we would like to associate every `'Nucleoli'` to their respective `'Nuclei'`.
es: Ahora mismo has segmentado los nucléolos de forma independiente. Sin embargo, nos gustaría asociar cada objeto `'Nucleoli'` a su respectivo objeto `'Nuclei'`.
pt_br: Neste momento, você segmentou os nucléolos de forma independente. No entanto, gostaríamos de associar cada `'Nucléolo'` aos seus respectivos `'Núcleos'`.

source: **🔴 TO DO:** Add a **RelateObjects** module and configure it to relate `‘Nucleoli’` to `‘Nuclei’`.
es: **🔴 PARA HACER:** Agrega un módulo **RelateObjects** y configúralo para relacionar ``Nucleoli'' con ``Nuclei''.
pt_br: **🔴 PARA FAZER:** Adicione um módulo **RelateObjects** e configure-o para relacionar ``Nucleoli'` a ``Nuclei'`.

source: *Figure 16: The **RelateObjects** module output.*
es: *Figura 16: Salida del módulo **RelateObjects**.*
pt_br: *Figura 16: Resultado do módulo **RelateObjects**.*

source: Relating the objects allows you to create per-parent means (e.g., for this cell, what is the average size of an individual mitochondrion) and calculate distances from the child objects to the edge and/or the center of the parent (e.g., how far is each nucleolus from the center of the nucleus).
es: Relacionar los objetos te permite crear promedios de las mediciones de los objetos "hijos" por objecto "parental" (por ejemplo, para esta célula, ¿cuál es el tamaño promedio de una mitocondria individual?) y calcular distancias desde los objetos "hijos" al borde y/o al centro del objeto "parental" (por ejemplo, ¿qué tan lejos está cada nucleolo del centro del núcleo?).
pt_br: Relacionar os objetos permite criar médias por objeto pai (por exemplo, para esta célula, qual é o tamanho médio de uma mitocôndria individual) e calcular distâncias dos objetos filhos até a borda e/ou centro do objeto parental (por exemplo, quão longe está cada nucléolo do centro do núcleo).

source: **11. Export measurements**
es: **11. Exportar mediciones**
pt_br: **11. Exportar medidas**
