Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/BeginnerSegmentation.po
Languages: es, pt_br

source: Add a **ExportToSpreadsheet** module at the end of the pipeline.
es: Agrega un módulo **ExportToSpreadsheet** al final del pipeline.
pt_br: Adicione um módulo **ExportToSpreadsheet** no final do pipeline.

source: In `'Output file location'` select `'Default Output Folder'`
es: En `'Output file location'` selecciona 'Default Output Folder'`
pt_br: Em `'Output file location'` (`'Local do arquivo de saída'`) selecione `'Default Output Folder'` (`'Pasta de saída padrão'`)

source: You can change the `'Default Output Folder'` by clicking the <img src="./TutorialImages/OutputSettings.png" width="120"/> button at the bottom left corner of the window
es: Puedes cambiar la `'Carpeta de salida predeterminada'` (`'Default Output Folder'`) haciendo clic en el botón <img src="./TutorialImages/OutputSettings.png" width="120"/> en la esquina inferior izquierda de la ventana.
pt_br: Você pode alterar a `'Default Output Folder'` clicando no botão <img src="./TutorialImages/OutputSettings.png" width="120"/> no canto inferior esquerdo da janela

source: Leave all the default settings (as shown in Figure 17)
es: Deja todas las configuraciones predeterminadas (como se muestra en la Figura 17)
pt_br: Deixe todas as configurações padrão (conforme mostrado na Figura 17)

source: You can pick and choose which measurements to export by selecting `'No'` in the `'Export all measurement types?'` setting
es: Puedes elegir qué medidas exportar seleccionando "No" en la configuración 'Export all measurement types?'` ("¿Exportar todos los tipos de medidas?")
pt_br: Você pode escolher quais medidas exportar selecionando `'No'` nas configuração `'Export all measurement types?'` (`'Exportar todos os tipos de medidas?'`)

source: **Note** that a <img src="./TutorialImages/Warning.png" width="35"/> appears next to the module. This is not an error. If you hover over it with your mouse, you will see that it is just a warning saying that '**ExportToSpreadsheet** will not produce output in Test Mode'. The measurements will only be saved when you run the pipeline for all images (see next section).
es: **Observa** que aparece un <img src="./TutorialImages/Warning.png" width="35"/> junto al módulo. Esto no es un error. Si pasas el mouse sobre él, verás que es solo una advertencia que dice que "**ExportToSpreadsheet** no producirá resultados en el modo de prueba". Las medidas solo se guardarán cuando ejecute pipeline para todas las imágenes (ver la siguiente sección).
pt_br: **Observe** que um <img src="./TutorialImages/Warning.png" width="35"/> aparece próximo ao módulo. Isso não é um erro. Se você passar o mouse sobre ele, verá que é apenas um aviso dizendo que '**ExportToSpreadsheet** não pode ser executado no modo de teste'. As medições só serão salvas quando você executar o pipeline para todas as imagens (veja a próxima seção).

source: *Figure 17: The **ExportToSpreadsheet** module.*
es: *Figura 17: El módulo **ExportToSpreadsheet**.*
pt_br: *Figura 17: O módulo **ExportToSpreadsheet**.*

source: **12. Save overlay images** **[OPTIONAL]**
es: **12. Guardar imágenes superpuestas** **[OPCIONAL]**
pt_br: **12. Salvar imagens sobrepostas** **[OPCIONAL]**

source: As we are exporting the results of our analysis, it can also be worthwhile to save the SanityCheck images we made previously because they are useful as a control of your segmentations and to share your work with others!
es: Mientras exportamos los resultados de nuestro análisis, también puede valer la pena guardar las imágenes de control de calidad ("SanityCheck") que creamos anteriormente porque son útiles como control de sus segmentaciones y para compartir su trabajo con otras personas.
pt_br: Como estamos exportando os resultados de nossas análises, pode ser interessante salvar as imagens do SanityCheck que fizemos anteriormente, pois elas são úteis para controlar suas segmentações e para compartilhar seu trabalho com outras pessoas!

source: Add a **SaveImages** module at the end of the pipeline.
es: Agrega un módulo **SaveImages** al final de pipeline.
pt_br: Adicione um módulo **SaveImages** no final do pipeline.

source: Choose `'SanityCheck'` as the image to save.
es: Elige tu imagen de control de calidad (`'SanityCheck'`) como imagen para guardar.
pt_br: Escolha `'SanityCheck'` como imagem a ser salva.

source: We want to name the resulting image after the OrigRNA image that was used to create it.
es: Queremos nombrar la imagen resultante según la imagen de OrigRNA que se utilizó para crearla.
pt_br: Queremos nomear a imagem resultante com o mesmo nome da imagem OrigRNA que foi usada para criá-la.

source: In the `'Select method to construct file names'` field, leave '`From iamge filename'`.
es: En el campo 'Select method to construct file names'` (``Seleccionar método para construir nombres de archivos''), deja la opción por defecto `From iamge filename'` (``A partir del nombre del archivo de imagen'').
pt_br: No campo `'Select method to construct file names'` (`'Selecionar método para construir nomes de arquivos'`), deixe '`From image filename'`.

source: In the `'Select image name for file prefix'` field, select '`OrigRNA'`.
es: En el campo `'Select image name for file prefix'` (``Seleccionar nombre de imagen para prefijo del archivo''), selecciona ``OrigRNA''.
pt_br: No campo `'Select image name for file prefix'` (`'Selecionar nome da imagem para prefixo de arquivo'`), selecione '`OrigRNA'`.

source: Add `'_overlay'` as a suffix to the saved images. Then, the image name will be the original filename + `'_overlay'`
es: Agregue `'_overlay'` como sufijo a las imágenes guardadas. Entonces, el nombre de la imagen será el nombre del archivo original + `'_overlay'`
pt_br: Adicione `'_overlay'` como sufixo às imagens salvas. Então, o nome da imagem será o nome do arquivo original + `'_overlay'`

source: In `'Output file location'` select `'Default Output Folder sub-folder'` and name that sub-folder `'overlay_images'`
es: En `'Output file location'`, selecciona `'Default Output Folder sub-folder'` y asigna a esa subcarpeta el nombre ``overlay_images'`.
pt_br: Em `'Output file location'` (`'Local do arquivo de saída'`) selecione `'Default Output Folder sub-folder'` (`'Subpasta da pasta de saída padrão'`) e nomeie essa subpasta como `'overlay_images'`

source: You can change the `'Default Output Folder'` by clicking the <img src="./TutorialImages/OutputSettings.png" width="120"/> button at the bottom left corner of the window.
es: Puedes cambiar la carpeta de salida predeterminada ( `'Default Output Folder'`) haciendo clic en el botón <img src="./TutorialImages/OutputSettings.png" width="120"/> en la esquina inferior izquierda de la ventana.
pt_br: Você pode alterar a `'Default Output Folder'` (`'Pasta de Saída Padrão'`) clicando no botão <img src="./TutorialImages/OutputSettings.png" width="120"/> no canto inferior esquerdo da janela.

source: Leave the rest of the settings as they are in the default (as shown in Figure 18)
es: Deja el resto de las configuraciones tal como están predeterminadas (como se muestra en la Figura 18)
pt_br: Deixe o restante das configurações como estão no padrão (conforme mostrado na Figura 18)

source: *Figure 18: The **SaveImages** module.*
es: *Figura 18: El módulo **SaveImages**.*
pt_br: *Figura 18: O módulo **SaveImages**.*

source: **13. Run the pipeline**
es: **13. Ejecuta el pipeline**
pt_br: **13. Execute o pipeline**

source: Now you have a pipeline that works well across different images. It is time to run it through your entire dataset and collect the results!
es: Ahora tienes un pipeline que funciona bien en diferentes imágenes. ¡Es hora de ejecutarlo en todas tus imágenes y recopilar los resultados!
pt_br: Agora você tem um pipeline que funciona bem em imagens diferentes. É hora de analisar todo o seu conjunto de dados e coletar os resultados!

source: Exit test mode by clicking on the <img src="./TutorialImages/ExitTestMode.png" width="120"/> button.
es: Sal del modo de prueba haciendo clic en el botón <img src="./TutorialImages/ExitTestMode.png" width="120"/>.
pt_br: Saia do modo de teste clicando no botão <img src="./TutorialImages/ExitTestMode.png" width="120"/>.

source: Turn all the <img src="./TutorialImages/EyeOpen.png" width="50"/> symbols to <img src="./TutorialImages/EyeClosed.png" width="50"/> so that module outputs don't pop up during analysis.
es: Cambia todos los símbolos <img src="./TutorialImages/EyeOpen.png" width="50"/> a <img src="./TutorialImages/EyeClosed.png" width="50"/> para que las salidas de los módulos no aparezcan durante el análisis.
pt_br: Transforme todos os símbolos <img src="./TutorialImages/EyeOpen.png" width="50"/> em <img src="./TutorialImages/EyeClosed.png" width="50"/> para que os resultados dos módulos não apareçam durante a análise.

source: You can also do this by going to `'Windows'` in the main menu (top of the screen) and selecting `'Hide All Windows On Run'`
es: También puedes hacer esto yendo a `'Windows'` en el menú principal (parte superior de ventana) y seleccionando `'Hide All Windows On Run'`
pt_br: Você também pode fazer isso acessando `'Windows'` no menu principal (parte superior da tela) e selecionando `'Hide All Windows On Run'`

source: Then, click on <img src="./TutorialImages/AnalyzeImages.png" width="120"/> button at the bottom left corner.
es: Luego, haz clic en el botón <img src="./TutorialImages/AnalyzeImages.png" width="120"/> en la esquina inferior izquierda.
pt_br: Em seguida, clique no botão <img src="./TutorialImages/AnalyzeImages.png" width="120"/> no canto inferior esquerdo.

source: Explore the spreadsheets created for each object.
es: Explora las hojas de cálculo creadas para cada objeto.
pt_br: Explore as planilhas criadas para cada objeto.

source: **CONGRATULATIONS!! YOU HAVE SUCCESSFULLY RUN YOUR FIRST CELL PROFILER PIPELINE!**
es: **¡¡FELICIDADES!! ¡HAS EJECUTADO CON ÉXITO TU PRIMER PIPELINE DE CELLPROFILER!**
pt_br: **PARABÉNS!! VOCÊ EXECUTOU COM SUCESSO SEU PRIMEIRO PIPELINE DO CELLPROFILER!**

source: **3. [OPTIONAL] Set up the input modules (10min)**
es: **3. [OPCIONAL] Configurar los módulos de entrada (10 min)**
pt_br: **3. [OPCIONAL] Configurar os módulos de entrada (10min)**

source: The four input modules (**Images**, **Metadata**, **NamesAndTypes**, and **Groups**) are crucial for any CellProfiler pipeline because they define how images are loaded and organized.
es: Los cuatro módulos de entrada (**Images**, **Metadata**, **NamesAndTypes** y **Groups**) son cruciales para cualquier CellProfiler pipeline porque definir cómo se cargan y organizan las imágenes.
pt_br: Os quatro módulos de entrada (**Images**, **Metadada**, **NamesAndTypes** e **Groups**) são cruciais para qualquer pipeline do CellProfiler porque definem como as imagens são carregadas e organizadas.

source: The **Metadata** module is already conﬁgured. With it, you can extract information that is required for you analysis and which is not contained within the images themselves (thus, the name 'Metadata'):
es: El módulo **Metadata** ya está configurado. Con él, puede extraer información necesaria para su análisis y que no está contenida en las imágenes mismas (de ahí el nombre 'Metadatos'):
pt_br: O módulo **Metadada** já está configurado. Com ele, você pode extrair informações necessárias para sua análise e que não estão contidas nas próprias imagens (daí o nome 'Metadados'):

source: In this case, the module extracts the **Plate**, **Well**, **Site** and **ChannelNumber** from the image files' names.
es: En este caso, el módulo extrae la **Plate** (Placa), **Well** (Pocillo), **Site** (Sitio) y **ChanelNumber** (Número de canal) a partir de los nombres de los archivos de imagen.
pt_br: Neste caso, o módulo extrai **Plate**, **Well**, **Site** e **ChannelNumber** dos nomes dos arquivos de imagem.

source: This situation is a rather simple one, but if your own data is more complex, there are other ways of obtaining metadata. You can `Add another extraction method` and choose which images to apply them to.
es: Esta situación es bastante simple, pero si sus propios datos son más complejos, existen otras formas de obtener metadatos. Puede "Agregar otro método de extracción" ( `Add another extraction method`) y elegir a qué imágenes aplicarlo.
pt_br: Esta situação é bastante simples, mas se os seus próprios dados forem mais complexos, existem outras formas de obter metadados. Você pode `Adicionar outro método de extração` e escolher em quais imagens aplicá-los.

source: You can also add a file which adds extra Metadata per image.
es: También puedes agregar un archivo que agregue metadatos adicionales por imagen.
pt_br: Você também pode adicionar um arquivo que contém metadados extras por imagem.

source: The module uses a `'regular expression'` (also known as RegEx), a sort of template that fits all the file names and allows to obtain data from them.
es: El módulo utiliza una ``expresión regular'' (también conocida como RegEx), una especie de plantilla que se adapta a todos los nombres de archivos y permite obtener datos de ellos.
pt_br: O módulo utiliza uma `'expressão regular'` (também conhecida como RegEx), uma espécie de modelo que ajusta todos os nomes de arquivos e permite obter dados deles.

source: Click on the magnifying glass at the end of the regular expression box for each extraction method to see how it works.
es: Haz clic en la lupa al final del cuadro de expresión regular para cada método de extracción para ver cómo funciona.
pt_br: Clique na lupa no final da caixa de expressão regular de cada método de extração para ver como funciona.

source: Let's analyze the example used in this tutorial:
es: Analicemos el ejemplo utilizado en este tutorial:
pt_br: Vamos analisar o exemplo usado neste tutorial:

source: Expressions contained between parentheses are VARIABLE and are captured into named variables (denoted as `(?P<VariableName>)`).
es: Las expresiones contenidas entre paréntesis son VARIABLES y se capturan en variables con nombre (indicadas como `(?P<VariableName>)`).
pt_br: As expressões contidas entre parênteses são VARIÁVEIS e são capturadas em variáveis nomeadas (denotadas como `(?P<VariableName>)`).

source: Expressions outside parentheses are CONSTANT and should be present in ALL image file names (like the underscores and the '.tif')
es: Las expresiones fuera de los paréntesis son CONSTANTES y deben estar presentes en TODOS los nombres de archivos de imágenes (como los guiones bajos y el '.tif')
pt_br: Expressões fora dos parênteses são CONSTANTES e devem estar presentes em TODOS os nomes de arquivos de imagem (como os sublinhados e o '.tif')

source: `^`: Start the regular expression
es: `^`: Inicia la expresión regular
pt_br: `^`: Inicia a expressão regular

source: `(?P<Plate>.*)`: Extract all the characters before the first underscore character (_) and assign them to the measurement **"Plate"** for the image.
es: `(?P<Plate>.*)`: Extrae todos los caracteres antes del primer carácter de guión bajo (_) y los asigna a la variable **"Plate"**.
pt_br: `(?P<Plate>.*)`: Extraia todos os caracteres antes do primeiro caractere de sublinhado (_) e atribua-os à medida **"Placa"** para a imagem .

source: `(?P<Well>[A-P]{1}[0-9]{2})`: Extract a single (denoted as {1}) uppercase letter from A to P (denoted as [A-P]). Then, extract the next two digits ({2}) between [0-9] and assign it to the measurment **"Well"** for the image.
es: `(?P<Well>[A-P]{1}[0-9]{2})`: extrae una única letra mayúscula (indicado como {1}) de la A a la P (indicado como [A-P]). Luego, extrae los siguientes dos dígitos ({2}) entre [0-9] y los asigna a la variable **"Well "**.
pt_br: `(?P<Well>[A-P]{1}[0-9]{2})`: Extraia uma única letra maiúscula (denotada como {1}) de A a P (denotada como [A-P]). Em seguida, extraia os próximos dois dígitos ({2}) entre [0-9] e atribua-os à medição **"Well"** para a imagem.

source: `site(?P<Site>[0-9])`: After the constant string "site", extract the next two digits {2} between [0-9] and assign it to the measurement **"Site"** for the image.
es: `site(?P<Site>[0-9])`: Después del texto constante "site", extrae los siguientes dos dígitos {2} entre [0-9] y los asigna a la variable **"Site "**.
pt_br: `site(?P<Site>[0-9])`: Após a string constante "site", extraia os próximos dois dígitos {2} entre [0-9] e atribua-o à medição **"Site"** para a imagem.

source: `Ch(?P<ChannelNumber>[1-5])`: After the constant string "Ch", extract the next digit between [1-5] and assign it to the measurement **"ChannelNumber"** for the image.
es: `Ch(?P<ChannelNumber>[1-5])`: Después del texto constante "Ch", extrae el siguiente dígito entre [1-5] y lo asigna a la variable **"ChannelNumber"**.
pt_br: `Ch(?P<ChannelNumber>[1-5])`: Após a string constante "Ch", extraia o próximo dígito entre [1-5] e atribua-o à medição **"ChannelNumber"** para a imagem.

source: If you want to learn more about how these regular expressions work or how to adapt them to other situations, click on the <img src="./TutorialImages/Info.png" width="35"> button.
es: Si desea obtener más información sobre cómo funcionan estas expresiones regulares o cómo adaptarlas a otras situaciones, haga clic en el botón <img src="./TutorialImages/Info.png" width="35">.
pt_br: Se quiser saber mais sobre como funcionam essas expressões regulares ou como adaptá-las a outras situações, clique no botão <img src="./TutorialImages/Info.png" width="35">.

source: *Figure 4: The **Metadata** module, columns in table correspond to metadata categories*
es: *Figura 4: El módulo **Metadata**, las columnas de la tabla corresponden a categorías de metadatos*
pt_br: *Figura 4: O módulo **Metadada**, as colunas na tabela correspondem às categorias de metadados*

source: In the **NamesAndTypes** module, we assign names to the images and configure image sets (i.e., all the different channels for a field of view). We will use the metadata we extracted in the previous module to make that association possible.
es: En el módulo **NamesAndTypes**, asignamos nombres a las imágenes y configuramos conjuntos de imágenes (es decir, todos los diferentes canales para un mismo campo de visión). Usaremos los metadatos que extrajimos en el módulo anterior para hacer posible esa asociación.
pt_br: No módulo **NamesAndTypes**, atribuímos nomes às imagens e configuramos conjuntos de imagens (ou seja, todos os diferentes canais de cada campo). Usaremos os metadados que extraímos no módulo anterior para possibilitar essa associação.

source: This module is also fully configured already, but scroll and look through the configuration to see how we use the **ChannelNumber** obtained from the **Metadata** module to assign names to each image (There are several other ways to create correct mappings, but these may serve as a helpful example to refer to in your own work).
es: Este módulo también está completamente configurado, pero desplázate y observa la configuración para ver cómo usamos el **ChannelNumber** obtenido del módulo **Metadata** para asignar nombres a cada imagen (hay varias otras formas de crear mapeos correctos, pero estos pueden servir como un ejemplo útil para consultar en tu propio trabajo).
pt_br: Este módulo também já está totalmente configurado, mas observe a configuração para ver como usamos o **ChannelNumber** obtido do módulo **Metadata** para atribuir nomes a cada imagem (existem várias outras maneiras de criar mapeamentos, mas estes podem servir como um exemplo útil para referência em seu próprio trabalho).

source: *Figure 5: Image mapping using extracted metadata*
es: *Figura 5: Mapeo de imágenes usando metadatos extraídos*
pt_br: *Figura 5: Mapeamento de imagens usando metadados extraídos*

source: Scroll to the bottom of the **NamesAndTypes** module settings to see how the image sets are constructed ‘`Image set matching’` is set to `‘Metadata’`. Each image channel is set to ‘Well → Site’.
es: Desplázate hasta la parte inferior de la configuración del módulo **NamesAndTypes** para ver cómo se construyen los conjuntos de imágenes. ‘`Image set matching’` está configurado en "Metadata". Cada canal de imagen está configurado en ‘Well → Site’.
pt_br: Role até a parte inferior das configurações do módulo **NamesAndTypes** para ver como os conjuntos de imagens são construídos. ‘`Image set matching’` (‘`Correspondência do conjunto de imagens’`) está definida como `‘Metadada’`. Cada canal de imagem está definido como ‘Well → Site’.

source: *Figure 6: Image set matching using extracted metadata*
es: *Figura 6: Conjunto de imágenes relacionadas usando los metadatos extraídos*
pt_br: *Figura 6: Correspondência do conjunto de imagens usando metadados extraídos*

source: For this exercise the **Groups** module is not needed so it is set to ‘No’, this module can be useful when you have more than one plate, or different movies.
es: Para este ejercicio, el módulo **Groups** no es necesario, por lo que está configurado en "No". Este módulo puede ser útil cuando tiene más de una placa o películas diferentes.
pt_br: Para este exercício o módulo **Groups** não é necessário, por isso está definido como ‘Não’. Este módulo pode ser útil quando você tem mais de uma placa ou arquivos de videos diferentes.

source: **For more information and examples on how to configure the Input modules we have created a blog and video tutorial that can be accessed [here](https://carpenter-singh-lab.broadinstitute.org/blog/input-modules-tutorial).**
es: **Para obtener más información y ejemplos sobre cómo configurar los módulos de entrada, hemos creado un blog y un video tutorial al que se puede acceder [aquí](https://carpenter-singh-lab.broadinstitute.org/blog/input-modules-tutorial).**
pt_br: **Para mais informações e exemplos de como configurar os módulos de entrada criamos um blog e um tutorial em vídeo que pode ser acessado [aqui](https://carpenter-singh-lab.broadinstitute.org/blog/input-modules- tutorial).**

source: Docker Desktop
pt_br: Área de Trabalho Docker
