Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/BeginnerSegmentation.po
Languages: es, pt_br

source: Interfacing CellProfiler with other software tools via files and plugins
es: Conectando CellProfiler con otras herramientas de software a través de archivos y complementos (*plugins*)
pt_br: Interface do CellProfiler com outras ferramentas de software por meio de arquivos e plug-ins

source: Beth Cimini <br> Broad Institute of MIT and Harvard, Cambridge, MA.
es: Beth Cimini <br> Broad Institute del MIT y Harvard, Cambridge, MA.
pt_br: Beth Cimini <br> Broad Institute do MIT e Harvard, Cambridge, MA.

source: **Background information**
es: **Información de contexto**
pt_br: **Informações básicas**

source: General background information
es: Información general
pt_br: Informações gerais

source: This exercise is meant to extend and build upon the Beginner Segmentation exercise available from [the CellProfiler tutorials page](tutorials.cellprofiler.org) . Please consult that tutorial for general information on how to configure CellProfiler as well as information about the images. It will be generally assumed you understand the modules covered in that tutorial, including input, object creation, overlays, and saving.
es: Este ejercicio está orientado a ampliar y desarrollar el ejercicio de Segmentación para Principiantes disponible en [la página de tutoriales de CellProfiler](tutorials.cellprofiler.org). Consulta ese tutorial para obtener información general sobre cómo configurar CellProfiler así como también información sobre las imágenes. Generalmente se asumirá que comprendes los módulos cubiertos en ese tutorial, incluidos los módulos de entrada, la creación de objetos, la superposición de objectos sobre imágenes y el guardado.
pt_br: Este exercício tem como objetivo estender e aprofundar o exercício de segmentação para iniciantes disponível na [página de tutoriais do CellProfiler](tutorials.cellprofiler.org) . Consulte esse tutorial para obter informações gerais sobre como configurar o CellProfiler, bem como informações sobre as imagens. Em geral, presumiremos que você entende os módulos abordados nesse tutorial, incluindo entrada, criação de objetos, sobreposições e salvamento.

source: What is this exercise?
es: ¿En qué consiste este ejercicio?
pt_br: O que é esse exercício?

source: There are a number of great software tools available to life scientists wishing to analyze images these days - [forum.image.sc](forum.image.sc) alone has more than 60 open-source tools! Sometimes, though, it helps to have a multi-tool workflow - do one step in Tool A, and then another in Tool B (and then possibly C, D, etc, but hopefully not!). In this tutorial, you'll try 3 different ways of accessing work you did in other tools.
es: Hay una serie de excelentes herramientas de software disponibles para los científicos que desean analizar imágenes en estos días: ¡solo [forum.image.sc](forum.image.sc) tiene más de 60 herramientas de código abierto! A veces, sin embargo, ayuda tener un flujo de trabajo de múltiples herramientas: realizar un paso en la Herramienta A y luego otro en la Herramienta B (y luego posiblemente C, D, etc., ¡pero con suerte no!). En este tutorial, probarás 3 formas diferentes de acceder al trabajo que realizaste con otras herramientas.
pt_br: Atualmente, há uma série de excelentes ferramentas (softwares) disponíveis para cientistas que desejam analisar imagens - só o [forum.image.sc](forum.image.sc) possui mais de 60 ferramentas de código aberto! Às vezes, porém, é interessante ter um fluxo de trabalho com várias ferramentas - execute uma etapa na Ferramenta A e depois outra na Ferramenta B (e possivelmente C, D, etc., mas espero que não!). Neste tutorial, você experimentará três maneiras diferentes de acessar o trabalho realizado em outras ferramentas.

source: Loading masks created by other segmentation tools (in this case, [Cellpose](https://www.cellpose.org/), but the same strategy works for many tools which use this format).
es: Cargando máscaras creadas por otras herramientas de segmentación (en este caso, [Cellpose](https://www.cellpose.org/), pero la misma estrategia funciona para muchas herramientas que usan este formato).
pt_br: Carregando máscaras criadas por outras ferramentas de segmentação (neste caso, [Cellpose](https://www.cellpose.org/), mas a mesma estratégia funciona para muitas ferramentas que utilizam este formato).

source: Accessing [ilastik](https://www.ilastik.org/) to use a trained pixel classification model via CellProfiler's plugins system.
es: Accediendo a [ilastik](https://www.ilastik.org/) para utilizar un modelo de clasificación de píxeles entrenado a través del sistema de complementos de CellProfiler.
pt_br: Acessando [ilastik](https://www.ilastik.org/) para usar um modelo de classificação de pixels treinado através do sistema de plugins do CellProfiler.

source: Running Cellpose in CellProfiler via CellProfiler's plugins system and a Docker container.
es: Ejecutando Cellpose en CellProfiler a través del sistema de complementos de CellProfiler y un contenedor Docker.
pt_br: Executando Cellpose no CellProfiler por meio do sistema de plug-ins do CellProfiler e de um contêiner Docker.

source: Plugins
es: Complementos (*plugins*)

source: While CellProfiler doesn't have as many plugins as, say, Fiji, it does have many for you to try! You can visit plugins.cellprofiler.org to learn more. To quote from that site:
es: Si bien CellProfiler no tiene tantos complementos como, por ejemplo, Fiji, ¡tiene muchos que puedes probar! Puede visitar plugins.cellprofiler.org para obtener más información. Citando ese sitio:
pt_br: Embora o CellProfiler não tenha tantos plug-ins quanto, digamos, Fiji, ele tem muitos para você experimentar! Você pode visitar plugins.cellprofiler.org para saber mais. Para citar esse site:

source: Plugins advance the capabilities of CellProfiler but are not officially supported in the same way as modules. A module may be in CellProfiler-plugins instead of CellProfiler itself because:
es: Los complementos mejoran las capacidades de CellProfiler pero no son mantenidos oficialmente de la misma manera que los módulos. Un módulo puede estar en CellProfiler-plugins en lugar del propio CellProfiler porque:
pt_br: Os plug-ins aprimoram os recursos do CellProfiler, mas não são oficialmente suportados da mesma forma que os módulos. Um módulo pode estar em plugins do CellProfiler em vez do próprio CellProfiler porque:

source: it is under active development
es: está en desarrollo activo
pt_br: está em desenvolvimento ativo

source: it has a niche audience
es: tiene una audiencia de nicho
pt_br: tem um público específico

source: it is not documented to CellProfiler’s standards
es: no está documentado según los estándares de CellProfiler
pt_br: não está documentado de acordo com os padrões do CellProfiler

source: it only works with certain version of CellProfiler
es: sólo funciona con cierta versión de CellProfiler
pt_br: só funciona com determinadas versões do CellProfiler

source: it requires extra libraries or other dependencies we are unable or unwilling to require for CellProfiler
es: requiere bibliotecas adicionales u otras dependencias que no podemos o no queremos requerir para CellProfiler
pt_br: requer bibliotecas extras ou outras dependências que não podemos ou não queremos exigir para o CellProfiler

source: it has been contributed by a community member
es: ha sido aportado por un miembro de la comunidad
pt_br: foi contribuído por um membro da comunidade

source: While that documentation has instructions for [installing plugins](https://plugins.cellprofiler.org/using_plugins.html#installing-plugins-without-dependencies), in step 2 it suggests downloading all of the CellProfiler plugins; this isn't a bad thing to do, but you can download individual plugins from GitHub with the website button below as well or instead.
es: Si bien esa documentación tiene instrucciones para [instalar complementos](https://plugins.cellprofiler.org/using_plugins.html#installing-plugins- without-dependencies), en el Ejercicio 2 sugiere descargar todos los complementos de CellProfiler. Esto no está mal, pero también (o en lugar de ello) puedes descargar complementos individuales desde la web de GitHub usando el botón que se muestra en la figura.
pt_br: Embora essa documentação tenha instruções para [instalar plug-ins](https://plugins.cellprofiler.org/using_plugins.html#installing-plugins-without-dependencies), na etapa 2 ela sugere o download de todos os plug-ins do CellProfiler; isso não é uma coisa ruim de se fazer, mas você também pode baixar plug-ins individuais do GitHub com o botão do site abaixo ou em vez disso.

source: GitHub's "Download Raw Files" button
es: Botón "Descargar archivos sin formato" de GitHub
pt_br: Botão "Baixar arquivos brutos" do GitHub

source: We strongly recommend making a dedicated folder to store your CellProfiler plugins, as loading can be slow if there are a lot of other miscellaneous files around (such if they sit in the Downloads folder, for example).
es: Recomendamos fuertemente crear una carpeta dedicada para almacenar tus complementos de CellProfiler, ya que la carga puede ser lenta si hay muchos otros archivos en la misma ubicación (por ejemplo, si se encuentran en la carpeta Descargas).
pt_br: É altamente recomendável criar uma pasta dedicada para armazenar seus plug-ins do CellProfiler, pois o carregamento pode ser lento se houver muitos outros arquivos diversos por aí (como se eles estiverem na pasta Downloads, por exemplo).

source: In Exercise 3 (and for Windows users, optionally Excercise 2 as well), we want to access software that we either don't want to install locally because it's painful if you're not pretty comfortable in Python (Cellpose) or that we CAN install locally but may not play nicely with other tools' multiprocessing setup (ilastik).
es: En el Ejercicio 3 (y para usuarios de Windows, opcionalmente también en el Ejercicio 2), queremos acceder a software que, o bien no queremos instalar localmente porque es complicado si uno no está cómodo usando Python (Cellpose), o bien que PODEMOS instalar localmente pero probablemente no funcione bien con la configuración de multiprocesamiento de otras herramientas (Ilastik).
pt_br: No Exercício 3 (e para usuários do Windows, opcionalmente também no Exercício 2), queremos acessar softwares que não queremos instalar localmente porque é complicado se você não estiver muito confortável com Python (Cellpose) ou que PODEMOS instalar localmente, mas pode não funcionar bem com a configuração de multiprocessamento de outras ferramentas (ilastik).

source: Computer scientists will often use software **containers** to ship tools or data that are hard to install - [here](https://journals.sagepub.com/doi/10.1177/25152459211017853) is a good introduction and overview for non-computer scientists. You can think of containers as "a pre-configured operating system in a box". Because they come to you pre-configured, installation of any software happens once-and-only-once (by the creator of the container, not by you), and should stay working for long after ie the latest Mac upgrade breaks a certain older software installation. Groups like [biocontainers](https://biocontainers.pro/) have already containerized many of the tools you know and love. There are a number of types of software containers, but one of the most common is called a **Docker** container.
es: Los científicos informáticos suelen utilizar **contenedores** (*containers*) de software para enviar herramientas o datos que son difíciles de instalar. [En este vínculo](https://journals.sagepub.com/doi/10.1177/25152459211017853) puedes encontrar una buena introducción y descripción general de **contenedores** para no expertos. Puedes pensar en los contenedores como "un sistema operativo preconfigurado en una caja". Debido a que vienen preconfigurados, la instalación de cualquier software se realiza una sola vez (por parte del creador del contenedor, no por ti) y debería seguir funcionando por mucho tiempo después de que, por ejemplo, la última actualización de Mac rompa una cierta instalación previa del software. Grupos como [biocontainers](https://biocontainers.pro/) ya han incluido en contenedores muchas de las herramientas que ya conoces y amas. Hay varios tipos de contenedores de software, pero uno de los más son los llamados contenedores **Docker**.
pt_br: Os cientistas da computação costumam usar **contêineres** de software para enviar ferramentas ou dados que são difíceis de instalar - [aqui](https://journals.sagepub.com/doi/10.1177/25152459211017853) é uma boa introdução e visão geral para não - Cientistas da computação. Você pode pensar nos contêineres como “um sistema operacional pré-configurado em uma caixa”. Como eles vêm para você pré-configurados, a instalação de qualquer software acontece uma vez e somente uma vez (pelo criador do contêiner, não por você) e deve continuar funcionando por muito tempo depois, ou seja, se a atualização mais recente do Mac "quebrar" um software antigo, o container deve permanecer funcionando. Grupos como [biocontainers](https://biocontainers.pro/) já conteinerizaram muitas das ferramentas que você conhece e adora. Existem vários tipos de contêineres de software, mas um dos mais comuns é chamado de contêiner **Docker**.

source: Most life scientists aren't aware of or don't use containers, especially because typical usage involves accessing them via your terminal. But Docker doesn't have to mean terminal! There are [containers that spit out interactive websites for you to use](https://github.com/COBA-NIH/docker_gradio_demo), and CellProfiler has plugins that are specifically set up to call other tools that live (and are executed) inside Docker containers.
es: La mayoría de las personas que trabajan en Ciencias de la Vida no conocen los contenedores o no los utilizan, especialmente porque el uso típicamente implica acceder a ellos a través de una terminal. ¡Pero Docker no necesariamente implica usar la terminal! Hay [contenedores que generan sitios web interactivos para que los uses] (https://github.com/COBA-NIH/docker_gradio_demo), y CellProfiler tiene complementos que están específicamente configurados para llamar a otras herramientas que viven (y se ejecutan) dentro de contenedores Docker.
pt_br: A maioria dos cientistas biológicos não conhece ou não usa contêineres, especialmente porque o uso típico envolve acessá-los por meio de seu terminal. Mas Docker não precisa significar terminal! Existem [contêineres que exibem sites interativos para você usar](https://github.com/COBA-NIH/docker_gradio_demo), e o CellProfiler possui plug-ins que são configurados especificamente para chamar outras ferramentas que funcionam (e são executadas) dentro de contêineres Docker.

source: To do this, CellProfiler needs to have the infrastructure for Docker containers up and running, which you can give it by installing a free program called [**Docker Desktop**](https://www.docker.com/products/docker-desktop/). You don't need to make an account to use it, but you probably will need to reboot your computer after installation is complete. Then, whenever you want to use a Docker-calling plugin in CellProfiler, you simply must make sure that Docker Desktop is open and running, CellProfiler will take care of everything else!
es: Para hacer esto, CellProfiler necesita tener la infraestructura para contenedores Docker en funcionamiento, lo cual puedes brindarle instalando un programa gratuito llamado [**Docker Desktop**](https://www.docker.com/products/docker-desktop/). No necesitas crear una cuenta para usarlo, pero probablemente necesitarás reiniciar tu computadora una vez completada la instalación. Luego, siempre que desees utilizar un complemento que llame a Docker en CellProfiler, simplemente debes asegurarse de que Docker Desktop esté abierto y ejecutándose, ¡CellProfiler se encargará de todo lo demás!
pt_br: Para fazer isso, o CellProfiler precisa ter a infraestrutura para contêineres Docker instalada e funcionando, o que você pode fornecer instalando um programa gratuito chamado [**Docker Desktop**](https://www.docker.com/products/docker -Área de Trabalho/). Você não precisa criar uma conta para usá-lo, mas provavelmente precisará reiniciar o computador após a conclusão da instalação. Então, sempre que você quiser usar um plugin de chamada do Docker no CellProfiler, você simplesmente deve ter certeza de que o Docker Desktop está aberto e em execução, o CellProfiler cuidará de todo o resto!

source: The Docker Desktop interface for Mac. Containers can be searched for in the top search bar!
es: La interfaz de Docker Desktop para Mac. ¡Los contenedores se pueden buscar en la barra de búsqueda superior!
pt_br: A interface Docker Desktop para Mac. Os contêineres podem ser pesquisados na barra de pesquisa superior!

source: Anytime you're installing a program that can run other programs, you must of course be careful. Dockers give you access to a huge variety of tools that might otherwise be hard to install (or install together), but exercise caution in only running containers you recognize or trust!
es: Siempre que instales un programa que pueda ejecutar otros programas, por supuesto debes tener cuidado. Los contenedores Docker te brindan acceso a una gran variedad de herramientas que de otro modo podrían ser difíciles de instalar (o de instalar juntas), pero ten cuidado de ejecutar sólo contenedores que reconozcas o en los que confíes.
pt_br: Sempre que você instalar um programa que pode executar outros programas, é claro que você deve ter cuidado. Os Dockers oferecem acesso a uma grande variedade de ferramentas que, de outra forma, seriam difíceis de instalar (ou instalar juntas), mas tenha cuidado, execute apenas contêineres que você reconhece ou confia!

source: **Exercise 1: Importing masks from another segmentation tool**
es: **Ejercicio 1: Importar máscaras desde otra herramienta de segmentación**
pt_br: **Exercício 1: Importando máscaras de outra ferramenta de segmentação**

source: In this exercise, we will be loading in *label masks* (sometimes also called *label matrices*) made in Cellpose. Simply, a label mask is an image in which all the background pixels have a value of 0, all the pixels of object 1 have a value of 1, all the pixels of object 2 have a value of 2, etc. It is a commonly used format by many tools that do object segmentation (though unsuitable for applications where you have overlapping objects). Since many tools (including CellProfiler) can make these masks, CellProfiler has the ability to read them in and automatically detect them as objects.
es: En este ejercicio, cargaremos *máscaras etiquetadas* o *label masks* (a veces también llamadas *matrices de etiquetas*, *label matrices*) generadas en Cellpose. Brevemente, una máscara marca es una imagen en la que todos los píxeles del fondo tienen un valor de 0, todos los píxeles del objeto 1 tienen un valor de 1, todos los píxeles del objeto 2 tener un valor de 2, etc. Es un formato comúnmente utilizado por muchas herramientas que realizan segmentación de objetos (aunque no es adecuado para aplicaciones donde hay objetos superpuestos). Dado que muchas herramientas (incluida CellProfiler) pueden crear estas máscaras, CellProfiler tiene la capacidad de leerlas y detectarlas automáticamente como objetos.
pt_br: Neste exercício, carregaremos *máscaras de rótulo* (às vezes também chamadas de *matrizes de rótulo*) feitas no Cellpose. Simplesmente, uma máscara de rótulo é uma imagem na qual todos os pixels de fundo têm o valor 0, todos os pixels do objeto 1 têm o valor 1, todos os pixels do objeto 2 têm o valor 2, etc. Este formato é usado por muitas ferramentas que fazem segmentação de objetos (embora inadequado para aplicativos onde há objetos sobrepostos). Como muitas ferramentas (incluindo CellProfiler) podem criar essas máscaras, o CellProfiler tem a capacidade de lê-las e detectá-las automaticamente como objetos.

source: We've used Cellpose 2.2.2 to generate nuclear masks from the DNA images and cell masks from the ActinGolgi images.
es: Hemos utilizado Cellpose 2.2.2 para generar máscaras nucleares a partir de las imágenes ADN y máscaras de células a partir de las imágenes ActinGolgi.
pt_br: Usamos o Cellpose 2.2.2 para gerar máscaras nucleares a partir de imagens de DNA e máscaras celulares a partir de imagens de ActinGolgi.

source: Only if you are curious - how did we make these label masks?
es: Solo si tienes curiosidad: ¿cómo hicimos estas máscaras etiquetadas?
pt_br: Só se você estiver curioso – como fizemos essas máscaras de rótulos?

source: Cellpose was installed in a conda environment according to the [official instructions](https://github.com/MouseLand/cellpose?tab=readme-ov-file#installation) for installation with the GUI. The software was started in that conda environment using the command `cellpose`.
es: Cellpose se instaló en un entorno de conda de acuerdo con las [instrucciones oficiales] (https://github.com/MouseLand/cellpose?tab=readme-ov-file#installation) para la instalación con la interfaz gráfica (GUI). El software se inició en ese entorno conda usando el comando "cellpose".
pt_br: Cellpose foi instalado em um ambiente conda de acordo com as [instruções oficiais](https://github.com/MouseLand/cellpose?tab=readme-ov-file#installation) para instalação com GUI. O software foi iniciado nesse ambiente conda usando o comando `cellpose`.

source: Nuclear masks were made by dragging each DNA image into the GUI, selecting the 'nuclei' model with default settings, and then saving them individually as PNG using *Cmd+N* (Mac) *Ctl+N* (Windows). Since there were only 10 images and the hotkeys were available, this was not too time-consuming to do.
es: Las máscaras nucleares se crearon arrastrando cada imagen de ADN a la ventana de Cellpose, seleccionando el modelo 'nuclei' con la configuración predeterminada y luego guardándolas individualmente como PNG usando *Cmd+N* (Mac) *Ctl+N* (Windows). Como solo había 10 imágenes y las teclas de acceso rápido estaban disponibles, esto no llevó demasiado tiempo.
pt_br: As máscaras nucleares foram feitas arrastando cada imagem de DNA para a GUI, selecionando o modelo de 'núcleos' com configurações padrão e salvando-as individualmente como PNG usando *Cmd+N* (Mac) *Ctl+N* (Windows). Como havia apenas 10 imagens e as teclas de atalho estavam disponíveis, isso não consumiu muito tempo.

source: Nuclei segmented in the Cellpose GUI
es: Núcleos segmentados en la interfaz gráfica de Cellpose
pt_br: Núcleos segmentados no GUI do Cellpose

source: Cell masks were made by navigating into the image folder and then running the command below; this requires some knowledge of the [Cellpose command line syntax](https://cellpose.readthedocs.io/en/latest/cli.html) but is much easier for large numbers of images.
es: Las máscaras celulares se crearon navegando a la carpeta de imágenes y luego ejecutando el comando de abajo; esto requiere cierto conocimiento de la [sintaxis de la línea de comandos de Cellpose](https://cellpose.readthedocs.io/en/latest/cli.html) pero es mucho más fácil para procesar una gran cantidad de imágenes.
pt_br: As máscaras celulares foram feitas navegando até a pasta da imagem e executando o comando abaixo; isso requer algum conhecimento da [sintaxe da linha de comando do Cellpose](https://cellpose.readthedocs.io/en/latest/cli.html), mas é muito mais fácil para um grande número de imagens.

source: `python -m cellpose --dir . --img_filter Ch4 --pretrained_model cyto2 --diameter 40 --save_png --verbose`
es: `python -m pose celular --dir . --img_filter Ch4 --pretrained_model cyto2 --diameter 40 --save_png --verbose`
pt_br: `python -m cellpose --dir. --img_filter Ch4 --pretrained_model cyto2 --diâmetro 40 --save_png --verbose`
