Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/FishCelegans.po
Languages: es, pt_br

source: The 4th icon lets you change the view by moving in any direction in the display, by clicking and dragging.
es: El 4º icono te permite cambiar la vista moviéndote en cualquier dirección de la pantalla, haciendo clic y arrastrando.
pt_br: O quarto ícone permite que você altere a visualização movendo-se em qualquer direção na tela, clicando e arrastando.

source: The 5th icon lets you change the view by zooming, by dragging and drawing a box to zoom in on.
es: El 5º icono te permite cambiar la vista haciendo zoom, arrastrando y dibujando un recuadro para ampliar.
pt_br: O quinto ícone permite que você altere a visualização por meio do zoom, arrastando e desenhando uma caixa para aumentar o zoom.

source: Selecting the input image image: ImageAfterMath (from
es: Selección de la imagen de entrada ImageAfterMath (de
pt_br: Selecionando a imagem de entrada: ImageAfterMath (de

source: **ImageAfterMath** module)
es: módulo **ImageAfterMath**)
pt_br: Módulo **ImageAfterMath**)

source: Name the output image: RescaleIntensity
es: Nombre de la imagen de salida: RescaleIntensity
pt_br: Nomeia a imagem de saída: RescaleIntensity (Redimensionar intensidade)

source: Rescaling method: Stretch each image to use the full intensity range
es: Método de reescalado: Estira cada imagen para utilizar todo el rango de intensidad.
pt_br: Método de redimensionamento: Estica cada imagem para usar a faixa de intensidade total

source: (Find the minimum and maximum values within the unmasked part of the image (or the whole image if there is no mask) and rescale every pixel so that the minimum has an intensity of zero and the maximum has an intensity of one).
es: (Busque los valores mínimo y máximo en la parte no enmascarada de la imagen (o en toda la imagen si no hay máscara) y reescalar cada píxel para que el mínimo tenga una intensidad de cero y el máximo una intensidad de uno).
pt_br: (Encontre os valores mínimo e máximo na parte não mascarada da imagem (ou na imagem inteira, se não houver máscara) e redimensione cada pixel para que o mínimo tenha uma intensidade de zero e o máximo tenha uma intensidade de um).

source: The resulting image looks the same, but the pixel value differs between images.
es: La imagen resultante tiene el mismo aspecto, pero el valor de los píxeles difiere de una imagen a otra.
pt_br: A imagem resultante tem a mesma aparência, mas o valor do pixel difere entre as imagens.

source: **Segmentation**
es: **Segmentación**
pt_br: **Segmentação**

source: After removing the worm background on different image sets we can start the segmentation process.
es: Después de eliminar el fondo de gusano en diferentes conjuntos de imágenes podemos iniciar el proceso de segmentación.
pt_br: Depois de remover o fundo de minhoca em diferentes conjuntos de imagens, podemos iniciar o processo de segmentação.

source: **Threshold** module.
es: Módulo **Umbral**.
pt_br: Módulo **Threshold**.

source: Select the input image: ReduceNoise (from **ReduceNoise** module)
es: Seleccione la imagen de entrada: ReduceNoise (del módulo **ReduceNoise**)
pt_br: Selecione a imagem de entrada: ReduceNoise (do módulo **ReduceNoise**)

source: Name the output image: ThresholdSpots
es: Nombre de la imagen de salida: ThresholdSpots
pt_br: Nomeie a imagem de saída: ThresholdSpots

source: Threshold strategy: Global
es: Estrategia de umbral: Global
pt_br: Estratégia de limiar: Global

source: Threshold method: Robust Background (This method can be helpful if
es: Método del umbral: Fondo robusto (Este método puede ser útil si
pt_br: Método de limiar: Fundo robusto (esse método pode ser útil se

source: the majority of the image is background).
es: la mayor parte de la imagen es fondo).
pt_br: a maior parte da imagem é o plano de fundo).

source: Lower outliner fraction: 0.05 (discard this fraction of dim
es: Fracción inferior del perfilador: 0,05 (descartar esta fracción de dim
pt_br: Fração inferior do delineador: 0,05 (descartar essa fração de dim

source: objects).
es: objetos).
pt_br: objetos).

source: Upper outliner fraction: 0.05 (discard this fraction of bright
es: Fracción de contorno superior: 0,05 (descartar esta fracción de brillante
pt_br: Fração de contorno superior: 0,05 (descartar essa fração de brilho

source: Averaging method: Median (This is a good choice if the spot
es: Método de promediado: Mediana (Esta es una buena opción si el punto
pt_br: Método de cálculo da média: Mediana (Essa é uma boa escolha se o ponto

source: density is variable or high).
es: densidad es variable o alta).
pt_br: densidade é variável ou alta).

source: Variance method: Standard deviation
es: Método de la varianza: Desviación típica
pt_br: Método de variância: Desvio padrão

source: # of deviations: 8 (value to multiply the calculated variance.
es: # de desviaciones: 8 (valor para multiplicar la varianza calculada.
pt_br: # Número de desvios: 8 (valor para multiplicar a variação calculada.

source: Adding several deviations raises the threshold well above the average).
es: Si se añaden varias desviaciones, el umbral se eleva pocillo por encima de la media).
pt_br: A adição de vários desvios aumenta o limite bem acima da média).

source: Threshold smoothing scale: 0 (the objects are too small, smoothing
es: Escala de suavizado del umbral: 0 (los objetos son demasiado pequeños, suavizado
pt_br: Escala de suavização do limiar: 0 (os objetos são muito pequenos, a suavização

source: before the threshold results in a larger object)
es: antes del umbral da lugar a un objeto más grande)
pt_br: antes do limite resulta em um objeto maior)

source: Threshold correction factor: 1.2 (adjust the threshold to be more
es: Factor de corrección del umbral: 1,2 (ajuste el umbral para que sea más
pt_br: Fator de correção do limiar: 1,2 (ajuste o limiar para ser mais

source: strict)
es: estricto)
pt_br: rigoroso)

source: Lower and upper bounds on threshold: 0, 1.0 (default)
es: Límites inferior y superior del umbral: 0, 1,0 (por defecto)
pt_br: Limites inferior e superior do limite: 0, 1,0 (padrão)

source: **Watershed** module. This module is used to separate different
es: Módulo **Cuenca**. Este módulo se utiliza para separar diferentes
pt_br: Módulo **Watershed**. Esse módulo é usado para separar diferentes

source: objects in an image, which in this case will segment the nuclei.
es: objetos de una imagen, que en este caso segmentará los núcleos.
pt_br: objetos em uma imagem, que, nesse caso, segmentará os núcleos.

source: Use advanced settings: Yes
es: Utilizar ajustes avanzados: Sí
pt_br: Usar configurações avançadas: Sim

source: Select the input image: ThresholdSpots (from **Threshold** module)
es: Seleccione la imagen de entrada: ThresholdSpots (del módulo **Threshold**)
pt_br: Selecione a imagem de entrada: ThresholdSpots (do módulo **Threshold**)

source: Name the output object: Spots
es: Nombre del objeto de salida: Manchas
pt_br: Nomeie o objeto de saída: Spots

source: Generate from: Distance (we don’t have markers to guide the
es: Generar a partir de: Distancia (no tenemos marcadores para guiar la
pt_br: Gerar a partir de: Distância (não temos marcadores para orientar a

source: segmentation process so the markers and other inputs for the algorithm will be automatically generated based on the footprint size).
es: proceso de segmentación, de modo que los marcadores y otras entradas para el algoritmo se generarán automáticamente en función del tamaño de la huella).
pt_br: processo de segmentação para que os marcadores e outras entradas para o algoritmo sejam gerados automaticamente com base no tamanho da pegada).

source: Footprint: 2 (define the dimensions of the window used to scan the
es: Huella: 2 (define las dimensiones de la ventana utilizada para escanear el
pt_br: Footprint: 2 (define as dimensões da janela usada para digitalizar o

source: input image for local maxima, this will create a local maxima from a binary image that will be at the centers of objects. Large footprint will suppress local maximas that are close together into a single maxima, so two or more objects will be segmented as one. Small footprint can lead to oversegmenation, this means one nuclei segmented as two or more objects.
es: imagen de entrada para máximos locales, esto creará un máximo local a partir de una imagen binaria que estará en los centros de los objetos. Una huella grande suprimirá los máximos locales cercanos en un único máximo, de modo que dos o más objetos se segmentarán como uno solo. Una huella pequeña puede dar lugar a una segmentación excesiva, es decir, un núcleo segmentado como dos o más objetos.
pt_br: imagem de entrada para máximos locais, isso criará um máximo local a partir de uma imagem binária que estará no centro dos objetos. A pegada grande suprimirá os máximos locais que estão próximos em um único máximo, de modo que dois ou mais objetos serão segmentados como um só. A pegada pequena pode levar à supersegmentação, ou seja, um núcleo segmentado como dois ou mais objetos.

source: Downsample: 1 (if the factor is 1, the image is not downsampled,
es: Muestreo descendente: 1 (si el factor es 1, la imagen no se muestrea descendentemente,
pt_br: Downsample: 1 (se o fator for 1, a imagem não será reduzida,

source: the spots are too small, downsampling will remove objects).
es: los puntos son demasiado pequeños, la reducción de la muestra eliminará objetos).
pt_br: os pontos são muito pequenos, a redução da amostragem removerá os objetos).

source: Declump method: Intensity
es: Método Declump: Intensidad
pt_br: Método Declump: Intensidade

source: Reference Image: MaskWorm (from **MaskImage** module)
es: Imagen de referencia: MaskWorm (del módulo **MaskImage**)
pt_br: Imagem de referência: MaskWorm (do módulo **MaskImage**)

source: Segmentation distance transform smoothing factor: 0
es: Factor de suavizado de la transformada de distancia de segmentación: 0
pt_br: Fator de suavização da transformação da distância de segmentação: 0

source: Minimum distance between seeds: 1
es: Distancia mínima entre semillas: 1
pt_br: Distância mínima entre as sementes: 1

source: Minimum absolute internal distance: 0.0
es: Distancia interna mínima absoluta: 0.0
pt_br: Distância interna mínima absoluta: 0.0

source: Pixels from border to exclude: 0 (Default)
es: Píxeles del borde a excluir: 0 (predeterminado)
pt_br: Pixels da borda a serem excluídos: 0 (Padrão)

source: Maximum number of seeds: -1 (Default no limit)
es: Número máximo de semillas: -1 (Por defecto sin límite)
pt_br: Número máximo de sementes: -1 (Padrão sem limite)

source: Structuring element for seed dilation: Octahedron (Size: 1)
es: Elemento estructurante para la dilatación de semillas: Octaedro (Tamaño: 1)
pt_br: Elemento de estruturação para dilatação de sementes: Octaedro (Tamanho: 1)

source: **Measure and export data**
es: **Medición y exportación de datos
pt_br: **Medir e exportar dados**

source: Now that the spots have been segmented, measurements can be made using modules from the **Measurements** category. This study is asking for two particular measurements:
es: Una vez segmentadas las manchas, se pueden realizar mediciones utilizando los módulos de la categoría **Mediciones**. En este estudio se piden dos mediciones en particular:
pt_br: Agora que os pontos foram segmentados, as medições podem ser feitas usando os módulos da categoria **Measurements**. Este estudo está solicitando duas medições específicas:

source: Centroid location (x, y and z),
es: Localización del centroide (x, y y z),
pt_br: Localização do centroide (x, y e z),

source: Integrated intensity and
es: Intensidad integrada y
pt_br: Intensidade integrada e

source: In this case we need the **MeasureObjectIntensity** module to extract this information.
es: En este caso necesitamos el módulo **MeasureObjectIntensity** para extraer esta información.
pt_br: Nesse caso, precisamos do módulo **MeasureObjectIntensity** para extrair essas informações.

source: **Note:** When applying these measurements, be careful to measure the original images, not rescaled or processed images.
es: **Nota:** Al aplicar estas medidas, tenga cuidado de medir las imágenes originales, no las reescaladas o procesadas.
pt_br: **Nota:** Ao aplicar essas medidas, tenha o cuidado de medir as imagens originais, não as imagens redimensionadas ou processadas.

source: **MeasureObjectIntensity** module
es: Módulo **MedirObjetoIntensidad**.
pt_br: Módulo **MeasureObjectIntensity**

source: Select images to measure: fish (original image from
es: Seleccione las imágenes que desea medir: peces (imagen original de
pt_br: Selecione as imagens a serem medidas: peixe (imagem original de

source: **NamesAndTypes** module)
es: módulo **NamesAndTypes**)
pt_br: Módulo **NamesAndTypes**)

source: Select objects to measure: Spots (from **Watershed** module) to
es: Seleccione los objetos a medir: Manchas (del módulo **Cuenca**) a
pt_br: Selecione os objetos a serem medidos: Spots (do módulo **Watershed**) para

source: have all the intensity measurements from the object.
es: tienen todas las mediciones de intensidad del objeto.
pt_br: têm todas as medições de intensidade do objeto.

source: **Note:** The measure modules will provide several features for identified objects and at this point we cannot choose which measurement, so the module will extract all intensity features possible.
es: **Nota:** Los módulos de medida proporcionarán varias características para los objetos identificados y en este punto no podemos elegir qué medida, por lo que el módulo extraerá todas las características de intensidad posibles.
pt_br: **Nota:** Os módulos de medição fornecerão vários recursos para objetos identificados e, nesse momento, não podemos escolher qual medição, portanto, o módulo extrairá todos os recursos de intensidade possíveis.

source: **Creating visuals**
es: **Creación de imágenes
pt_br: **Criação de recursos visuais**

source: Add the **RescaleIntesity** module to your pipeline. This module lets
es: Añade el módulo **RescaleIntesity** a tu pipeline. Este módulo permite
pt_br: Adicione o módulo **RescaleIntesity** ao seu pipeline. Esse módulo permite que

source: you rescale the intensity of the input images by any of several methods. You should use caution when interpreting intensity and texture measurements derived from images that have been rescaled because certain options for this module do not preserve the relative intensities from image to image.
es: puede reescalar la intensidad de las imágenes de entrada por cualquiera de los métodos disponibles. Debe tener cuidado al interpretar las medidas de intensidad y textura derivadas de imágenes que han sido reescaladas porque ciertas opciones de este módulo no conservan las intensidades relativas de imagen a imagen.
pt_br: você redimensiona a intensidade das imagens de entrada por qualquer um dos vários métodos. Você deve ter cuidado ao interpretar medições de intensidade e textura derivadas de imagens que foram redimensionadas, pois determinadas opções desse módulo não preservam as intensidades relativas de imagem para imagem.

source: Selecting the input image image: fish (from **NamesAndTypes**
es: Selección de la imagen de entrada image: fish (from **NamesAndTypes**)
pt_br: Seleção da imagem de entrada imagem: peixe (de **NamesAndTypes**

source: Name the output image: RescaleIntensityFish
es: Nombre de la imagen de salida: RescaleIntensityFish
pt_br: Nomear a imagem de saída: RescaleIntensityFish (Redimensionar intensidade do peixe)

source: Rescaling method: Stretch each image to use the full intensity
es: Método de reescalado: Estirar cada imagen para utilizar toda la intensidad.
pt_br: Método de redimensionamento: Estica cada imagem para usar a intensidade total

source: range (Find the minimum and maximum values within the unmasked part of the image (or the whole image if there is no mask) and rescale every pixel so that the minimum has an intensity of zero and the maximum has an intensity of one).
es: range (Encuentra los valores mínimo y máximo dentro de la parte no enmascarada de la imagen (o toda la imagen si no hay máscara) y reescala cada píxel para que el mínimo tenga una intensidad de cero y el máximo de uno).
pt_br: range (Encontre os valores mínimo e máximo na parte não mascarada da imagem (ou na imagem inteira, se não houver máscara) e redimensione cada pixel para que o mínimo tenha intensidade zero e o máximo tenha intensidade um).

source: **OverlayOutlines** module. This module places outlines of objects
es: Módulo **OverlayOutlines**. Este módulo coloca contornos de objetos
pt_br: Módulo **OverlayOutlines**. Esse módulo coloca contornos de objetos

source: over a desired image. We recommend overlaying onto rescaled images, which will be easier to visualize outside of CellProfiler.
es: sobre la imagen deseada. Recomendamos superponer sobre imágenes reescaladas, que serán más fáciles de visualizar fuera de CellProfiler.
pt_br: sobre uma imagem desejada. Recomendamos a sobreposição em imagens redimensionadas, que serão mais fáceis de visualizar fora do CellProfiler.

source: Display outlines on a blank image: No
es: Mostrar contornos en una imagen en blanco: No
pt_br: Exibir contornos em uma imagem em branco: Não

source: Select image on which to display outlines: RescaleIntensityFish
es: Seleccione la imagen en la que se mostrarán los contornos: RescaleIntensityFish
pt_br: Selecione a imagem na qual os contornos serão exibidos: RescaleIntensityFish (Redimensionar intensidade do peixe)

source: (from **RescaleIntensity** module)
es: (del módulo **RescaleIntensity**)
pt_br: (do módulo **RescaleIntensity**)

source: Outline display mode: Color
es: Modo de visualización del contorno: Color
pt_br: Modo de exibição de contorno: Colorido

source: How to outline: Outer
es: Cómo delinear: Exterior
pt_br: Como fazer o contorno: Externo

source: Select objects to display: Spots (from **Watershed** module)
es: Seleccione los objetos que desea visualizar: Manchas (del módulo **Cuenca**)
pt_br: Selecione os objetos a serem exibidos: Spots (do módulo **Watershed**)

source: Select outline color: Red (Default).
es: Seleccione el color del contorno: Rojo (Predeterminado).
pt_br: Selecione a cor do contorno: Vermelho (padrão).

source: Select the type of image to save: Image
es: Seleccione el tipo de imagen que desea guardar: Imagen
pt_br: Selecione o tipo de imagem a ser salva: Imagem

source: Select the image to save: SpotsOverlay (from **OverlayOutlines**
es: Seleccione la imagen que desea guardar: SpotsOverlay (de **OverlayOutlines**)
pt_br: Selecione a imagem a ser salva: SpotsOverlay (de **OverlayOutlines**

source: Select method for constructing file names: From image filename (use
es: Seleccione el método para construir los nombres de archivo: A partir del nombre del archivo de imagen (utilice
pt_br: Selecione o método de construção de nomes de arquivos: A partir do nome do arquivo de imagem (use

source: this option to avoid reassignment of your images)
es: esta opción para evitar la reasignación de sus imágenes)
pt_br: essa opção para evitar a reatribuição de suas imagens)

source: Select image name for file prefix: fish (select the original image
es: Seleccione el nombre de la imagen para el prefijo del archivo: pescado (seleccione la imagen original
pt_br: Selecione o nome da imagem para o prefixo do arquivo: fish (selecione a imagem original)

source: name from NamesAndTypes module)
es: nombre del módulo NamesAndTypes)
pt_br: name do módulo NamesAndTypes)

source: Append a suffix to the image file name?: No
es: ¿Añadir un sufijo al nombre del archivo de imagen?: No
pt_br: Acrescentar um sufixo ao nome do arquivo de imagem: Não

source: Saved file format: tiff (tiff is a lossless format, but you can
es: Formato de archivo guardado: tiff (tiff es un formato sin pérdidas, pero puede
pt_br: Formato de arquivo salvo: tiff (tiff é um formato sem perdas, mas você pode

source: choose others depending on what you need to do with this images)
es: elija otros en función de lo que necesite hacer con estas imágenes)
pt_br: escolha outros, dependendo do que você precisa fazer com essas imagens)

source: Image bit depth: 8-bit integer (this bit depth is easily read outside
es: Profundidad de bits de la imagen: entero de 8 bits (esta profundidad de bits se lee fácilmente fuera
pt_br: Profundidade de bits da imagem: inteiro de 8 bits (essa profundidade de bits é facilmente lida fora da área de trabalho)

source: Save with lossless compression: Yes
es: Guardar con compresión sin pérdidas: Sí
pt_br: Salvar com compactação sem perdas: Sim

source: Output file location: Default Output Folder (or create a new folder
es: Ubicación del archivo de salida: Carpeta de salida por defecto (o crear una nueva carpeta
pt_br: Local do arquivo de saída: Pasta de saída padrão (ou criar uma nova pasta)

source: just for this images)
es: sólo para estas imágenes)
pt_br: apenas para essas imagens)

source: Overwrite existing files without warning?: No (prevent file
es: ¿Sobrescribir archivos existentes sin previo aviso? No (evita que los archivos
pt_br: Sobrescrever arquivos existentes sem aviso? No (impedir que o arquivo

source: overwritten)
es: sobrescrito)
pt_br: sobrescrito)

source: When to save: Every cycle (Save every image set)
es: Cuándo guardar: Cada ciclo (Guardar cada conjunto de imágenes)
pt_br: Quando salvar: Every cycle (Salvar cada conjunto de imagens)

source: Record the file and path information to the saved image?: No
es: Registrar el archivo y la información de la ruta a la imagen guardada?: No
pt_br: Registre as informações do arquivo e do caminho para a imagem salva? Não

source: Create subfolders in the output folder: No
es: Crear subcarpetas en la carpeta de salida: No
pt_br: Criar subpastas na pasta de saída: Não

source: Select the input objects: Spots (from Watershed module)
es: Seleccione los objetos de entrada: Spots (del módulo Watershed)
pt_br: Selecione os objetos de entrada: Spots (do módulo Watershed)

source: Name the output image: SpotImage
es: Nombre de la imagen de salida: SpotImage
pt_br: Nomeie a imagem de saída: SpotImage

source: Select the color format: Grayscale
es: Seleccione el formato de color: Escala de grises
pt_br: Selecione o formato de cor: Escala de cinza

source: **Export measurements**
es: **Medidas de exportación**
pt_br: **Medidas de exportação**

source: It’s good practice to place all export modules at the end of your pipeline. CellProfiler automatically calculates execution times for each module that was run before the export module. By placing your export modules at the end of your pipeline, you will have access to module execution times for each module in your pipeline. Save the output of the measurement modules using **ExportToSpreadsheet** or **ExportToDatabase**.
es: Es una buena práctica colocar todos los módulos de exportación al final de su pipeline. CellProfiler calcula automáticamente los tiempos de ejecución para cada módulo que fue ejecutado antes del módulo de exportación. Colocando los módulos de exportación al final de su pipeline, tendrá acceso a los tiempos de ejecución de cada módulo en su pipeline. Guarde la salida de los módulos de medición utilizando **ExportToSpreadsheet** o **ExportToDatabase**.
pt_br: É uma boa prática colocar todos os módulos de exportação no final de seu pipeline. O CellProfiler calcula automaticamente os tempos de execução de cada módulo que foi executado antes do módulo de exportação. Ao colocar os módulos de exportação no final do pipeline, você terá acesso aos tempos de execução de cada módulo do pipeline. Salve a saída dos módulos de medição usando **ExportToSpreadsheet** ou **ExportToDatabase**.
