Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/FishCelegans.po
Languages: es, pt_br

source: **ExportToSpreadsheet** module. This module exports measurements into one or more files that can be opened in Excel or other spreadsheet programs. This module will convert the measurements to a comma-, tab-, or other character-delimited text format and save them to the hard drive in one or several files, as requested.
es: Módulo **ExportToSpreadsheet**. Este módulo exporta las mediciones a uno o varios archivos que pueden abrirse en Excel u otros programas de hojas de cálculo. Este módulo convertirá las mediciones a un formato de texto delimitado por comas, tabulaciones u otros caracteres y las guardará en el disco duro en uno o varios archivos, según se solicite.
pt_br: Módulo **ExportToSpreadsheet**. Esse módulo exporta as medições para um ou mais arquivos que podem ser abertos no Excel ou em outros programas de planilha eletrônica. Esse módulo converterá as medições em um formato de texto delimitado por vírgula, tabulação ou outro caractere e as salvará no disco rígido em um ou vários arquivos, conforme solicitado.

source: Select the column delimiter: Comma (“,”)
es: Seleccione el delimitador de columna: Coma (",")
pt_br: Selecione o delimitador de coluna: Vírgula (",")

source: Output file location: Default Output Folder
es: Ubicación del archivo de salida: Carpeta de salida predeterminada
pt_br: Local do arquivo de saída: Pasta de saída padrão

source: Add a prefix to file names: Yes
es: Añadir un prefijo a los nombres de archivo: Sí
pt_br: Adicionar um prefixo aos nomes de arquivos: Sim

source: Filename prefix: FISH
es: Prefijo del archivo: FISH
pt_br: Prefixo do nome do arquivo: FISH

source: Overwrite existing files without warning: No
es: Sobrescribir archivos existentes sin previo aviso: No
pt_br: Substitui arquivos existentes sem aviso: Não

source: Add image metadata columns to your object data file: No
es: Añada columnas de metadatos de imagen a su archivo de datos de objetos: No
pt_br: Adicione colunas de metadados de imagem ao seu arquivo de dados do objeto: Não

source: Add image file and folder names to your object data file: No
es: Añade nombres de archivos de imagen y carpetas a tu archivo de datos de objetos: No
pt_br: Adicione nomes de arquivos de imagem e pastas ao seu arquivo de dados do objeto: Não

source: Representation of Nan/Inf: NaN
es: Representación de Nan/Inf: NaN
pt_br: Representação de Nan/Inf: NaN

source: Select the measurements to export: Yes
es: Seleccione las mediciones que desea exportar: Sí
pt_br: Selecione as medidas a serem exportadas: Sim

source: Press button to select measurements:
es: Pulse el botón para seleccionar las mediciones:
pt_br: Pressione o botão para selecionar as medições:

source: Spots:
es: Puntos:
pt_br: Pontos:

source: Intensity: IntegratedIntensity
es: Intensidad: IntegradoIntensidad
pt_br: Intensidade: IntegratedIntensity

source: Location
es: Ubicación
pt_br: Localização

source: Center: X, Y and Z
es: Centro: X, Y y Z
pt_br: Centro: X, Y e Z

source: Calculate the per-image mean values for object measurements?:No
es: ¿Calcular los valores medios por imagen para las mediciones de objetos?:No
pt_br: Calcular os valores médios por imagem para medições de objetos?

source: Calculate the per-image median values for object measurements?:No
es: ¿Calcular los valores medianos por imagen para las mediciones de objetos?:No
pt_br: Calcular os valores medianos por imagem para medições de objetos?

source: Calculate the per-image standard deviation values for object
es: Calcular los valores de desviación típica por imagen para el objeto
pt_br: Calcule os valores de desvio padrão por imagem para o objeto

source: measurements?:No
es: ¿Medidas?:No
pt_br: medições?:Não

source: Output file location:Default Output Folder\|
es: Ubicación del archivo de salida: Carpeta de salida predeterminada.
pt_br: Local do arquivo de saída:Pasta de saída padrão\|

source: Create a GenePattern GCT file?:No
es: ¿Crear un archivo GenePattern GCT?:No
pt_br: Criar um arquivo GenePattern GCT?:Não

source: Export all measurement types?:No
es: ¿Exportar todos los tipos de medición?:No
pt_br: Exportar todos os tipos de medição?

source: Data to export: Spots
es: Datos a exportar: Manchas
pt_br: Dados a serem exportados: Pontos

source: Use the object name for the file name?: No
es: ¿Utilizar el nombre del objeto para el nombre del archivo?: No
pt_br: Usar o nome do objeto para o nome do arquivo: Não

source: File name: Spots.csv
es: Nombre del fichero: Spots.csv
pt_br: Nome do arquivo: Spots.csv

source: Data to export: Experiment
es: Datos a exportar: Experimento
pt_br: Dados a serem exportados: Experimento

source: File name: Metadata.csv
es: Nombre del archivo: Metadata.csv
pt_br: Nome do arquivo: Metadata.csv

source: **Congratulations!** The spots have been segmented, measured and exported. Now we need to convert the units from the csv file generated in Cell Profiler to microns and create a new table with just the values asked by the Study (X, Y, Z positions and Integrated Intensity for each spot).
es: **Los spots han sido segmentados, medidos y exportados. Ahora tenemos que convertir las unidades del archivo csv generado en Cell Profiler a micras y crear una nueva tabla con sólo los valores que pide el Estudio (posiciones X, Y, Z e Intensidad Integrada para cada spot).
pt_br: **Parabéns! Os pontos foram segmentados, medidos e exportados. Agora precisamos converter as unidades do arquivo csv gerado no Cell Profiler para mícrons e criar uma nova tabela com apenas os valores solicitados pelo estudo (posições X, Y, Z e intensidade integrada para cada ponto).

source: For this purpose we create an interactive colab notebook that will ask you the X, Y and Z values, upload the csv generated by Cell Profiler to finally export a new csv file with the normalized values.
es: Para ello creamos un cuaderno de colab interactivo que te pedirá los valores X, Y y Z, cargará el csv generado por Cell Profiler para finalmente exportar un nuevo fichero csv con los valores normalizados.
pt_br: Para isso, criamos um notebook colab interativo que solicitará os valores X, Y e Z, carregará o csv gerado pelo Cell Profiler e, por fim, exportará um novo arquivo csv com os valores normalizados.

source: **End**
es: **Final**
pt_br: **Fim

source: image2
pt_br: imagem2
