Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/FishCelegans.po
Languages: es, pt_br

source: **Image Analysis Study**
es: **Estudio de análisis de imágenes**
pt_br: **Estudo de análise de imagem**

source: FISH in *C. elegans* (and associated calibration image[s])
es: FISH en *C. elegans* (e imagen(es) de calibración asociada(s))
pt_br: FISH em *C. elegans* (e imagem(ns) de calibração associada(s))

source: **Proposal:**
es: **Propuesta:**
pt_br: **Proposta:**

source: Segment the objects in a fluorescence z-stack image and provide:
es: Segmentar los objetos en una imagen z-stack de fluorescencia y proporcionar:
pt_br: Segmentar os objetos em uma imagem de fluorescência em z-stack e fornecer:

source: Centroid location in microns (um) for each spot: x, y, and z
es: Localización del centroide en micras (um) para cada punto: x, y, y z
pt_br: Localização do centroide em mícrons (um) para cada ponto: x, y e z

source: coordinates listed in separate columns. Labels x, y, and z.
es: coordenadas en columnas separadas. Etiquetas x, y, y z.
pt_br: coordenadas listadas em colunas separadas. Rótulos x, y e z.

source: Integrated Intensity. Label intensity.
es: Intensidad integrada. marca intensity.
pt_br: Intensidade integrada. Intensidade do rótulo.

source: 3D volume image of your segmented image
es: Imagen de volumen en 3D de su imagen segmentada
pt_br: Imagem de volume 3D de sua imagem segmentada

source: Download CSV template
es: Descargar plantilla CSV
pt_br: Download do modelo CSV

source: `here <https://drive.google.com/file/d/10Y3er22JJAVUjtivFoP0fxJRAz9ma057/view?usp=sharing>`__. (LastName_FirstName_ImageName.csv)
es: `aquí <https://drive.google.com/file/d/10Y3er22JJAVUjtivFoP0fxJRAz9ma057/view?usp=sharing>`__. (LastName_FirstName_ImageName.csv)
pt_br: `aqui <https://drive.google.com/file/d/10Y3er22JJAVUjtivFoP0fxJRAz9ma057/view?usp=sharing>`__. (LastName_FirstName_ImageName.csv)

source: **Input:**
es: **Entrada:**
pt_br: **Entrada:**

source: Four different z-stack images that vary in their signal-to-noise ratio and the clustering of their objects of FISH staining in *C. elegans*.
es: Cuatro imágenes z-stack diferentes que varían en su relación señal-ruido y la agrupación de sus objetos de tinción FISH en *C. elegans*.
pt_br: Quatro imagens diferentes em z-stack que variam em sua relação sinal/ruído e no agrupamento de seus objetos de coloração FISH em *C. elegans*.

source: Voxel dimensions: 0.162x0.162x0.200 um
es: Dimensiones de los voxels: 0,162x0,162x0,200 um
pt_br: Dimensões do voxel: 0,162x0,162x0,200 um

source: Calibration file
es: Fichero de calibración
pt_br: Arquivo de calibração

source: Voxel dimensions: 1x1x1 um
es: Dimensiones de los voxels: 1x1x1 um
pt_br: Dimensões do voxel: 1x1x1 um

source: **FishPipeline** - 3m 22s
es: **Línea de producción de pescado** - 3m 22s

source: /Users/mcruz/Documents/Tutorials/ABRFTutorial/Fish/Documentation/NewFishPureCP.cppipe
es: /Usuarios/mcruz/Documents/Tutorials/ABRFTutorial/Fish/Documentation/NewFishPureCP.cppipe

source: **Importing data in CellProfiler**
es: **Importación de datos en CellProfiler**
pt_br: **Importando dados no CellProfiler**

source: Highlight the **Images** module.
es: Seleccione el módulo **Imágenes**.
pt_br: Destaque o módulo **Imagens**.

source: Drag-and-drop the images you will analyze into the Images module
es: Arrastre y suelte las imágenes que va a analizar en el módulo Imágenes
pt_br: Arraste e solte as imagens que você analisará no módulo Images

source: window.
es: ventana.
pt_br: janela.

source: Load the pipeline file (.cppipe). Drag-and-Drop the file or go to File->Import->Pipeline from File…
es: Cargue el archivo pipeline (.cppipe). Arrastre y suelte el archivo o vaya a Archivo->Importar->pipeline desde Archivo...
pt_br: Carregue o arquivo de pipeline (.cppipe). Arraste e solte o arquivo ou vá para File-&gt;Import-&gt;Pipeline from File...

source: Note: The pipeline should populate all information needed, but it’s always a good practice to check if everything is fine.
es: Nota: pipeline debería rellenar toda la información necesaria, pero siempre es una buena práctica comprobar si todo está bien.
pt_br: Observação: o pipeline deve preencher todas as informações necessárias, mas é sempre uma boa prática verificar se está tudo certo.

source: |image4|\ **Tip: Use the question marker button to learn more or if you have any doubt.**
es: |image4|| **Consejo: Utiliza el botón del marcador de interrogación para saber más o si tienes alguna duda.**
pt_br: |Dica: use o botão do marcador de perguntas para saber mais ou se você tiver alguma dúvida.

source: image4
es: imagen4
pt_br: imagem4

source: Highlight the **NameAndType** module.
es: Resalte el módulo **NombreYTipo**.
pt_br: Destaque o módulo **NameAndType**.

source: The **NamesAndTypes** module gives each image a meaningful name by which modules in the analysis pipeline will refer to it. This module will also let you define an image stack that should be processed as a whole 3D volume.
es: El módulo **NamesAndTypes** da a cada imagen un nombre significativo con el que los módulos del análisis pipeline se referirán a ella. Este módulo también le permitirá definir una pila de imágenes que debe procesarse como un volumen 3D completo.
pt_br: O módulo **NamesAndTypes** dá a cada imagem um nome significativo pelo qual os módulos no pipeline de análise se referirão a ela. Esse módulo também permite que você defina uma pilha de imagens que deve ser processada como um volume 3D inteiro.

source: Assign a name to: All images This is the simplest choice and the
es: Asignar un nombre a: Todas las imágenes Esta es la opción más sencilla y la
pt_br: Atribuir um nome a: Todas as imagens Essa é a opção mais simples e a

source: appropriate one because we have only one kind of image.
es: apropiado porque sólo tenemos un tipo de imagen.
pt_br: apropriado porque temos apenas um tipo de imagem.

source: Process as 3D: Yes Selecting “Yes” will load the files as volumes
es: Procesar como 3D: Sí Al seleccionar "Sí" se cargarán los archivos como volúmenes
pt_br: Process as 3D: Yes Selecionando "Yes", os arquivos serão carregados como volumes

source: Populate the fields for “Relative Pixel Spacing”. This calibration
es: Rellene los campos de "Espaciado relativo entre píxeles". Esta calibración
pt_br: Preencha os campos para "Relative Pixel Spacing" (Espaçamento relativo de pixels). Essa calibração

source: affects modules that handle 3D images as volumes.
es: afecta a los módulos que manejan imágenes 3D como volúmenes.
pt_br: afeta os módulos que manipulam imagens 3D como volumes.

source: The relative pixel spacing was provided and is 0.162 um in x and y and 0.200 um in z. To run the calibration file please change the relative pixel spacing to 1x1x1 um.
es: El espaciado relativo entre píxeles es de 0,162 um en x e y y de 0,200 um en z. Para ejecutar el archivo de calibración, cambie el espaciado relativo entre píxeles a 1x1x1 um.
pt_br: O espaçamento relativo de pixels foi fornecido e é de 0,162 um em x e y e 0,200 um em z. Para executar o arquivo de calibração, altere o espaçamento relativo de pixels para 1x1x1 um.

source: Assign the images “variable names” that describe the contents in the
es: Asigne a las imágenes "nombres de variables" que describan el contenido en el
pt_br: Atribua às imagens "nomes de variáveis" que descrevem o conteúdo do

source: image. For example, use the name "FISH" or "Worm" or something else that will remind you what the image is.
es: imagen. Por ejemplo, utilice el nombre "PEZ" o "Gusano" o cualquier otra cosa que le recuerde de qué imagen se trata.
pt_br: imagem. Por exemplo, use o nome "FISH" (PEIXE) ou "Worm" (Minhoca) ou qualquer outra coisa que faça você se lembrar do que é a imagem.

source: Hit the "update" button to populate
es: Pulsa el botón "actualizar" para rellenar
pt_br: Pressione o botão "atualizar" para preencher

source: This pipeline can be divided into three main parts: Image processing, segmentation and measurement/export.
es: Esta pipeline puede dividirse en tres partes principales: Procesamiento de imágenes, segmentación y medición/exportación.
pt_br: Esse pipeline pode ser dividido em três partes principais: Processamento de imagens, segmentação e medição/exportação.

source: **Image processing:**
es: **Tratamiento de imágenes
pt_br: **Processamento de imagens:**

source: The image processing is used to prepare the image for a correct segmentation, in this case we have images with different signal-to-noise ratio (SNR) and an important background signal from the worm. We will first create a mask image of the worm and use this to remove the noise and background from the original image. These modules should normalize the images making the segmentation process work through all image sets.
es: El tratamiento de imágenes se utiliza para preparar la imagen para una segmentación correcta, en este caso tenemos imágenes con diferente relación señal-ruido (SNR) y una importante señal de fondo procedente del gusano. Primero crearemos una imagen máscara del gusano y la utilizaremos para eliminar el ruido y el fondo de la imagen original. Estos módulos deberían normalizar las imágenes haciendo que el proceso de segmentación funcione en todos los conjuntos de imágenes.
pt_br: O processamento da imagem é usado para preparar a imagem para uma segmentação correta. Nesse caso, temos imagens com diferentes relações sinal-ruído (SNR) e um importante sinal de fundo do verme. Primeiro, criaremos uma imagem de máscara do verme e a usaremos para remover o ruído e o fundo da imagem original. Esses módulos devem normalizar as imagens, fazendo com que o processo de segmentação funcione em todos os conjuntos de imagens.

source: Hit the start test mode button.
es: Pulsa el botón de inicio del modo de prueba.
pt_br: Pressione o botão Iniciar modo de teste.

source: **Tip:** You can select different image sets. For that you can go to the main tab, hit the test tab and choose another image set or you can hit the Next Image Set button.
es: **Consejo:** Puedes seleccionar diferentes conjuntos de imágenes. Para ello puedes ir a la pestaña principal, pulsar la pestaña de prueba y elegir otro conjunto de imágenes o puedes pulsar el botón Siguiente conjunto de imágenes.
pt_br: **Dica:** Você pode selecionar diferentes conjuntos de imagens. Para isso, vá até a guia principal, clique na guia teste e escolha outro conjunto de imagens ou clique no botão Next Image Set (Próximo conjunto de imagens).

source: image1
es: imagen1
pt_br: imagem1

source: **GaussianFilter** module: select the input image “fish” (or whatever
es: Módulo **GaussianFilter**: seleccionar la imagen de entrada "pez" (o lo que sea
pt_br: Módulo **GaussianFilter**: selecione a imagem de entrada "fish" (ou qualquer outra imagem)

source: the name you give for your images in **NamesAndTypes** module), name the output image as “GaussianFilter” and a Sigma value of “3” (larger sigmas induce more blurring). This module will blur the image and make the worm/background more evident for the threshold filter.
es: el nombre que le des a tus imágenes en el módulo **NamesAndTypes**), nombra la imagen de salida como "GaussianFilter" y un valor Sigma de "3" (sigmas mayores inducen más desenfoque). Este módulo desenfocará la imagen y hará que el gusano/fondo sea más evidente para el filtro umbral.
pt_br: o nome que você dá às suas imagens no módulo **NamesAndTypes**), nomeie a imagem de saída como "GaussianFilter" e um valor Sigma de "3" (sigmas maiores induzem mais desfoque). Esse módulo desfocará a imagem e tornará o verme/plano de fundo mais evidente para o filtro de limiar.

source: Hit the Step button and a new window will pop up with a resulting image that should look like this. The image can vary depending on the Image set chose.
es: Pulse el botón Paso y aparecerá una nueva ventana con una imagen resultante que debería tener este aspecto. La imagen puede variar dependiendo del conjunto de imágenes elegido.
pt_br: Pressione o botão Step (Etapa) e uma nova janela aparecerá com uma imagem resultante que deve se parecer com esta. A imagem pode variar dependendo do conjunto de imagens escolhido.

source: image3
es: imagen3
pt_br: imagem3

source: In this part of the pipeline we want to identify the worm and not the spots, so we added a Threshold module to segment the worm.
es: En esta parte de pipeline queremos identificar el gusano y no las manchas, por lo que añadimos un módulo Umbral para segmentar el gusano.
pt_br: Nessa parte do pipeline, queremos identificar o worm e não os pontos, por isso adicionamos um módulo Threshold para segmentar o worm.

source: **Threshold** module. This module produces a binary, or black and
es: Módulo **Umbral**. Este módulo produce un valor binario, o negro y
pt_br: Módulo **Threshold**. Esse módulo produz um binário, ou preto e

source: white, image based on a threshold that can be pre-selected or calculated automatically using one of many methods. After the threshold value has been determined, the Threshold module will set pixel intensities below the value to zero (black) and above the value to one (white).
es: blanco, basado en un umbral que puede ser preseleccionado o calculado automáticamente utilizando uno de los muchos métodos. Una vez determinado el valor del umbral, el módulo Umbral ajustará las intensidades de los píxeles por debajo del valor a cero (negro) y por encima del valor a uno (blanco).
pt_br: branco, com base em um limite que pode ser pré-selecionado ou calculado automaticamente usando um dos vários métodos. Depois que o valor do limite for determinado, o módulo Threshold definirá as intensidades de pixel abaixo do valor como zero (preto) e acima do valor como um (branco).

source: Select the input image: GaussianFilter (from **GaussianFilter**
es: Seleccione la imagen de entrada: GaussianFilter (de **GaussianFilter**)
pt_br: Selecione a imagem de entrada: GaussianFilter (de **GaussianFilter**

source: module)
es: módulo)
pt_br: módulo)

source: Name the output image: Threshold
es: Nombre de la imagen de salida: Umbral
pt_br: Nomeie a imagem de saída: Threshold (Limiar)

source: Threshold strategy: Global (We choose a global threshold strategy
es: Estrategia de umbral: Global (Elegimos una estrategia de umbral global
pt_br: Estratégia de limite: Global (Escolhemos uma estratégia de limite global

source: here because the out of worm background is relatively uniform after the gaussian filter).
es: aquí porque el fondo fuera del gusano es relativamente uniforme después del filtro gaussiano).
pt_br: aqui porque o fundo fora do worm é relativamente uniforme após o filtro gaussiano).

source: Threshold method: Minimum-Cross-Entropy (analyze the intensity
es: Método del umbral: Minimum-Cross-Entropy (analizar la intensidad
pt_br: Método de limite: Minimum-Cross-Entropy (analisar a intensidade

source: distribution probability using the image histogram and define foreground and background)
es: probabilidad de distribución mediante el histograma de la imagen y definir el primer plano y el fondo)
pt_br: probabilidade de distribuição usando o histograma da imagem e definindo o primeiro plano e o plano de fundo)

source: Threshold smoothing scale: 0.0 (Smoothing improves the uniformity
es: Escala de suavizado del umbral: 0,0 (El suavizado mejora la uniformidad
pt_br: Escala de suavização do limiar: 0,0 (A suavização melhora a uniformidade

source: of the resulting objects, by removing jagged edges caused by noise in the acquired image, because we used a gaussian filter module before this module, it’s not necessary to smooth the image prior to the threshold).
es: de los objetos resultantes, eliminando los bordes dentados causados por el ruido en la imagen adquirida, ya que utilizamos un módulo de filtro gaussiano antes de este módulo, no es necesario suavizar la imagen antes del umbral).
pt_br: dos objetos resultantes, removendo bordas irregulares causadas por ruído na imagem adquirida, porque usamos um módulo de filtro gaussiano antes desse módulo, não é necessário suavizar a imagem antes do limiar).

source: Threshold correction factor: 1
es: Factor de corrección del umbral: 1
pt_br: Fator de correção do limiar: 1

source: **Tip:** To view pixel intensities in an open image, move your mouse over the image, the pixel intensities will appear in the bottom bar of the display window.
es: **Consejo:** Para ver las intensidades de los píxeles en una imagen abierta, mueva el ratón sobre la imagen, las intensidades de los píxeles aparecerán en la barra inferior de la ventana de visualización.
pt_br: **Dica:** Para visualizar as intensidades de pixel em uma imagem aberta, mova o mouse sobre a imagem, e as intensidades de pixel aparecerão na barra inferior da janela de exibição.

source: 4. **DilateObjects** module. The objective of this first part of the pipeline is to remove the background and the noise on images without removing information, so dilate the object will prevent objects touching the edge of the worm to be removed in the following steps.
es: 4. Módulo **DilateObjects**. El objetivo de esta primera parte del pipeline es eliminar el fondo y el ruido en las imágenes sin eliminar información, por lo que dilatar el objeto evitará que los objetos que toquen el borde del gusano sean eliminados en los siguientes pasos.
pt_br: 4. Módulo **DilateObjects**. O objetivo dessa primeira parte do pipeline é remover o plano de fundo e o ruído das imagens sem remover informações, portanto, dilatar o objeto impedirá que os objetos que tocam a borda do worm sejam removidos nas etapas seguintes.

source: Select the input object: Threshold
es: Seleccione el objeto de entrada: Umbral
pt_br: Selecione o objeto de entrada: Limite

source: Name the output object: DilateImage
es: Nombre del objeto de salida: DilateImage
pt_br: Nomeie o objeto de saída: DilateImage

source: Structuring element: Ball (Size: 3) ( dilate the objects using a ball
es: Elemento estructurador: Pelota (Tamaño: 3) ( dilata los objetos utilizando una pelota
pt_br: Elemento de estruturação: Bola (Tamanho: 3) ( dilatar os objetos usando uma bola

source: shape with size of 3).
es: forma con tamaño de 3).
pt_br: com tamanho de 3).

source: 5. **MaskImage** module. This module will hide the out of worm portions of an image (based on previously identified objects or a binary image) so they are ignored by subsequent mask-respecting modules in the pipeline.
es: 5. Módulo **MaskImage**. Este módulo ocultará las partes de una imagen que no sean gusanos (basándose en objetos previamente identificados o en una imagen binaria) para que sean ignoradas por los módulos posteriores que respeten las máscaras en pipeline.
pt_br: 5. Módulo **MaskImage**. Esse módulo oculta as partes de uma imagem fora do worm (com base em objetos previamente identificados ou em uma imagem binária) para que sejam ignoradas pelos módulos subsequentes que respeitam a máscara no pipeline.

source: Select the input image: fish (from **NamesAndTypes** module)
es: Seleccione la imagen de entrada: pez (del módulo **NamesAndTypes**)
pt_br: Selecione a imagem de entrada: fish (do módulo **NamesAndTypes**)

source: Name the output image: MaskWorm
es: Nombre de la imagen de salida: MaskWorm
pt_br: Nomeie a imagem de saída: MaskWorm

source: Use objects or an image as a mask?: Image
es: ¿Utilizar objetos o una imagen como máscara?: Imagen
pt_br: Usar objetos ou uma imagem como máscara? Imagem

source: Select image for mask: DilateImage (from **DilateImage** module)
es: Selecciona la imagen para la máscara: DilateImage (del módulo **DilateImage**)
pt_br: Selecione a imagem para a máscara: DilateImage (do módulo **DilateImage**)

source: Invert mask?: No (select the worm and not the background)
es: ¿Invertir máscara? No (seleccione el gusano y no el fondo)
pt_br: Inverter máscara? Não (selecione a minhoca e não o plano de fundo)

source: The resulting image looks the same as the original image, but the pixels out the worm has a value of 0.
es: La imagen resultante tiene el mismo aspecto que la imagen original, pero los píxeles fuera del gusano tienen un valor de 0.
pt_br: A imagem resultante tem a mesma aparência da imagem original, mas os pixels fora do worm têm um valor 0.

source: Select images to measure: MaskWorm (from **MaskImage** module)
es: Seleccionar imágenes para medir: MaskWorm (del módulo **MaskImage**)
pt_br: Selecione as imagens a serem medidas: MaskWorm (do módulo **MaskImage**)

source: Measure the intensity only from areas enclosed by objects: No
es: Mida la intensidad sólo de las zonas delimitadas por objetos: No
pt_br: Meça a intensidade somente em áreas cercadas por objetos: Não

source: Calculate custom percentiles: No
es: Calcular percentiles personalizados: No
pt_br: Calcular percentis personalizados: Não

source: Operation: Subtract
es: Operación: Restar
pt_br: Operação: Subtrair

source: Name the output image: ImageAfterMath
es: Nombre de la imagen de salida: ImageAfterMath
pt_br: Nomear a imagem de saída: ImageAfterMath

source: Image or measurement?: Image
es: ¿Imagen o medida?: Imagen
pt_br: Imagem ou medição: Imagem

source: Select the first image: MaskWorm (from **MaskImage** module)
es: Selecciona la primera imagen: MaskWorm (del módulo **MaskImage**)
pt_br: Selecione a primeira imagem: MaskWorm (do módulo **MaskImage**)

source: Multiply the first image by: 1.0
es: Multiplica la primera imagen por 1.0
pt_br: Multiplique a primeira imagem por: 1.0

source: Image or measurement?: Measurement
es: ¿Imagen o medida?: Medida
pt_br: Imagem ou medição?: Medição

source: Category: Intensity (Select a measurement made on the image. The
es: Categoría: Intensidad (Seleccione una medición realizada en la imagen. En
pt_br: Categoria: Intensidade (Selecione uma medida feita na imagem. O

source: value of the measurement is used for the operand for all of the pixels of the other operand’s image)
es: valor de la medida se utiliza para el operando para todos los píxeles de la imagen del otro operando)
pt_br: o valor da medição é usado para o operando para todos os pixels da imagem do outro operando)

source: Measurement: MedianIntensity
es: Medida: MedianIntensity
pt_br: Medição: MedianIntensity

source: Image: MaskWorm (the image you choose in the
es: Imagen: MaskWorm (la imagen que elijas en el botón
pt_br: Imagem: MaskWorm (a imagem que você escolhe na seção

source: **MeasureImageIntensity** module)
es: Módulo **MedirImagenIntensidad**)
pt_br: Módulo **MeasureImageIntensity**)

source: Multiply the second image by: 1.0
es: Multiplica la segunda imagen por 1.0
pt_br: Multiplique a segunda imagem por: 1.0

source: The resulting image shows just the spots without the background of the worm.
es: La imagen resultante muestra sólo las manchas sin el fondo del gusano.
pt_br: A imagem resultante mostra apenas as manchas sem o fundo do verme.

source: **Tip: The image tools on the top toolbar may be helpful to see the details on your image/objects:**
es: **Consejo: Las herramientas de imagen de la barra de herramientas superior pueden ser útiles para ver los detalles de tu imagen/objetos:**
pt_br: **Dica: as ferramentas de imagem na barra de ferramentas superior podem ser úteis para ver os detalhes de sua imagem/objetos:**

source: The 1st icon from the left lets you reset the view back to the original view.
es: El primer icono de la izquierda le permite restablecer la vista original.
pt_br: O primeiro ícone da esquerda permite que você redefina a visualização de volta à visualização original.

source: The 2nd and 3rd icons let you step backwards and forwards through any changes you made to the view.
es: Los iconos 2 y 3 le permiten retroceder y avanzar por los cambios realizados en la vista.
pt_br: O segundo e o terceiro ícones permitem que você retroceda e avance nas alterações feitas na visualização.
