Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/PixelClassification.po
Languages: es, pt_br

source: Pixel-based classification tutorial
es: Tutorial de clasificación basada en píxeles

source: **By Kyle Karhohs, PhD**
es: **Por Kyle Karhohs, Doctorado**

source: (A version of this document containing animated GIFs in maintained online on our [GitHub])
es: (Una versión de este documento que contiene GIF animados se mantiene en línea en nuestro [GitHub])

source: Introducing Ilastik
es: Presentación de Ilastik
pt_br: Apresentando o Ilastik

source: CellProfiler is capable of accurate and reliable segmentation of cells by utilizing a broad collection of classical image processing methods. Peruse the documentation on the [IdentifyPrimaryObjects] module, for example, to get a sense of these, e.g., thresholding, declumping, and watershed. However, despite the many problems CellProfiler can readily solve, certain types of images are particularly challenging. For instance, when the biologically relevant objects are defined more by texture and context than raw intensity many [classical image processing tecnhiques] can be foiled; DIC images of cells are a common biological example.
es: CellProfiler es capaz de realizar una segmentación precisa y confiable de células mediante la utilización de una amplia colección de métodos clásicos de procesamiento de imágenes. Examine la documentación en el módulo [IdentifyPrimaryObjects], por ejemplo, para tener una idea de estos, por ejemplo, umbrales, desagregación y cuenca hidrográfica. Sin embargo, a pesar de los muchos problemas que CellProfiler puede resolver fácilmente, ciertos tipos de imágenes son particularmente desafiantes. Por ejemplo, cuando los objetos biológicamente relevantes se definen más por la textura y el contexto que por la intensidad bruta, muchas [técnicas clásicas de procesamiento de imágenes] pueden frustrarse; Las imágenes DIC de células son un ejemplo biológico común.

source: Thankfully, machine learning, particularly [pixel-based classification] has yielded powerful techniques that can often solve these challenging cases. [ilastik] is an open-source tool built for pixel-based classification, and, when combined with CellProfiler, the range of biology that can be quantified from images is greatly expanded beyond monocultures of monolayers to include increased complexity such as tissues, organoids, or [co-cultures].
es: Afortunadamente, el aprendizaje automático, en particular [la clasificación basada en píxeles], ha generado técnicas poderosas que a menudo pueden resolver estos casos desafiantes. [ilastik] es una herramienta de código abierto creada para la clasificación basada en píxeles y, cuando se combina con CellProfiler, la gama de biología que se puede cuantificar a partir de imágenes se amplía enormemente más allá de los monocultivos de monocapas para incluir una mayor complejidad, como tejidos, organoides, o [co-culturas].

source: Now, let’s take a look at how ilastik can be used together with CellProfiler!
es: Ahora veamos como ilastik puede ser usado junto con CellProfiler.
pt_br: Agora, vamos dar uma olhada em como o ilastik pode ser usado junto com o CellProfiler!

source: I. The DIC conundrum
es: I. El enigma de la CID

source: Consider segmenting DIC images, such as those within the imageset [BBBC030]. The goal will be to identify individual Chinese Hamster Ovary (CHO) cells and the regions they occupy.
es: Considere segmentar imágenes DIC, como las del conjunto de imágenes [BBBC030]. El objetivo será identificar el ovario de hámster chino (CHO) individual células y las regiones que ocupan.

source: A straightforward thresholding of this image yields poor results, because the cells have almost the same pixel intensity values (and sometimes even darker!) as the background. There is therefore no true foreground for these cells based solely upon an intensity histogram. Thresholding renders the CHO cells into moon-like crescents. While these fragments could be useful for simple cell counting, most metrics of morphology will be inaccurate. Now, note that there is a module, EnhanceOrSuppressFeatures, that is specifically capable of transforming DIC images into something that is readily segmented. But let's pretend for a moment we didn't have that option...
es: Una umbralización directa de esta imagen da malos resultados, porque las células tienen casi los mismos valores de intensidad de píxeles (¡y a veces incluso más oscuros!) que el fondo. Por lo tanto, no existe un primer plano real para estas células basado únicamente en un histograma de intensidad. El umbralizado convierte las células CHO en medias lunas. Aunque estos fragmentos podrían ser útiles para el simple recuento de células, la mayoría de las métricas de morfología serán inexactas. Ahora, tenga en cuenta que hay un módulo, EnhanceOrSuppressFeatures, que es específicamente capaz de transformar imágenes DIC en algo que sea fácilmente segmentable. Pero pretendamos por un momento que no tenemos esa opción...
pt_br: Uma limiarização direta dessa imagem produz resultados ruins, porque as células têm quase os mesmos valores de intensidade de pixel (e às vezes até mais escuros!) que o plano de fundo. Portanto, não há um primeiro plano verdadeiro para essas células com base apenas em um histograma de intensidade. A limiarização transforma as células CHO em crescentes semelhantes à lua. Embora esses fragmentos possam ser úteis para a contagem simples de células, a maioria das métricas de morfologia será imprecisa. Observe que há um módulo, EnhanceOrSuppressFeatures, que é especificamente capaz de transformar imagens DIC em algo que possa ser prontamente segmentado. Mas vamos fingir por um momento que não temos essa opção...

source: Start CellProfiler by double-clicking the desktop icon <img src="./TutorialImages/CellProfilerLogo.png" width="35"/>
es: Inicie CellProfiler haciendo doble clic en el icono del escritorio <img src="./TutorialImages/CellProfilerLogo.png" width="35"/>

source: Drag-and-drop a BBBC030 image into the **Images** module.
es: Arrastre y suelte una imagen BBBC030 en el módulo **Imágenes**.
pt_br: Arraste e solte uma imagem do BBBC030 no módulo **Images**.

source: Add the **Threshold** module to the pipeline. Select the image name (which should be 'DNA by default').
es: Añada el módulo **Umbral** al pipeline. Seleccione el nombre de la imagen (que debe ser 'DNA por defecto').
pt_br: Adicione o módulo **Threshold** ao pipeline. Selecione o nome da imagem (que deve ser "DNA por padrão").

source: Run the pipeline and take note of the output.
es: Ejecute la tubería y tome nota de la salida.
pt_br: Execute o pipeline e anote o resultado.

source: II. Pixel-based classification with Ilastik
es: II. Clasificación basada en píxeles con Ilastik

source: ilastik employs pixel-based classification and complements CellProfiler. The CHO cells within the DIC image are obvious to the human eye, because we can discern that each cell is defined by a characteristic combination of light and dark patterns. These same patterns can be detected with the machine-learning algorithms within ilastik.
es: ilastik emplea una clasificación basada en píxeles y complementa a CellProfiler. Las células CHO dentro de la imagen DIC son obvias para el ojo humano, porque podemos discernir que cada célula está definida por una combinación característica de patrones claros y oscuros. Estos mismos patrones pueden ser detectados con los algoritmos de aprendizaje automático de ilastik.
pt_br: O ilastik emprega classificação baseada em pixels e complementa o CellProfiler. As células CHO na imagem DIC são óbvias para o olho humano, porque podemos discernir que cada célula é definida por uma combinação característica de padrões claros e escuros. Esses mesmos padrões podem ser detectados com os algoritmos de aprendizado de máquina do ilastik.

source: The machine-learning implemented by ilastik requires user annotation about what is background and what is a CHO cell before it can automatically make this determination across a set of images. ilastik provides a user interface for labeling, tagging, and identifying the objects of interest within an image. This annotation creates what is referred to in machine learning as a training set.
es: El aprendizaje automático implementado por ilastik requiere una anotación del usuario sobre lo que es fondo y lo que es una célula CHO antes de que pueda hacer automáticamente esta determinación a través de un conjunto de imágenes. ilastik proporciona una interfaz de usuario para etiquetar, etiquetar e identificar los objetos de interés dentro de una imagen. Esta anotación crea lo que en aprendizaje automático se denomina un conjunto de entrenamiento.
pt_br: O aprendizado de máquina implementado pelo ilastik requer anotações do usuário sobre o que é fundo e o que é uma célula CHO antes de poder fazer essa determinação automaticamente em um conjunto de imagens. O ilastik fornece uma interface de usuário para rotular, marcar e identificar os objetos de interesse em uma imagem. Essa anotação cria o que é chamado de conjunto de treinamento no aprendizado de máquina.

source: Annotation with 2 Labels
es: Anotación con 2 etiquetas
pt_br: Anotação com 2 rótulos

source: Open ilastik
es: Abrir ilastik
pt_br: Abrir o ilastik

source: Start a *Pixel Classification* project.
es: Inicie un proyecto de *Clasificación de píxeles*.
pt_br: Inicie um projeto *Pixel Classification*.

source: Load at least several BBBC030 images by drag-and-drop into the **Input Data** window.
es: Cargue al menos varias imágenes BBBC030 arrastrándolas y soltándolas en la ventana **Datos de entrada**.
pt_br: Carregue pelo menos várias imagens BBBC030 arrastando e soltando na janela **Input Data**.

source: Now explore the image within the ilastik gui. Here are some shortcuts that may prove useful are:
es: Ahora explora la imagen dentro de la gui de ilastik. Aquí hay algunos atajos que pueden resultar útiles son:
pt_br: Agora, explore a imagem na interface gráfica do ilastik. Aqui estão alguns atalhos que podem ser úteis:

source: *Ctrl + mouse-wheel* = zoom.
es: *Ctrl + rueda del ratón* = zoom.
pt_br: *Ctrl + roda do mouse* = zoom.

source: The keyboard shortcut *Ctrl-D* will show the grid Ilastik uses to partition the image for processing.
es: El atajo de teclado *Ctrl-D* mostrará la cuadrícula que Ilastik utiliza para dividir la imagen para su procesamiento.
pt_br: O atalho de teclado *Ctrl-D* mostrará a grade que o Ilastik usa para particionar a imagem para processamento.

source: Zoom-in far enough that the grid is no longer visible. This will speed up the *Live Update*.
es: Acerque el zoom lo suficiente como para que la cuadrícula deje de ser visible. Esto acelerará la *actualización en vivo*.
pt_br: Aumente o zoom o suficiente para que a grade não seja mais visível. Isso acelerará a *Live Update*.

source: Begin by labeling pixels for two classes: a background class and a CHO cell class.
es: Comience etiquetando los píxeles para dos clases: una clase de fondo y una clase de célula CHO.
pt_br: Comece rotulando os pixels para duas classes: uma classe de fundo e uma classe de células CHO.

source: Open the **Feature Selection** window and add all features.
es: Abra la ventana **Selección de funciones** y agregue todas las funciones.

source: Open the **Training** window.
es: Abra la ventana **Formación**.
pt_br: Abra a janela **Treinamento**.

source: Click the **+** button of the Training window to add a label. Add two labels named *background* and *CHO*.
es: Haga clic en el botón **+** de la ventana Formación para añadir una etiqueta. Añade dos etiquetas llamadas *background* y *CHO*.
pt_br: Clique no botão **+** da janela Treinamento para adicionar um rótulo. Adicione dois rótulos chamados *background* e *CHO*.

source: Using the paint brush tool, label pixels (one at a time) for each class until you are satisfied with the segmentation.
es: Utilizando la herramienta pincel, etiquete los píxeles (de uno en uno) para cada clase hasta que esté satisfecho con la segmentación.
pt_br: Usando a ferramenta pincel, rotule os pixels (um de cada vez) para cada classe até ficar satisfeito com a segmentação.

source: We recommend creating labels for each class one pixel at a time, rather than by making scribbles, to minimize the chance of [over-fitting], i.e. too much information about any given area can cause classification to do poorly in other slightly-dissimilar areas. To label one pixel at a time, we’ll need to zoom in far enough to resolve the individual pixels in the image. The image below shows how closely we must view individual cells before the pixels of the image become clear.
es: Recomendamos crear etiquetas para cada clase, un píxel a la vez, en lugar de hacer garabatos, para minimizar la posibilidad de [sobreajuste], es decir, demasiada información sobre un área determinada puede hacer que la clasificación no funcione bien en otras áreas ligeramente diferentes. . Para marca un píxel a la vez, necesitaremos acercarnos lo suficiente para resolver los píxeles individuales de la imagen. La siguiente imagen muestra qué tan de cerca debemos ver células individuales antes de que los píxeles de la imagen se aclaren.

source: Using a brush size of 1, we click a single pixel from each class: one within a single CHO cell and the other in the surrounding background. In the next image, the annotation color of the CHO cell is yellow and the annotation color of the background is green. Activating *Live Update* reveals the segmentation looks similar to the results from thresholding. This outcome is promising considering this classification was determined by 1 feature and 1 pixel each for the *CHO* and *background* labels.
es: Utilizando un tamaño de pincel de 1, hacemos clic en un único píxel de cada clase: uno dentro de una única célula CHO y el otro en el fondo circundante. En la siguiente imagen, el color de anotación de la célula CHO es amarillo y el color de anotación del fondo es verde. La activación de *Live Update* revela que la segmentación tiene un aspecto similar a los resultados de la umbralización. Este resultado es prometedor teniendo en cuenta que esta clasificación se determinó con 1 característica y 1 píxel cada uno para las etiquetas *CHO* y *fondo*.
pt_br: Usando um tamanho de pincel de 1, clicamos em um único pixel de cada classe: um dentro de uma única célula CHO e o outro no fundo ao redor. Na próxima imagem, a cor de anotação da célula CHO é amarela e a cor de anotação do plano de fundo é verde. A ativação do *Live Update* revela que a segmentação é semelhante aos resultados da limiarização. Esse resultado é promissor, considerando que essa classificação foi determinada por 1 recurso e 1 pixel cada para os rótulos *CHO* e *background*.

source: Adding more labels, one pixel at a time, we continue to refine the segmentation. Toggling the *Segmentation* and *Uncertainty* views provides real-time feedback that can guide the labeling process. Areas of high uncertainty will be aqua-blue, so annotating those areas will be most beneficial to training the program which pixels belong to which class. You should also view the predicted segmentation, and annotate pixels that are not currently segmented properly.
es: Añadiendo más etiquetas, píxel a píxel, seguimos perfeccionando la segmentación. Alternar las vistas *Segmentación* e *Incertidumbre* proporciona información en tiempo real que puede guiar el proceso de etiquetado. Las áreas de alta incertidumbre serán de color azul aguamarina, por lo que anotar esas áreas será más beneficioso para entrenar al programa sobre qué píxeles pertenecen a cada clase. También debería ver la segmentación prevista y anotar los píxeles que actualmente no están segmentados correctamente.
pt_br: Adicionando mais rótulos, um pixel de cada vez, continuamos a refinar a segmentação. A alternância entre as visualizações *Segmentação* e *Incerteza* fornece feedback em tempo real que pode orientar o processo de rotulagem. As áreas de alta incerteza serão azul-água, portanto, a anotação dessas áreas será mais benéfica para o treinamento do programa sobre quais pixels pertencem a cada classe. Você também deve visualizar a segmentação prevista e anotar os pixels que não estão segmentados corretamente no momento.

source: Continue until it seems that additional labels do not change the results, or a subset of the pixels begin “flipping” between CHO cell and background, or until you've labeled ~20 pixels in your original region. Check and label other cells in the image, as well as in other images, to make sure the diversity in your experiment is represented in the training set.
es: Continúe hasta que parezca que las etiquetas adicionales no cambian los resultados, o un subconjunto de los píxeles empiece a "cambiar" entre la celda CHO y el fondo, o hasta que haya etiquetado ~20 píxeles en su región original. Compruebe y etiquete otras células en la imagen, así como en otras imágenes, para asegurarse de que la diversidad en su experimento está representada en el conjunto de entrenamiento.
pt_br: Continue até que os rótulos adicionais pareçam não alterar os resultados, ou até que um subconjunto de pixels comece a "alternar" entre a célula CHO e o plano de fundo, ou até que você tenha rotulado cerca de 20 pixels em sua região original. Verifique e rotule outras células na imagem, bem como em outras imagens, para garantir que a diversidade em seu experimento esteja representada no conjunto de treinamento.

source: Export the probability maps
es: Exportar los mapas de probabilidad
pt_br: Exportar os mapas de probabilidade

source: When satisfied with the results, export the probability maps.
es: Cuando esté satisfecho con los resultados, exporte los mapas de probabilidad.
pt_br: Quando estiver satisfeito com os resultados, exporte os mapas de probabilidade.

source: Open the **Prediction Export** window.
es: Abra la ventana **Exportación de predicciones**.
pt_br: Abra a janela **Exportação de previsão**.

source: Click the **Choose Export Settings** window.
es: Haga clic en la ventana **Elegir parámetros de exportación**.
pt_br: Clique na janela **Choose Export Settings** (Escolher configurações de exportação).

source: Change **Transpose to Axis Order** to `cyx`.
es: Cambie **Transponer al orden de los ejes** a `cyx`.

source: Change **Format** to `tiff`.
es: Cambie **Formato** a "tiff".

source: Close the export settings dialog box and click the **Export All** button.
es: Cierre el cuadro de diálogo de configuración de la exportación y haga clic en el botón **Exportar todo**.
pt_br: Feche a caixa de diálogo de configurações de exportação e clique no botão **Exportar tudo**.

source: If you did not initially load all the images into ilastik and wish to create predictions for them all now, go to the **Batch Processing** window, select the remaining unpredicted images and hit **Process all files**. This will take a couple of minutes on most computers.
es: Si usted no cargó inicialmente todas las imágenes en ilastik y desea crear predicciones para todas ellas ahora, vaya a la ventana **Procesamiento por Lotes**, seleccione las imágenes restantes no predichas y presione **Procesar todos los archivos**. Esto tomará un par de minutos en la mayoría de las computadoras.
pt_br: Se você não carregou inicialmente todas as imagens no ilastik e deseja criar previsões para todas elas agora, vá para a janela **Processamento em lote**, selecione as imagens não previstas restantes e clique em **Processar todos os arquivos**. Isso levará alguns minutos na maioria dos computadores.

source: Note that you're producing a two channel image (Color Image).
es: Tenga en cuenta que está produciendo una imagen de dos canales (Imagen en color).
pt_br: Observe que você está produzindo uma imagem de dois canais (imagem colorida).

source: III. Segmenting probabilities with CellProfiler
es: III. Segmentación de probabilidades con CellProfiler
pt_br: III. Segmentação de probabilidades com o CellProfiler

source: The probability map images created with ilastik can then be processed by CellProfiler to identify and measure the CHO objects within the DIC images. The probability map images are grayscale images and can be treated as if they were the result of a “stain” for the cells.
es: Las imágenes del mapa de probabilidad creadas con ilastik pueden entonces ser procesadas por CellProfiler para identificar y medir los objetos CHO dentro de las imágenes DIC. Las imágenes del mapa de probabilidad son imágenes en escala de grises y pueden ser tratadas como si fueran el resultado de una "tinción" de las células.
pt_br: As imagens do mapa de probabilidade criadas com o ilastik podem então ser processadas pelo CellProfiler para identificar e medir os objetos CHO nas imagens DIC. As imagens do mapa de probabilidade são imagens em escala de cinza e podem ser tratadas como se fossem o resultado de uma "coloração" para as células.

source: Open CellProfiler.
es: Abra CellProfiler.
pt_br: Abra o CellProfiler.

source: Load the *pixel_based_classification.cpppipe* pipeline file.
es: Carga el archivo *pixel_based_classification.cpppipe*.
pt_br: Carregue o arquivo de pipeline *pixel_based_classification.cpppipe*.

source: Add the exported probability images AND their matching original images to the **Images** module.
es: Añada las imágenes de probabilidad exportadas Y sus imágenes originales correspondientes al módulo **Imágenes**.
pt_br: Adicione as imagens de probabilidade exportadas E suas imagens originais correspondentes ao módulo **Images**.

source: In the **NamesAndTypes** module, setup the .png files as phase and the .tiff files was cho, remember to **Select the image type** as **Color Image** for .tiff files.
es: En el módulo **NamesAndTypes**, configure los archivos .png como fase y los archivos .tiff fue cho, recuerde **Seleccionar el tipo de imagen** como **Imagen en color** para los archivos .tiff.
pt_br: No módulo **NamesAndTypes**, configure os arquivos .png como fase e os arquivos .tiff como cho, lembre-se de **Selecionar o tipo de imagem** como **Imagem colorida** para os arquivos .tiff.

source: In the **ColortoGray** module, convert just one channel (Red or Green) to Gray, you should choose red to gray if your first class in Ilastik was the cell, if your background was the first, convert just the green channel to gray and name as choSegmented.
es: En el módulo **ColortoGray**, convierta solo un canal (Rojo o Verde) a Gris, debe elegir rojo a gris si su primera clase en Ilastik fue la celda, si su fondo fue la primera, convierta solo el canal verde a gris y nombre como choSegmentado.
pt_br: No módulo **ColortoGray**, converta apenas um canal (vermelho ou verde) em cinza; você deve escolher vermelho para cinza se sua primeira classe no Ilastik foi a célula; se seu plano de fundo foi o primeiro, converta apenas o canal verde em cinza e nomeie como choSegmented.

source: Run the pipeline and review the segmentation. How robustly did it perform on different images?
es: Ejecute el proceso y revise la segmentación. ¿Qué solidez ha demostrado en las distintas imágenes?
pt_br: Execute o pipeline e analise a segmentação. Qual foi a robustez do desempenho em diferentes imagens?
