Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/PixelClassification.po
Languages: es, pt_br

source: We have now transformed the patterns and texture of intensity in the DIC image into an image where the intensity reflects the likelihood that a given pixel belongs to a cell. The image below demonstrates how the IdentifyPrimaryObjects module successfully segments all the CHO cells.
es: Ahora hemos transformado los patrones y la textura de intensidad de la imagen DIC en una imagen en la que la intensidad refleja la probabilidad de que un píxel determinado pertenezca a una célula. La siguiente imagen muestra cómo el módulo IdentifyPrimaryObjects segmenta con éxito todas las células CHO.
pt_br: Agora transformamos os padrões e a textura da intensidade na imagem DIC em uma imagem em que a intensidade reflete a probabilidade de um determinado pixel pertencer a uma célula. A imagem abaixo demonstra como o módulo IdentifyPrimaryObjects segmenta com sucesso todas as células CHO.

source: CellProfiler Tutorial: pixel-based classification
pt_br: Tutorial do CellProfiler: classificação baseada em pixels

source: By Kyle Karhohs, PhD
pt_br: Por Kyle Karhohs, PhD

source: (A version of this document containing animated GIFs in maintained online on our `GitHub`_)
pt_br: (Uma versão deste documento contendo GIFs animados é mantida on-line em nosso `GitHub`_)

source: CellProfiler is capable of accurate and reliable segmentation of cells by utilizing a broad collection of classical image processing methods. Peruse the documentation on the `IdentifyPrimaryObjects`_ module, for example, to get a sense of these, e.g., thresholding, declumping, and watershed. However, despite the many problems CellProfiler can readily solve, certain types of images are particularly challenging. For instance, when the biologically relevant objects are defined more by texture and context than raw intensity many `classical image processing techiques`_ can be foiled; DIC images of cells are a common biological example.
pt_br: O CellProfiler é capaz de fazer uma segmentação precisa e confiável das células, utilizando uma ampla coleção de métodos clássicos de processamento de imagens. Examine a documentação do módulo `IdentifyPrimaryObjects`_, por exemplo, para ter uma noção desses métodos, como thresholding, declumping e watershed. Entretanto, apesar dos muitos problemas que o CellProfiler pode resolver prontamente, certos tipos de imagens são particularmente desafiadores. Por exemplo, quando os objetos biologicamente relevantes são definidos mais pela textura e pelo contexto do que pela intensidade bruta, muitas `técnicas clássicas de processamento de imagens`_ podem ser frustradas; as imagens DIC de células são um exemplo biológico comum.

source: Thankfully, machine learning, particularly `pixel-based classification`_ has yielded powerful techniques that can often solve these challenging cases. `ilastik`_ is an open-source tool built for pixel-based classification, and, when combined with CellProfiler, the range of biology that can be quantified from images is greatly expanded beyond monocultures of monolayers to include increased complexity such as tissues, organoids, or `co-cultures`_.
pt_br: Felizmente, o aprendizado de máquina, especialmente a classificação baseada em pixels, produziu técnicas poderosas que muitas vezes podem resolver esses casos desafiadores. O `ilastik`_ é uma ferramenta de código aberto criada para a classificação baseada em pixels e, quando combinada com o CellProfiler, a gama de biologia que pode ser quantificada a partir de imagens é bastante ampliada, indo além das monoculturas de monocamadas para incluir maior complexidade, como tecidos, organoides ou `co-culturas`_.

source: I. DIC conundrum
pt_br: I. O enigma da DIC

source: Consider segmenting DIC images, such as those within the imageset `BBBC030`_. The goal will be to identify individual Chinese Hamster Ovary (CHO) cells and the regions they occupy.
pt_br: Considere a segmentação de imagens DIC, como as do conjunto de imagens `BBBC030`_. O objetivo será identificar células individuais de ovário de hamster chinês (CHO) e as regiões que elas ocupam.

source: II. Pixel-based classification with ilastik
pt_br: II. Classificação baseada em pixels com o ilastik

source: Open the **Feature Selction** window and add all features.
pt_br: Abra a janela **Feature Selction** e adicione todos os recursos.

source: We recommend creating labels for each class one pixel at a time, rather than by making scribbles, to minimize the chance of `over-fitting`_, i.e. too much information about any given area can cause classification to do poorly in other slightly-dissimilar areas. To label one pixel at a time, we’ll need to zoom in far enough to resolve the individual pixels in the image. The image below shows how closely we must view individual cells before the pixels of the image become clear.
pt_br: Recomendamos a criação de rótulos para cada classe, um pixel por vez, em vez de fazer rabiscos, para minimizar a chance de "ajuste excessivo", ou seja, o excesso de informações sobre uma determinada área pode fazer com que a classificação seja ruim em outras áreas ligeiramente diferentes. Para rotular um pixel de cada vez, precisaremos ampliar o suficiente para resolver os pixels individuais na imagem. A imagem abaixo mostra a proximidade com que devemos visualizar as células individuais antes que os pixels da imagem fiquem claros.

source: Change **Transpose to Axis Order** to ``cyx``.
pt_br: Altere **Transpose to Axis Order** para ``cyx``.

source: Change **Format** to ``tiff``.
pt_br: Altere o **Formato** para ``tiff``.
