Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/QualityControl.po
Languages: es, pt_br

source: For measurements that end in a number, like ‘Image_ImageQuality_Correlation_OrigER_10’, the number refers to the ‘Spatial scale for blur measurements’ scale specified. You started by measuring the blur at 4 scales, but you may or may not need all of them based on the rules selected.
es: Para las mediciones que terminan en un número, como 'Image_ImageQuality_Correlation_OrigER_10', el número se refiere a la escala 'Escala espacial para mediciones de desenfoque' especificada. Empezó midiendo el desenfoque en 4 escalas, pero puede o no necesitarlas todas en función de las reglas seleccionadas.
pt_br: Para as medições que terminam em um número, como "Image_ImageQuality_Correlation_OrigER_10", o número se refere à escala "Spatial scale for blur measurements" (Escala espacial para medições de desfoque) especificada. Você começou medindo o desfoque em 4 escalas, mas pode ou não precisar de todas elas com base nas regras selecionadas.

source: Add the ‘FlagImage’ module from the ‘Data Tools’ category.
es: Añada el módulo "FlagImage" de la categoría "Herramientas de datos".

source: Leave the flag category as ‘Metadata’, and the name as ‘QCFlag’
es: Deje la categoría del indicador como "Metadatos" y el nombre como "QCFlag".
pt_br: Deixe a categoria da bandeira como "Metadata" e o nome como "QCFlag

source: If you had created many bins in your classification, you would set this name as something more descriptive, such as ‘QCDebris’, since you’d have a different flag name for each bin in your classifier.
es: Si hubiera creado muchas bandejas en su clasificación, establecería este nombre como algo más descriptivo, como 'QCDebris', ya que tendría un nombre de bandera diferente para cada bandeja en su clasificador.
pt_br: Se você tivesse criado muitos compartimentos em sua classificação, definiria esse nome como algo mais descritivo, como "QCDebris", já que você teria um nome de sinalizador diferente para cada compartimento em seu classificador.

source: Leave the ‘Skip image set if flagged?’ setting at no
es: Deje la opción "¿Omitir imagen si está marcada?
pt_br: Deixe a configuração "Skip image set if flagged?" em não

source: Your classifier probably wasn’t incredibly accurate, so setting this to ‘yes’ might result in throwing out real data while still not excluding all the bad images. Nevertheless, if you had far more images than you felt you needed you *could* set this to yes.
es: Su clasificador probablemente no era increíblemente preciso, por lo que establecerlo en "sí" podría resultar en descartar datos reales sin excluir todas las imágenes malas. No obstante, si tiene muchas más imágenes de las que cree que necesita, *podría* establecer esta opción en "sí".
pt_br: Seu classificador provavelmente não foi incrivelmente preciso, portanto, definir essa opção como "sim" pode resultar na exclusão de dados reais e, ao mesmo tempo, não excluir todas as imagens ruins. No entanto, se você tivesse muito mais imagens do que achava necessário, poderia definir essa opção como "sim".

source: Set ‘Flag is based on’ to ‘Rules’ and provide the path and file information to your rules text file.
es: Establezca "Indicador basado en" en "Reglas" y proporcione la ruta y la información del archivo de texto de sus reglas.
pt_br: Defina "Flag is based on" como "Rules" e forneça o caminho e as informações do arquivo de texto das regras.

source: Set the Class number to whatever class in your rule set represents the bad images- this is 2 if you kept the default bins and dragged bad images to the ‘Negative’ bin.
es: Establezca el número de Clase en la clase que represente a las imágenes defectuosas en su conjunto de reglas - esto es 2 si mantiene los contenedores predeterminados y arrastra las imágenes defectuosas al contenedor "Negativo".
pt_br: Defina o número da classe como qualquer classe em seu conjunto de regras que represente as imagens ruins - esse número será 2 se você mantiver os compartimentos padrão e arrastar as imagens ruins para o compartimento "Negativo".

source: Save your pipeline.
es: Guarde su pipeline.
pt_br: Salve seu pipeline.

source: Image quality control using machine learning
pt_br: Controle de qualidade de imagem usando aprendizado de máquina

source: ***A computer exercise using CellProfiler & CellProfiler Analyst software***
pt_br: ***Um exercício de computador usando o software CellProfiler e CellProfiler Analyst***

source: **Beth Cimini** <br> **Broad Institute of MIT and Harvard, Cambridge, MA**
pt_br: **Beth Cimini** <br> **Broad Institute do MIT e Harvard, Cambridge, MA**

source: High-quality image analysis relies on having high-quality images to analyze; the so-called **‘Garbage in, garbage out’** principle. If your image set is small it is straightforward to curate it and remove images that are not in focus or that contain debris that might disrupt segmentation. In a high content screen containing tens or hundreds of thousands of images, this is essentially impossible.
pt_br: A análise de imagens de alta qualidade depende de imagens de alta qualidade para analisar; o chamado princípio **'Entra lixo, sai lixo'**. Se o seu conjunto de imagens for pequeno, é simples curá-lo e remover imagens que não estejam em foco ou que contenham detritos que possam atrapalhar a segmentação. Em uma tela de alto conteúdo contendo dezenas ou centenas de milhares de imagens, isso é essencialmente impossível.

source: The images in this experiment come from the [Broad Bioimage Benchmark Collection](https://data.broadinstitute.org/bbbc/BBBC022/). They are 240 of 69,120 fields of U2OS cells treated with a panel of 1600 known bioactive compounds and imaged in five channels for a so-called CellPainting assay- see Gustafsdottir et al, 2013 for more information. Given the large size of this experiment, it was necessary to come up with an automated quality control method.
pt_br: As imagens neste experimento vêm da [Broad Bioimage Benchmark Collection](https://data.broadinstitute.org/bbbc/BBBC022/). Eles são 240 dos 69.120 campos de células U2OS tratados com um painel de 1.600 compostos bioativos conhecidos e fotografados em cinco canais para um chamado ensaio CellPainting - consulte Gustafsdottir et al, 2013 para obter mais informações. Dado o grande tamanho deste experimento, foi necessário criar um método automatizado de controle de qualidade.

source: Goals of this exercise:
pt_br: Objetivos deste exercício:

source: Materials necessary for this exercise:
pt_br: Materiais necessários para este exercício:

source: 1. **Start the provided QC pipeline on the BBBC022 dataset**
pt_br: 1. **Inicie o pipeline de CQ fornecido no conjunto de dados BBBC022**

source: Start CellProﬁler by double-clicking the desktop icon: <img src="./TutorialImages/CellProfilerLogo.png" width="40">
pt_br: Inicie o CellProﬁler clicando duas vezes no ícone da área de trabalho: <img src="./TutorialImages/CellProfilerLogo.png" width="40">

source: Drag and drop the ‘BBBC022_QC.cppipe’ file into the ‘Analysis modules’ box. Three modules should appear- two copies of ‘MeasureImageQuality’ and one **ExportToDatabase** module.
pt_br: Arraste e solte o arquivo ‘BBBC022_QC.cppipe’ na caixa ‘Módulos de análise’. Três módulos devem aparecer - duas cópias de ‘MeasureImageQuality’ e um módulo **ExportToDatabase**.

source: 2. **Examine the QC pipeline (~15 minutes)**
pt_br: 2. **Examine o pipeline de CQ (cerca de 15 minutos)**

source: **Metadata**
pt_br: **Metadados**

source: **NamesAndTypes**
pt_br: **NomesETipos**

source: **Groups**
pt_br: **Grupos**

source: **MeasureImageQuality**
pt_br: **Medir a qualidade da imagem**

source: ‘Include the image rescaling value?’, ‘Calculate intensity metrics?’, and ‘Calculate saturation metrics?’ are all set to yes. Open the help <img src="./TutorialImages/Info.png" width="35"> button to read about the measurements exported by each of these options.
pt_br: ‘Incluir o valor de redimensionamento da imagem?’, ‘Calcular métricas de intensidade?’ e ‘Calcular métricas de saturação?’ estão todos definidos como sim. Abra o botão de ajuda <img src="./TutorialImages/Info.png" width="35"> para ler sobre as medidas exportadas por cada uma dessas opções.

source: ‘Calculate blur metrics?’ is set to yes and given multiple spatial scales- 2, 5, 10, and 20 pixels. Open the help <img src="./TutorialImages/Info.png" width="35"> button to read about the different methods used to determine whether an image is in focus.
pt_br: ‘Calcular métricas de desfoque?’ está definido como sim e recebe múltiplas escalas espaciais – 2, 5, 10 e 20 pixels. Abra o botão de ajuda <img src="./TutorialImages/Info.png" width="35"> para ler sobre os diferentes métodos usados para determinar se uma imagem está em foco.

source: In this second image **MeasureImageQuality** module, automatic thresholds are calculated for the ‘OrigHoechst’ and ‘OrigPh_golgi’ images using specific threshold metrics. Read about why by opening the help <img src="./TutorialImages/Info.png" width="35"> button.
pt_br: Neste módulo de segunda imagem **MeasureImageQuality**, limites automáticos são calculados para as imagens ‘OrigHoechst’ e ‘OrigPh_golgi’ usando métricas de limite específicas. Leia sobre o motivo abrindo o botão de ajuda <img src="./TutorialImages/Info.png" width="35">.

source: **ExportToDatabase**
pt_br: **Exportar para banco de dados**

source: This module has 4 main parts, separated by breaks (<img src="./TutorialImages/Inline3.png" width="200">)
pt_br: Este módulo possui 4 partes principais, separadas por quebras (<img src="./TutorialImages/Inline3.png" width="200">)

source: 3. **Open the CellProfiler Analyst workspace and determine reasonable parameter cutoffs (~20 minutes)**
pt_br: 3. **Abra o espaço de trabalho do CellProfiler Analyst e determine limites razoáveis de parâmetros (cerca de 20 minutos)**

source: Once your pipeline has finished, close CellProfiler and start CellProfiler Analyst by double-clicking the icon <img src="./TutorialImages/CPAlogo.png" width="35">.
pt_br: Assim que o pipeline for concluído, feche o CellProfiler e inicie o CellProfiler Analyst clicando duas vezes no ícone <img src="./TutorialImages/CPAlogo.png" width="35">.

source: The top one will open each of these images in a separate window. This is generally easiest if only a small number of images (\<5) are in the gate.
pt_br: O de cima abrirá cada uma dessas imagens em uma janela separada. Geralmente, isso é mais fácil se apenas um pequeno número de imagens (\<5) estiver no portão.

source: 4. **Optional- use the PlateViewer tool to check for other features to gate on (~10 minutes)**
pt_br: 4. **Opcional - use a ferramenta PlateViewer para verificar outros recursos para ativar (cerca de 10 minutos)**

source: 5. **Create filters based on the cutoffs you’ve determined (~10 minutes)**
pt_br: 5. **Crie filtros com base nos limites que você determinou (cerca de 10 minutos)**

source: **Edit the properties file manually (recommended):** <br> This method has the advantage that the filters you create are permanent; they won’t be lost when you close and re-open CPA. It does however require you to edit the properties file, and potentially requires you to troubleshoot what’s wrong with the SQL call if you type it in incorrectly.
pt_br: **Edite o arquivo de propriedades manualmente (recomendado):** <br> Este método tem a vantagem de que os filtros criados são permanentes; eles não serão perdidos quando você fechar e reabrir o CPA. No entanto, exige que você edite o arquivo de propriedades e, potencialmente, exige que você solucione o que há de errado com a chamada SQL se você digitá-la incorretamente.

source: For each of the blur or threshold gates in your Gate Inspector, copy the text followed by the word `OR`; as an example if your first gate was:
pt_br: Para cada uma das portas de desfoque ou limite em seu Gate Inspector, copie o texto seguido da palavra `OR`; por exemplo, se o seu primeiro portão foi:

source: Edit your SQL statement to read:
pt_br: Edite sua instrução SQL para ler:

source: ```**DO NOT hit enter**``` or otherwise add new lines between the different measurments; the statement must be one continuous line in order to work.
pt_br: ```**NÃO pressione enter**``` ou adicione novas linhas entre as diferentes medições; a instrução deve ser uma linha contínua para funcionar.

source: Omit the `OR` after your last gate measurement.
pt_br: Omita o `OR` após a última medição do portão.

source: **Create the filters inside CPA (NOT recommended)**
pt_br: **Crie os filtros dentro do CPA (NÃO recomendado)**

source: 6. **Create classifier rules to distinguish good from bad images (~30 minutes)**
pt_br: 6. **Crie regras de classificação para distinguir imagens boas de imagens ruins (cerca de 30 minutos)**

source: Open the Classifier tool (<img src="./TutorialImages/Inline5.png" width="40">, 2nd on left).
pt_br: Abra a ferramenta Classificador (<img src="./TutorialImages/Inline5.png" width="40">, 2º à esquerda).

source: 7. **Add quality control steps to an analysis pipeline (~15 minutes)**
pt_br: 7. **Adicione etapas de controle de qualidade a um pipeline de análise (cerca de 15 minutos)**

source: Click on the <img src="./TutorialImages/AddModule.png" width="40"> button to open the ‘Add modules’ window
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="40"> para abrir a janela ‘Adicionar módulos’

source: If your rule set contains any rules based on ‘ImageQuality_Threshold’, add two **MeasureImageQuality** modules (from the ‘Measurement’ category) to the very top of your pipeline, otherwise add one.
pt_br: Se o seu conjunto de regras contiver regras baseadas em ‘ImageQuality_Threshold’, adicione dois módulos **MeasureImageQuality** (da categoria ‘Measurement’) no topo do seu pipeline, caso contrário, adicione um.

source: Configure the **MeasureImageQuality** module(s) so that they’ll provide all the measurements specified in your rules file; you can refer to the settings in the QC pipeline and/or the rules file to determine which these are.
pt_br: Configure o(s) módulo(s) **MeasureImageQuality** para que eles forneçam todas as medidas especificadas em seu arquivo de regras; você pode consultar as configurações no pipeline de CQ e/ou no arquivo de regras para determinar quais são.

source: Add the **FlagImage** module from the ‘Data Tools’ category.
pt_br: Adicione o módulo **FlagImage** da categoria ‘Ferramentas de dados’.
