Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/QualityControl.po
Languages: es, pt_br

source: Look at some of the images inside the gate ( you may need to click ‘Show controls’ to adjust the zoom, contrast stretch, etc). Are they in focus, and are they free of bright debris? If they seem all or mostly like they’re high quality, adjust the gate to look at a different/smaller subset or delete it altogether by using the Gate Inspector (‘gate’-> ‘MANAGE GATES’).
es: Observa algunas de las imágenes del interior de la puerta (puede que tengas que hacer clic en "Mostrar controles" para ajustar el zoom, el estiramiento del contraste, etc.). ¿Están enfocadas y no tienen restos brillantes? Si parece que todas o la mayoría son de alta calidad, ajuste la puerta para ver un subconjunto diferente o más pequeño, o elimínelo del todo utilizando el Inspector de Puertas ('puerta'-&gt; 'GESTIÓN DE PUERTAS').
pt_br: Observe algumas das imagens dentro do portal (talvez seja necessário clicar em "Show controls" (Mostrar controles) para ajustar o zoom, o contraste, etc.). Elas estão em foco e não têm detritos brilhantes? Se todas ou a maior parte delas parecerem de alta qualidade, ajuste o gate para ver um subconjunto diferente/menor ou exclua-o completamente usando o Gate Inspector ('gate'-&gt; 'MANAGE GATES').

source: **Optional- use the PlateViewer tool to check for other features to gate on (~10 minutes)**
es: **Opcional: utilice la herramienta PlateViewer para comprobar si hay otras funciones que se puedan activar (~10 minutos)**.

source: If you want to see if you can find additional features that might distinguish good images from bad images, feel free to explore the feature set more thoroughly.
es: Si quieres ver si puedes encontrar características adicionales que puedan distinguir las imágenes buenas de las malas, no dudes en explorar el conjunto de características más a fondo.
pt_br: Se você quiser ver se consegue encontrar recursos adicionais que possam distinguir imagens boas de imagens ruins, fique à vontade para explorar o conjunto de recursos mais detalhadamente.

source: The PlateViewer tool and either choose a few ImageQuality measurements at random or just use the arrow keys to scroll up and down through the measurements.
es: La herramienta PlateViewer y elegir algunas mediciones ImageQuality al azar o simplemente utilizar las teclas de flecha para desplazarse hacia arriba y hacia abajo a través de las mediciones.
pt_br: A ferramenta PlateViewer e escolha algumas medições do ImageQuality aleatoriamente ou use as teclas de seta para percorrer as medições para cima e para baixo.

source: A good candidate measurement will be relatively constant within most of the wells but have a small number of outliers (Fig 2).
es: Una buena medición candidata será relativamente constante en la mayoría de los pocillos, pero tendrá un pequeño número de valores atípicos (Fig. 2).
pt_br: Uma boa medição candidata será relativamente constante na maioria dos poços, mas terá um pequeno número de valores discrepantes (Fig. 2).

source: Once you have a good candidate, double click on an outlier well to open the images from that well. If one or both seem very aberrant, you may wish to look at this measurement further.
es: Una vez que tenga un buen candidato, haga doble clic en un valor atípico pocillo para abrir las imágenes de ese pocillo. Si una o ambas parecen muy aberrantes, tal vez desee examinar más a fondo esta medición.
pt_br: Quando você tiver um bom candidato, clique duas vezes em um poço com aberrações para abrir as imagens desse poço. Se um ou ambos parecerem muito aberrantes, talvez você queira examinar melhor essa medição.

source: *Figure 2: Using the PlateViewer tool to find features that may be good markers of poor quality images.*
es: *Figura 2: Uso de la herramienta PlateViewer para encontrar rasgos que pueden ser buenos marcadores de imágenes de mala calidad.*
pt_br: *Figura 2: Uso da ferramenta PlateViewer para encontrar recursos que podem ser bons marcadores de imagens de baixa qualidade.

source: Once you have a measurement you'd like to gate based on, open that Histogram or the Scatter Plot tools and graph all the cells based on that (if you're using the Scatter Plot tool, you may wish to graph your chosen feature on the Y-axis vs ImageNumber on the X-axis as in the Workspace plots, but feel free to play around). If you find a gate that seems logical to make, proceed as in Step 3.
es: Una vez que tenga una medida en la que quiera basar la puerta, abra el Histograma o las herramientas de Gráfico de Dispersión y grafique todas las celdas basándose en ella (si está utilizando la herramienta de Gráfico de Dispersión, puede que desee graficar la característica elegida en el eje Y frente a ImageNumber en el eje X como en los gráficos de Espacio de Trabajo, pero siéntase libre de jugar). Si encuentra una puerta que le parezca lógica, proceda como en el Paso 3.
pt_br: Assim que tiver uma medida na qual gostaria de se basear, abra as ferramentas Histograma ou Gráfico de dispersão e faça o gráfico de todas as células com base nela (se estiver usando a ferramenta Gráfico de dispersão, talvez queira fazer o gráfico do recurso escolhido no eixo Y versus ImageNumber no eixo X, como nos gráficos do espaço de trabalho, mas fique à vontade para brincar). Se você encontrar uma porta que pareça lógica, proceda como na Etapa 3.

source: **Create filters based on the cutoffs you’ve determined (~10 minutes)**
es: **Crea filtros en función de los límites que hayas determinado (~10 minutos)**.

source: Now that we've created gates around our poor quality images, we need to convert them into filters so that we can access them in the Classifier tool. This process will be unnecessary in later versions of CellProfiler Analyst, but knowing how to manipulate the properties file is a worthwhile skill.
es: Ahora que hemos creado puertas alrededor de nuestras imágenes de baja calidad, necesitamos convertirlas en filtros para poder acceder a ellas en la herramienta Clasificador. Este proceso será innecesario en versiones posteriores de CellProfiler Analyst, pero saber cómo manipular el archivo de propiedades es una habilidad que vale la pena.
pt_br: Agora que criamos portas em torno de nossas imagens de baixa qualidade, precisamos convertê-las em filtros para que possamos acessá-las na ferramenta Classifier. Esse processo será desnecessário em versões posteriores do CellProfiler Analyst, mas saber como manipular o arquivo de propriedades é uma habilidade que vale a pena.

source: When you feel like you’ve examined enough graphs, it’s time to create filters based on the gates you’ve determined contain bad images. There are two ways to do this:
es: Cuando creas que has examinado suficientes gráficos, es el momento de crear filtros basados en las puertas que has determinado que contienen malas imágenes. Hay dos formas de hacerlo:
pt_br: Quando você achar que já examinou gráficos suficientes, é hora de criar filtros com base nos portões que você determinou que contêm imagens ruins. Há duas maneiras de fazer isso:

source: **Edit the properties file manually (recommended):**
es: **Editar manualmente el archivo de propiedades (recomendado):**

source: This method has the advantage that the filters you create are permanent; they won’t be lost when you close and re-open CPA. It does however require you to edit the properties file, and potentially requires you to troubleshoot what’s wrong with the SQL call if you type it in incorrectly.
es: Este método tiene la ventaja de que los filtros que cree son permanentes; no se perderán cuando cierre y vuelva a abrir CPA. Sin embargo requiere que usted edite el archivo de propiedades, y potencialmente requiere que usted solucione el problema de la llamada SQL si la escribe incorrectamente.

source: From whatever graph you happen to have open, open the Gate Inspector by calling ‘gate’-> ’MANAGE GATES’.
es: Desde cualquier gráfico que tengas abierto, abre el Inspector de Puertas llamando a 'puerta'-&gt; 'GESTIONAR PUERTAS'.
pt_br: Em qualquer gráfico que você tenha aberto, abra o Gate Inspector chamando 'gate'-&gt; 'MANAGE GATES'.

source: Open the properties file in a text editor.
es: Abra el archivo de propiedades en un editor de texto.
pt_br: Abra o arquivo de propriedades em um editor de texto.

source: In the Image Filters section, create a new line and begin it with
es: En la sección Filtros de imagen, cree una nueva línea y comience con
pt_br: Na seção Image Filters (Filtros de imagem), crie uma nova linha e inicie-a com

source: For each of the blur or threshold gates in your Gate Inspector, copy the text followed by the word OR; as an example if your first gate was:
es: Para cada una de las puertas de desenfoque o umbral en su Inspector de Puertas, copie el texto seguido de la palabra OR; como ejemplo si su primera puerta fuera:

source: Edit your SQL statement to read
es: Edite su sentencia SQL para que diga

source: DO NOT hit enter or otherwise add new lines between the different measurments; the statement must be one continuous line in order to work.
es: NO pulse Intro ni añada nuevas líneas entre las diferentes mediciones; la declaración debe ser una línea continua para que funcione.

source: Omit the ‘OR’ after your last gate measurement.
es: Omita el "O" después de la última medida de la puerta.

source: Repeat for the saturated gates, again omitting the last OR, following the statement
es: Repetir para las puertas saturadas, omitiendo de nuevo la última OR, siguiendo la declaración
pt_br: Repita o procedimento para as portas saturadas, omitindo novamente o último OR, seguindo a instrução

source: Save and close the properties file, then re-open CPA.
es: Guarde y cierre el archivo de propiedades y, a continuación, vuelva a abrir la CPA.
pt_br: Salve e feche o arquivo de propriedades e, em seguida, abra novamente o CPA.

source: **Create the filters inside CPA (not recommended)**
es: **Crear los filtros dentro de CPA (no recomendado)**

source: This method does not require you to manually edit the properties file, but when filtering based on multiple features it takes longer to set up, cannot be edited, and would need to be repeated every time you closed and re-opened CellProfiler Analyst. It is therefore not recommended for use in this tutorial, but is presented in case you cannot or will not edit the properties file.
es: Este método no requiere que usted edite manualmente el archivo de propiedades, pero cuando se filtra en base a múltiples características toma más tiempo configurarlo, no puede ser editado, y necesitaría ser repetido cada vez que cierre y vuelva a abrir CellProfiler Analyst. Por lo tanto, no se recomienda su uso en este tutorial, pero se presenta en caso de que no pueda o no quiera editar el archivo de propiedades.
pt_br: Esse método não exige que você edite manualmente o arquivo de propriedades, mas, ao filtrar com base em vários recursos, leva mais tempo para ser configurado, não pode ser editado e precisaria ser repetido sempre que você fechasse e reabrisse o CellProfiler Analyst. Portanto, não é recomendado para uso neste tutorial, mas é apresentado caso você não possa ou não queira editar o arquivo de propriedades.

source: Copy the text of the relevant gates into a text editor so that you can access it later.
es: Copie el texto de las puertas correspondientes en un editor de texto para poder acceder a él más tarde.
pt_br: Copie o texto das portas relevantes em um editor de texto para poder acessá-lo posteriormente.

source: Determine which is the important cutoff for each gate (ie for a gate where values are too high, it’s the minimum value, for gates on values that are too low it’s the maximum value)
es: Determinar cuál es el corte importante para cada puerta (es decir, para una puerta en la que los valores son demasiado altos, es el valor mínimo, para las puertas en los valores que son demasiado bajos es el valor máximo).
pt_br: Determinar qual é o ponto de corte importante para cada porta (ou seja, para uma porta em que os valores são muito altos, é o valor mínimo; para portas com valores muito baixos, é o valor máximo)

source: Open the filter creation dialog by selecting ‘filter’->’CREATE NEW FILTER’
es: Abra el cuadro de diálogo de creación de filtros seleccionando "filtro"-&gt;"CREAR NUEVO FILTRO".
pt_br: Abra a caixa de diálogo de criação de filtro selecionando 'filter'-&gt;'CREATE NEW FILTER'

source: Name your filter Blurry
es: Nombre su filtro Borroso
pt_br: Dê um nome ao seu filtro Blurry

source: Enter each important cutoff from the blur or threshold gates, selecting ‘Add column’ after each and changing the separator statement to OR
es: Introduzca cada corte importante de las puertas de desenfoque o umbral, seleccionando "Añadir columna" después de cada uno y cambiando la declaración separadora a OR
pt_br: Insira cada corte importante das portas de desfoque ou limiar, selecionando "Add column" (Adicionar coluna) após cada um e alterando a instrução de separação para OR

source: Create a filter named Saturated containing the important cutoffs from the saturation gates
es: Crea un filtro llamado Saturated que contenga los cortes importantes de las compuertas de saturación
pt_br: Crie um filtro chamado Saturated (Saturado) contendo os cortes importantes das portas de saturação

source: *Figure 3: Creating filters inside CPA*
es: *Figura 3: Creación de filtros dentro de CPA*.
pt_br: *Figura 3: Criando filtros dentro da CPA*

source: **Create classifier rules to distinguish good from bad images (~30 minutes)**
es: **Crear reglas de clasificación para distinguir las imágenes buenas de las malas (~30 minutos)**.

source: Creating gates based on the 12 measurements we graphed has helped us identify some low quality images so far, but we are not utilizing the rest of our measurements and we can't be certain we've found them all. By creating a machine learning classifier we can find features that correlate well with bad images in our experiment and increase our likelihood of identifying additional low quality images.
es: La creación de puertas basadas en las 12 mediciones que graficamos nos ha ayudado a identificar algunas imágenes de baja calidad hasta ahora, pero no estamos utilizando el resto de nuestras mediciones y no podemos estar seguros de haberlas encontrado todas. Mediante la creación de un clasificador de aprendizaje automático podemos encontrar características que se correlacionan pocillo con malas imágenes en nuestro experimento y aumentar nuestra probabilidad de identificar imágenes de baja calidad adicionales.
pt_br: A criação de gates com base nas 12 medições que representamos graficamente nos ajudou a identificar algumas imagens de baixa qualidade até agora, mas não estamos utilizando o restante de nossas medições e não podemos ter certeza de que encontramos todas elas. Ao criar um classificador de aprendizado de máquina, podemos encontrar recursos que se correlacionam bem com imagens ruins em nosso experimento e aumentar nossa probabilidade de identificar outras imagens de baixa qualidade.

source: Open the Classifier tool (|Inline5|, 2\ :sup:`nd` on left).
es: Abra la herramienta Clasificador (|Inline5|, 2\ :sup:`nd` a la izquierda).

source: Inline5
es: En línea5

source: Fetch 50 random images from ‘experiment’, then 25 each from ‘Blurry’ and ‘Saturated’
es: Obtén 50 imágenes aleatorias de "experimento", 25 de "Borrosa" y 25 de "Saturada".
pt_br: Obtenha 50 imagens aleatórias de 'experiment', depois 25 de 'Blurry' e 'Saturated'

source: Create a good classifier by dragging images to the positive and negative bins and training with the Fast Gentle Boosting classifier. If needed feel free to refer to the Translocation tutorial instructions for reminders of how to fetch more images, check the confusion matrix of your classifier, etc.
es: Cree un buen clasificador arrastrando las imágenes a los bines positivo y negativo y entrenando con el clasificador Fast Gentle Boosting. Si es necesario, no dude en consultar las instrucciones del tutorial Translocation para recordar cómo obtener más imágenes, comprobar la matriz de confusión de su clasificador, etc.
pt_br: Crie um bom classificador arrastando as imagens para os compartimentos positivos e negativos e treinando com o classificador Fast Gentle Boosting. Se necessário, consulte as instruções do tutorial Translocation para obter lembretes sobre como obter mais imagens, verificar a matriz de confusão do seu classificador etc.

source: In a larger experiment, you might decide to add more bins (for images that are out of focus, have debris, contain the well edge, etc), but stick to two bins for this experiment.
es: En un experimento de mayor envergadura, es posible que decida añadir más contenedores (para imágenes desenfocadas, con restos, que contengan el borde pocillo, etc.), pero limítese a dos contenedores para este experimento.
pt_br: Em um experimento maior, você pode decidir adicionar mais compartimentos (para imagens fora de foco, com detritos, com a borda do poço, etc.), mas mantenha dois compartimentos para este experimento.

source: Don’t only fetch additional images from your filtered sets, make sure to pull some from ‘Random’ as well, since your gates may not contain every bad image in the experiment and since you want a robust set of good-quality images for your positive bin.
es: No sólo obtenga imágenes adicionales de sus conjuntos filtrados, asegúrese de obtener algunas de 'Random' como pocillo, ya que sus puertas pueden no contener todas las imágenes malas del experimento y quiere un conjunto robusto de imágenes de buena calidad para su contenedor positivo.
pt_br: Não busque imagens adicionais apenas dos conjuntos filtrados, certifique-se de extrair algumas do "Random" também, pois seus gates podem não conter todas as imagens ruins do experimento e você deseja um conjunto robusto de imagens de boa qualidade para seu compartimento positivo.

source: You will likely have to use more than 5 rules to get good classification- try setting this number to 25
es: Es probable que tenga que utilizar más de 5 reglas para obtener una buena clasificación: pruebe a fijar este número en 25.
pt_br: Você provavelmente terá que usar mais de 5 regras para obter uma boa classificação - tente definir esse número como 25

source: When you’re happy with your classifier (this is a small experiment, so perfect classification will not be possible, but aim for >60% accuracy in each bin at least), examine the rules created by using ‘Advanced’->’Edit rules…’.
es: Cuando esté satisfecho con su clasificador (se trata de un pequeño experimento, por lo que no será posible una clasificación perfecta, pero intente obtener una precisión &gt;60% en cada casilla como mínimo), examine las reglas creadas mediante 'Avanzado'-&gt;'Editar reglas...'.
pt_br: Quando estiver satisfeito com o classificador (este é um experimento pequeno, portanto, não será possível obter uma classificação perfeita, mas busque uma precisão &gt;60% em cada compartimento, pelo menos), examine as regras criadas usando "Advanced"-&gt;"Edit rules...".

source: Remove any rules that DO NOT have to do with ImageQuality (like ‘GroupIndex, etc), then copy the remainder Into a text editor and save as a ‘.txt’ file. Keep the text file open for now.
es: Elimine cualquier regla que NO tenga que ver con ImageQuality (como 'GroupIndex, etc), luego copie el resto en un editor de texto y guárdelo como un archivo '.txt'. Mantenga el archivo de texto abierto por ahora.
pt_br: Remova todas as regras que NÃO tenham a ver com ImageQuality (como 'GroupIndex, etc.) e, em seguida, copie o restante em um editor de texto e salve como um arquivo '.txt'. Mantenha o arquivo de texto aberto por enquanto.

source: Save your training set for future reference if desired, then close CellProfiler Analyst.
es: Guarde su conjunto de entrenamiento para futuras referencias si lo desea, luego cierre CellProfiler Analyst.
pt_br: Salve seu conjunto de treinamento para referência futura, se desejar, e feche o CellProfiler Analyst.

source: **Add quality control steps to an analysis pipeline(~15 minutes)**
es: **Añadir pasos de control de calidad a un análisis pipeline(~15 minutos)**

source: If you have time, you can add the list of rules you identified in your machine learning classifier to the CellProfiler pipeline that corresponds to this data set. This can be valuable to do in processing your own large datasets, especially if time or computational power is at a premium.
es: Si tiene tiempo, puede añadir la lista de reglas que identificó en su clasificador de aprendizaje automático al CellProfiler pipeline que corresponde a este conjunto de datos. Esto puede ser valioso a la hora de procesar sus propios conjuntos de datos de gran tamaño, especialmente si el tiempo o la potencia de cálculo son escasos.
pt_br: Se tiver tempo, você pode adicionar a lista de regras identificadas no classificador de aprendizado de máquina ao pipeline do CellProfiler que corresponde a esse conjunto de dados. Isso pode ser útil no processamento de seus próprios conjuntos de dados grandes, especialmente se o tempo ou a capacidade de computação forem escassos.

source: Reopen CellProfiler, then open the BBBC022_Analysis pipeline (provided or available as part of the "AdvancedSegmentation" tutorial).
es: Vuelva a abrir CellProfiler, luego abra el BBBC022_Analysis pipeline (proporcionado o disponible como parte del tutorial "AdvancedSegmentation").
pt_br: Reabra o CellProfiler e, em seguida, abra o pipeline BBBC022_Analysis (fornecido ou disponível como parte do tutorial "AdvancedSegmentation").

source: Reopen the BBBC022_QC pipeline for reference, either in a separate CellProfiler window or in a text editor.
es: Vuelva a abrir el BBBC022_QC pipeline como referencia, ya sea en una ventana separada de CellProfiler o en un editor de texto.
pt_br: Reabra o pipeline BBBC022_QC para referência, em uma janela separada do CellProfiler ou em um editor de texto.

source: Click on the |Inline6| button to open the ‘Add modules’ window
es: Haga clic en el botón |Inline6| para abrir la ventana "Añadir módulos".

source: Inline6
es: En línea6

source: If your rule set contains any rules based on ‘ImageQuality_Threshold’, add two ‘MeasureImageQuality’ modules (from the ‘Measurement’ category) to the very top of your pipeline, otherwise add one.
es: Si su conjunto de reglas contiene alguna regla basada en 'ImageQuality_Threshold', añada dos módulos 'MeasureImageQuality' (de la categoría 'Measurement') en la parte superior de su pipeline, de lo contrario añada uno.

source: Configure the ‘MeasureImageQuality’ module(s) so that they’ll provide all the measurements specified in your rules file; you can refer to the settings in the QC pipeline and/or the rules file to determine which these are.
es: Configure los módulos "MeasureImageQuality" para que proporcionen todas las mediciones especificadas en el archivo de reglas; puede consultar la configuración en QC pipeline y/o el archivo de reglas para determinar cuáles son.
