Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/QualityControl.po
Languages: es, pt_br

source: Using machine learning to perform image quality control: A computer exercise using CellProfiler & CellProfiler Analyst software
es: Utilización del aprendizaje automático para realizar el control de calidad de las imágenes: Un ejercicio informático con los programas CellProfiler y CellProfiler Analyst

source: Beth Cimini, Broad Institute
es: Beth Cimini, Instituto Broad

source: **Background information:**
es: **Sobre las imágenes de este ejercicio:**
pt_br: **Informações sobre o histórico:**

source: High-quality image analysis relies on having high-quality images to analyze; the so-called ‘Garbage in, garbage out’ principle. If your image set is small it is straightforward to curate it and remove images that are not in focus or that contain debris that might disrupt segmentation. In a high content screen containing tens or hundreds of thousands of images, this is essentially impossible.
es: El análisis de imágenes de alta calidad se basa en disponer de imágenes de alta calidad para analizar; es el principio de "basura dentro, basura fuera". Si el conjunto de imágenes es pequeño, resulta sencillo seleccionarlo y eliminar las imágenes que no están enfocadas o que contienen restos que podrían alterar la segmentación. En un sitio screen de alto contenido que contenga decenas o cientos de miles de imágenes, esto es esencialmente imposible.

source: The images in this experiment come from the `Broad Bioimage Benchmark Collection <https://data.broadinstitute.org/bbbc/BBBC022/>`__. They are 240 of 69,120 fields of U2OS cells treated with a panel of 1600 known bioactive compounds and imaged in five channels for a so-called CellPainting assay- see Gustafsdottir et al, 2013 for more information. Given the large size of this experiment, it was necessary to come up with an automated quality control method.
es: Las imágenes de este experimento proceden de la `Broad Bioimage Benchmark Collection <https://data.broadinstitute.org/bbbc/BBBC022/>`__. Son 240 de 69.120 campos de células U2OS tratadas con un panel de 1.600 compuestos bioactivos conocidos y obtenidas en cinco canales para un ensayo denominado CellPainting (véase Gustafsdottir et al, 2013 para más información). Dado el gran tamaño de este experimento, fue necesario idear un método de control de calidad automatizado.

source: To learn more about machine learning for image quality control, please see Bray et al 2012 and references therein.
es: Para obtener más información sobre el aprendizaje automático para el control de calidad de las imágenes, consulte Bray et al 2012 y sus referencias.
pt_br: Para saber mais sobre aprendizado de máquina para controle de qualidade de imagem, consulte Bray et al 2012 e suas referências.

source: **Goals of this exercise: **
es: **Objetivos de este ejercicio: **

source: This exercise will teach you how to measure aspects of image quality with CellProfiler and how to use the machine learning tools in CPA to create robust rules to distinguish low-quality images. It additionally will show you how to incorporate these rules into an image analysis pipeline so that they may guide your downstream data analysis.
es: Este ejercicio le enseñará cómo medir aspectos de la calidad de imagen con CellProfiler y cómo utilizar las herramientas de aprendizaje automático en CPA para crear reglas robustas para distinguir imágenes de baja calidad. Además, le mostrará cómo incorporar estas reglas en un análisis de imagen pipeline para que puedan guiar su análisis de datos posterior.
pt_br: Este exercício ensinará como medir aspectos da qualidade da imagem com o CellProfiler e como usar as ferramentas de aprendizado de máquina no CPA para criar regras robustas para distinguir imagens de baixa qualidade. Além disso, mostrará como incorporar essas regras em um pipeline de análise de imagem para que elas possam orientar a análise de dados downstream.

source: **Materials necessary for this exercise: **
es: **Materiales necesarios para este ejercicio: **

source: These 1200 images (240 sites in 5 channels) represent 120 wells from a single 384 well plate, either mock treated with DMSO or treated with a variety of bioactive compounds.
es: Estas 1.200 imágenes (240 sitios en 5 canales) representan 120 pocillos de una única placa de 384 pocillo, tratados simbólicamente con DMSO o con diversos compuestos bioactivos.
pt_br: Essas 1.200 imagens (240 locais em 5 canais) representam 120 poços de uma única placa de 384 poços, tratados com DMSO ou com uma variedade de compostos bioativos.

source: It is additionally expected that you are generally familiar with the tools in CellProfiler and CellProfiler Analyst, preferably after completing the Translocation tutorial or a similar introductory exercise.
es: Además, se espera que esté familiarizado con las herramientas de CellProfiler y CellProfiler Analyst, preferiblemente después de completar el tutorial de Translocación o un ejercicio introductorio similar.
pt_br: Além disso, espera-se que você esteja familiarizado com as ferramentas do CellProfiler e do CellProfiler Analyst, de preferência após concluir o tutorial Translocation ou um exercício introdutório semelhante.

source: **Start the provided QC pipeline on the BBBC022 dataset**
es: **Inicie el control de calidad proporcionado pipeline en el conjunto de datos BBBC022.

source: In order to do quality control, we need to first measure the images in many ways. This will allow us to do machine learning to use the measurements to identify the good images from the bad.
es: Para hacer el control de calidad, primero tenemos que medir las imágenes de muchas maneras. Esto nos permitirá utilizar el aprendizaje automático para distinguir las imágenes buenas de las malas.
pt_br: Para fazer o controle de qualidade, precisamos primeiro medir as imagens de várias maneiras. Isso nos permitirá fazer o aprendizado de máquina para usar as medições e identificar as imagens boas das ruins.

source: Start CellProfiler by double-clicking the desktop icon |Inline1|
es: Inicie CellProfiler haciendo doble clic en el icono del escritorio |Inline1|.

source: Drag and drop the ‘BBBC022_QC.cppipe’ file into the ‘Analysis modules’ box. Three modules should appear- two copies of ‘MeasureImageQuality’ and one ‘ExportToDatabase’ module.
es: Arrastre y suelte el archivo "BBBC022_QC.cppipe" en el cuadro "Módulos de análisis". Deberían aparecer tres módulos: dos copias de "MeasureImageQuality" y un módulo "ExportToDatabase".

source: Drag and drop the ‘BBBC022_20585_AE’ folder into the ‘File list’ box. It should automatically populate.
es: Arrastre y suelte la carpeta 'BBBC022_20585_AE' en el cuadro 'Lista de archivos'. Debería rellenarse automáticamente.
pt_br: Arraste e solte a pasta "BBBC022_20585_AE" na caixa "Lista de arquivos". Ela deverá ser preenchida automaticamente.

source: Hit the Analyze Images button.
es: Pulse el botón Analizar imágenes.
pt_br: Pressione o botão Analyze Images (Analisar imagens).

source: You will get an error popup – ‘No prior instances of objectgroup were defined. Are you sure you want to continue?’ Hit ‘Yes’.
es: Aparecerá un mensaje de error: "No se han definido instancias anteriores de objectgroup. ¿Está seguro de que desea continuar? Pulse "Sí".
pt_br: Você receberá um pop-up de erro - 'Não foram definidas instâncias anteriores do grupo de objetos. Tem certeza de que deseja continuar?". Pressione "Yes" (Sim).

source: This is due to the fact that there are no objects defined in the pipeline. It will not affect the final results.
es: Esto se debe a que no hay objetos definidos en pipeline. No afectará a los resultados finales.
pt_br: Isso se deve ao fato de que não há objetos definidos no pipeline. Isso não afetará os resultados finais.

source: The pipeline should take about 10-15 minutes to run. At the end, three files should be created- a .db database file, a .properties text file, and a .workspace text file.
es: La ejecución de pipeline debería durar entre 10 y 15 minutos. Al final, se crearán tres archivos: un archivo de base de datos .db, un archivo de texto .properties y un archivo de texto .workspace.
pt_br: O pipeline deve levar cerca de 10 a 15 minutos para ser executado. No final, três arquivos devem ser criados: um arquivo de banco de dados .db, um arquivo de texto .properties e um arquivo de texto .workspace.

source: **Examine the QC pipeline (~15 minutes)**
es: **Examine el CC pipeline (~15 minutos)**

source: While the pipeline is running, take some time to look over the pipeline and make sure you understand the various parts. You will probably find it easiest to open a second CellProfiler window and open the pipeline in it.
es: Mientras se ejecuta el pipeline, tómese un tiempo para revisar el pipeline y asegurarse de que entiende las distintas partes. Probablemente le resulte más fácil abrir una segunda ventana de CellProfiler y abrir el pipeline en ella.
pt_br: Enquanto o pipeline estiver em execução, reserve algum tempo para examiná-lo e certificar-se de que entendeu as várias partes. Você provavelmente achará mais fácil abrir uma segunda janela do CellProfiler e abrir o pipeline nela.

source: *Metadata*
es: *Metadatos*

source: Plate, well, site, and channel information is being extracted from the file and folder names
es: La información de la placa, pocillo, campo, y del canal se extrae de los nombres de archivos y carpetas
pt_br: As informações de placa, poço, local e canal estão sendo extraídas dos nomes de arquivos e pastas

source: The images are matched to their channels by metadata and grouped by Plate, Well, and Site
es: Las imágenes se corresponden con sus canales mediante metadatos y se agrupan por Placa, pocillo, y campo
pt_br: As imagens são combinadas com seus canais por metadados e agrupadas por placa, poço e local

source: *Groups*
es: *Grupos*

source: This module is not used
es: Este módulo no se utiliza
pt_br: Esse módulo não é usado

source: *MeasureImageQuality*
es: *MedirCalidadDeImagen*

source: ‘Include the image rescaling value?’, ‘Calculate intensity metrics?’, and ‘Calculate saturation metrics?’ are all set to yes. Open the help |Inline2| button to read about the measurements exported by each of these options.
es: Las opciones "¿Incluir el valor de reescalado de la imagen?", "¿Calcular las métricas de intensidad?" y "¿Calcular las métricas de saturación?" tienen el valor "sí". Abra el botón de ayuda |Inline2| para leer sobre las medidas exportadas por cada una de estas opciones.

source: Inline2
es: En línea2

source: ‘Calculate blur metrics?’ is set to yes and given multiple spatial scales- 2, 5, 10, and 20 pixels. Open the help |Inline2| button to read about the different methods used to determine whether an image is in focus.
es: '¿Calcular métricas de desenfoque?' está ajustado a sí y se dan múltiples escalas espaciales- 2, 5, 10 y 20 píxeles. Abra el botón de ayuda |Inline2| para leer sobre los diferentes métodos utilizados para determinar si una imagen está enfocada.

source: In this second image ‘MeasureImageQuality’ module, automatic thresholds are calculated for the ‘OrigHoechst’ and ‘OrigPh_golgi’ images using specific threshold metrics. Read about why by opening the help |Inline2| button.
es: En este segundo módulo de imagen 'MeasureImageQuality', se calculan umbrales automáticos para las imágenes 'OrigHoechst' y 'OrigPh_golgi' utilizando métricas de umbral específicas. Lea por qué abriendo el botón de ayuda |Inline2|.

source: The choice of these two images and these two thresholding methods was not random; it corresponds to the methods used to segment nuclei and cell bodies in the corresponding analysis pipeline.
es: La elección de estas dos imágenes y de estos dos métodos de umbralización no fue aleatoria; corresponde a los métodos utilizados para segmentar los núcleos y los cuerpos celulares en el análisis correspondiente pipeline.
pt_br: A escolha dessas duas imagens e desses dois métodos de limiarização não foi aleatória; ela corresponde aos métodos usados para segmentar núcleos e corpos celulares no pipeline de análise correspondente.

source: *ExportToDatabase*
es: *Exportar a base de datos

source: This module has 4 main parts, separated by breaks |Inline3|
es: Este módulo consta de 4 partes principales, separadas por pausas |Inline3|.

source: Inline3
es: En línea3

source: **Creation of the database**: these options determine what kind of database will be created (SQLite in this case), whether CellProfiler should overwrite or add to previously existing data, and what the names of the tables will be.
es: **Creación de la base de datos**: estas opciones determinan qué tipo de base de datos se creará (SQLite en este caso), si CellProfiler debe sobrescribir o añadir a los datos previamente existentes, y cuáles serán los nombres de las tablas.
pt_br: **Criação do banco de dados**: essas opções determinam que tipo de banco de dados será criado (neste caso, SQLite), se o CellProfiler deve sobrescrever ou adicionar dados existentes anteriormente e quais serão os nomes das tabelas.

source: **Creation of the CPA properties file**: these options pre-set some parameters for CellProfiler Analyst to help make it easier for you to use such as
es: **Creación del archivo de propiedades CPA**: estas opciones preestablecen algunos parámetros para CellProfiler Analyst para facilitar su uso, tales como
pt_br: **Criação do arquivo de propriedades CPA**: essas opções predefinem alguns parâmetros para o CellProfiler Analyst para facilitar seu uso, como

source: Setting the plate type to 384, and stating that the Image_Metadata_Plate and Image_Metadata_Well determine which plate and well to assign each image to
es: Estableciendo el tipo de placa a 384, y declarando que Image_Metadata_Plate e Image_Metadata_Well determinan a qué placa y pocillo asignar cada imagen.
pt_br: Definir o tipo de placa como 384 e declarar que Image_Metadata_Plate e Image_Metadata_Well determinam a qual placa e poço atribuir cada imagem

source: What color to assign each channel in the image display tools in CellProfiler Analyst
es: Qué color asignar a cada canal en las herramientas de visualización de imágenes en CellProfiler Analyst.
pt_br: Que cor atribuir a cada canal nas ferramentas de exibição de imagem do CellProfiler Analyst

source: That you are classifying ‘Image’s, not objects
es: Que está clasificando "Imágenes", no objetos.
pt_br: Que você está classificando 'Imagens', não objetos

source: **Creation of the CPA workspace file**: instead of having to explore all the parameters at random to find features that separate good images from bad images, these options allow you to auto-create graphs for the features that are likely to be the most important. Here we’ve pre-populated 12 graphs for you- 10 scatter plots and 2 histograms.
es: **Creación del archivo del espacio de trabajo de la CPA**: en lugar de tener que explorar todos los parámetros al azar para encontrar las características que separan las imágenes buenas de las malas, estas opciones le permiten crear automáticamente gráficos para las características que probablemente sean las más importantes. Aquí le hemos preparado 12 gráficos: 10 diagramas de dispersión y 2 histogramas.
pt_br: **Criação do arquivo de espaço de trabalho CPA**: em vez de ter que explorar todos os parâmetros aleatoriamente para encontrar os recursos que separam as imagens boas das ruins, essas opções permitem a criação automática de gráficos para os recursos que provavelmente são os mais importantes. Aqui, preenchemos previamente 12 gráficos para você: 10 gráficos de dispersão e 2 histogramas.

source: **CellProfiler specific adjustments**: besides determining the location of the output database, most of these options deal with how CellProfiler should treat the objects it identifies (should it calculate means/medians/standard deviations for all of them, should it combine their measurements into a single table, etc). As we are not identifying any objects, we don’t need to worry about these.
es: **Ajustes específicos de CellProfiler**: además de determinar la ubicación de la base de datos de salida, la mayoría de estas opciones tienen que ver con cómo CellProfiler debe tratar los objetos que identifica (si debe calcular medias/medias/desviaciones estándar para todos ellos, si debe combinar sus medidas en una única tabla, etc.). Como no estamos identificando ningún objeto, no necesitamos preocuparnos por esto.
pt_br: **Ajustes específicos do CellProfiler**: além de determinar o local do banco de dados de saída, a maioria dessas opções trata de como o CellProfiler deve tratar os objetos que identifica (se deve calcular médias/desvios padrão para todos eles, se deve combinar suas medidas em uma única tabela etc.). Como não estamos identificando nenhum objeto, não precisamos nos preocupar com isso.

source: **Open the CellProfiler Analyst workspace and determine reasonable parameter cutoffs (~20 minutes)**
es: **Abra el espacio de trabajo de CellProfiler Analyst y determine parámetros razonables (~20 minutos)**.

source: In the first step of the quality control pipeline, we'll look at graphs of how various measurements are distributed in the population. This allows us to get a sense of what the "normal" values are for each parameter. We'll set gates around the "abnormal" values for later usage. You can feel free to graph and examine additional parameters as well if you are interested in exploring the dataset.
es: En el primer paso del control de calidad pipeline, observaremos gráficos de cómo se distribuyen diversas mediciones en la población. Esto nos permitirá hacernos una idea de cuáles son los valores "normales" de cada parámetro. Estableceremos barreras en torno a los valores "anormales" para su uso posterior. Si está interesado en explorar el conjunto de datos, puede graficar y examinar parámetros adicionales en pocillo.
pt_br: Na primeira etapa do pipeline de controle de qualidade, analisaremos os gráficos de como várias medições estão distribuídas na população. Isso nos permite ter uma noção de quais são os valores "normais" para cada parâmetro. Estabeleceremos limites em torno dos valores "anormais" para uso posterior. Fique à vontade para criar gráficos e examinar parâmetros adicionais também se estiver interessado em explorar o conjunto de dados.

source: First-pass identification of the abnormal images is important since they are hopefully going to be rare in our overall dataset. By identifying as many abnormal images as possible in this and the next step, we'll hopefully have a large and robust enough training set that we can train a good classifier in later steps.
es: La primera identificación de las imágenes anómalas es importante, ya que esperamos que sean raras en nuestro conjunto de datos. Al identificar tantas imágenes anómalas como sea posible en este paso y en el siguiente, esperamos tener un conjunto de entrenamiento lo suficientemente grande y robusto como para poder entrenar un buen clasificador en pasos posteriores.
pt_br: A identificação de primeira passagem das imagens anormais é importante, pois espera-se que elas sejam raras em nosso conjunto de dados geral. Ao identificar o maior número possível de imagens anormais nesta e na próxima etapa, esperamos ter um conjunto de treinamento grande e robusto o suficiente para que possamos treinar um bom classificador nas etapas posteriores.

source: Once your pipeline has finished, close CellProfiler and start CellProfiler Analyst by double-clicking the icon |Inline4|.
es: Una vez que haya finalizado su pipeline, cierre CellProfiler e inicie CellProfiler Analyst haciendo doble clic en el icono |Inline4|.

source: Inline4
es: En línea4

source: Load the properties file you’ve just created.
es: Carga el archivo de propiedades que acabas de crear.
pt_br: Carregue o arquivo de propriedades que você acabou de criar.

source: Go to File-> Load Workspace. 12 graphs should be created – 5 scatter plots about focus (ImageNumber vs ImageQuality_PowerLogLogSlope), 5 scatter plots about oversaturation (ImageQuality_StdIntensity vs ImageQuality_PercentMaximal), and 2 histograms showing the automatic thresholds calculated for the nuclei and cell channels.
es: Vaya a Archivo-&gt; Cargar espacio de trabajo. Se crearán 12 gráficos: 5 gráficos de dispersión sobre el enfoque (ImageNumber vs ImageQuality_PowerLogLogSlope), 5 gráficos de dispersión sobre la sobresaturación (ImageQuality_StdIntensity vs ImageQuality_PercentMaximal) y 2 histogramas que muestran los umbrales automáticos calculados para los canales de núcleos y células.
pt_br: Vá para File-&gt; Load Workspace (Arquivo-&gt; Carregar espaço de trabalho). Devem ser criados 12 gráficos: 5 gráficos de dispersão sobre o foco (ImageNumber vs. ImageQuality_PowerLogLogSlope), 5 gráficos de dispersão sobre a supersaturação (ImageQuality_StdIntensity vs. ImageQuality_PercentMaximal) e 2 histogramas que mostram os limites automáticos calculados para os canais de núcleos e células.

source: For some or all of the graphs (preferably at least two of each type), examine the shape of the data. Are there obvious outliers present?
es: Para algunos o todos los gráficos (preferiblemente al menos dos de cada tipo), examine la forma de los datos. ¿Existen valores atípicos evidentes?
pt_br: Para alguns ou todos os gráficos (de preferência, pelo menos dois de cada tipo), examine a forma dos dados. Há outliers óbvios presentes?

source: In the ‘gate’ dropdown, select CREATE NEW GATE and give it a name (like ‘HighSat_ER’ for high outliers in the oversaturation graph of the ER channel).
es: En el menú desplegable 'puerta', seleccione CREAR NUEVA PUERTA y dele un nombre (como 'HighSat_ER' para valores extremos altos en el gráfico de sobresaturación del canal ER).
pt_br: No menu suspenso "gate" (porta), selecione CREATE NEW GATE (criar nova porta) e dê a ela um nome (como "HighSat_ER" para outliers altos no gráfico de supersaturação do canal ER).

source: Draw your gate, then right-click (PC)/Command-click (Mac) to bring up a window. You should see two options named ‘Show images in gate’ (one or both of these will be renamed in the next CPA release for the sake of clarity)
es: Dibuja tu puerta y haz clic con el botón derecho (PC)/Comando-clic (Mac) para abrir una ventana. Deberías ver dos opciones llamadas "Mostrar imágenes en la puerta" (una o ambas serán renombradas en la próxima versión de la CPA en aras de la claridad)
pt_br: Desenhe o portão e clique com o botão direito do mouse (PC)/Command-click (Mac) para abrir uma janela. Você deverá ver duas opções denominadas 'Show images in gate' (uma ou ambas serão renomeadas na próxima versão do CPA para fins de clareza)

source: The top one will open each of these images in a separate window. This is generally easiest if only a small number of images (<5) are in the gate.
es: La superior abrirá cada una de estas imágenes en una ventana separada. Esto suele ser más fácil si sólo hay un pequeño número de imágenes (&lt;5) en la puerta.

source: The bottom one will open a thumbnail viewer with thumbnails of each image; you can then double click on the thumbnail to open the full image. This is much faster when there are a lot of images inside the gate.
es: La inferior abrirá un visor de miniaturas con miniaturas de cada imagen; luego puedes hacer doble clic en la miniatura para abrir la imagen completa. Esto es mucho más rápido cuando hay muchas imágenes dentro de la puerta.
pt_br: A parte inferior abrirá um visualizador de miniaturas com miniaturas de cada imagem; você pode clicar duas vezes na miniatura para abrir a imagem completa. Isso é muito mais rápido quando há muitas imagens dentro do portão.

source: *Figure 1: Examining the objects inside a gate.*
es: *Figura 1: Examen de los objetos dentro de una puerta.*
pt_br: *Figura 1: Examinando os objetos dentro de um portão.
