Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/Translocation.po
Languages: es, pt_br

source: In the space below, record your questions to the following questions: (1) What is the enrichment score (*pEnriched_positive*) that corresponds to the highest dose (*Image_Metadata_Dose*) in the experiment? (There are several points corresponding to the highest dose, so estimate the average enrichment score) (2) What is the lowest dose that produces an enrichment score similar to that of the maximum dose?
es: En el espacio a continuación, registre sus respuestas para las siguientes preguntas: (1) ¿Cuál es la puntuación de enriquecimiento (*pEnriched_positive*) que corresponde a la dosis más alta (*Image_Metadata_Dose*) en el experimento? (Hay varios puntos correspondientes a la dosis más alta, así que estime el puntaje de enriquecimiento promedio) (2) ¿Cuál es la dosis más baja que produce un puntaje de enriquecimiento similar al de la dosis máxima?
pt_br: No espaço abaixo, registre suas perguntas para as seguintes questões: (1) Qual é a pontuação de enriquecimento (*pEnriched_positiva*) que corresponde à dose mais alta (*Image_Metadata_Dose*) no experimento? (Existem vários pontos correspondentes à dose mais alta, portanto estime a pontuação média de enriquecimento) (2) Qual é a dose mais baixa que produz uma pontuação de enriquecimento semelhante à da dose máxima?

source: 9. **Exporting your classifier for use in a CellProfiler pipeline**
es: 9. **Exportar su clasificador para usarlo en un pipeline de CellProfiler**
pt_br: 9. **Exportando seu classificador para uso em um pipeline CellProfiler**

source: Head back to the Classifier tool. The *File-->Save Classifier Model* menu option can be used to export a .model file which stores the trained classifier for use in other software.
es: Vuelva a la herramienta Clasificador. La opción de menú *Archivo > Guardar modelo de clasificador* puede utilizarse para exportar un archivo .model que almacena el clasificador entrenado para su uso en otro software.
pt_br: Volte para a ferramenta Classificador. A opção de menu *File--&gt;Save Classifier Model* pode ser usada para exportar um arquivo .model que armazena o classificador treinado para uso em outro software.

source: Within CellProfiler 4+, the *ClassifyObjects* and *FilterObjects* modules can load these model files and use them to assign objects to classes during the pipeline itself. This allows you to classify new data sets without needing to train in CellProfiler Analyst again.
es: En CellProfiler 4+, los módulos *ClassifyObjects* y *FilterObjects* pueden cargar estos archivos de modelo y utilizarlos para asignar objetos a clases durante la propia pipeline. Esto le permite clasificar nuevos conjuntos de datos sin necesidad de entrenar de nuevo en CellProfiler Analyst.
pt_br: No CellProfiler 4+, os módulos *ClassifyObjects* e *FilterObjects* podem carregar esses arquivos de modelo e usá-los para atribuir objetos a classes durante o próprio pipeline. Isso permite que você classifique novos conjuntos de dados sem a necessidade de treinar novamente no CellProfiler Analyst.

source: Note that to use model files in CellProfiler, the pipeline needs to produce the same measurements that were present in your CPA database during training. These measurements must be captured before the module which will use your model.
es: Tenga en cuenta que para utilizar archivos de modelo en CellProfiler, la pipeline necesita producir las mismas mediciones que estaban presentes en su base de datos CPA durante el entrenamiento. Estas mediciones deben ser capturadas antes del módulo que utilizará su modelo.
pt_br: Observe que, para usar arquivos de modelo no CellProfiler, o pipeline precisa produzir as mesmas medições que estavam presentes em seu banco de dados CPA durante o treinamento. Essas medições devem ser capturadas antes do módulo que usará seu modelo.

source: **To learn more about CellProfiler, please see our website:**
es: **Para obtener más información sobre CellProfiler, consulte nuestro sitio web:**
pt_br: **Para saber mais sobre o CellProfiler, consulte nosso site:**

source: Download CellProfiler and CellProfiler Analyst from the “Download” links on [https://cellprofiler.org/](https://cellprofiler.org/) and [https://cellprofileranalyst.org/](https://cellprofileranalyst.org/), and install according to the instructions from the download page. This webpage also provides tutorials and example pipelines.
es: Descargue CellProfiler y CellProfiler Analyst desde los enlaces "Descargar" en [https://cellprofiler.org/](https://cellprofiler.org/) y [https://cellprofileranalyst.org/](https://cellprofileranalyst. org/) e instálelo según las instrucciones de la página de descarga. Esta página web también proporciona tutoriales y pipelines de ejemplo.
pt_br: Baixe CellProfiler e CellProfiler Analyst nos links “Download” em [https://cellprofiler.org/](https://cellprofiler.org/) e [https://cellprofileranalyst.org/](https://cellprofileranalyst. org/) e instale de acordo com as instruções da página de download. Esta página da web também fornece tutoriais e exemplos de pipelines.

source: Visit the Scientific Community Image Forum at <https://forum.image.sc/> to find answers to common questions and ask for help if needed.
es: Visite el Foro de la Comunidad Científica de Imágenes en <https://forum.image.sc/> para encontrar respuestas a preguntas comunes y pedir ayuda si es necesario.
pt_br: Visite o Fórum de Imagens da Comunidade Científica em <https://forum.image.sc/> para encontrar respostas para perguntas comuns e pedir ajuda, se necessário.

source: Video tutorials that may be helpful are available on the Center for Open Bioimage Analysis YouTube channel: <https://www.youtube.com/channel/UC_id9sE-vu_i30Bd-skay7Q/>.
es: Hay tutoriales en vídeo disponibles que pueden resultar útiles en el canal de YouTube del enter for Open Bioimage Analysis: <https://www.youtube.com/channel/UC_id9sE-vu_i30Bd-skay7Q/>.
pt_br: Tutoriais em vídeo que podem ser úteis estão disponíveis no canal do YouTube do Center for Open Bioimage Analysis: <https://www.youtube.com/channel/UC_id9sE-vu_i30Bd-skay7Q/>.

source: Download sample images and the text file of experimental parameters used in this exercise from <https://cellprofiler-examples.s3.amazonaws.com/TranslocationData.zip/>. (The images were kindly provided through the Broad Bioimage Benchmark Collection at <http://www.broadinstitute.org/bbbc/BBBC013/>)
es: Descargue imágenes de muestra y el archivo de texto de los parámetros experimentales utilizados en este ejercicio desde <https://cellprofiler-examples.s3.amazonaws.com/TranslocationData.zip/>. (Las imágenes fueron proporcionadas amablemente a través de Broad Bioimage Benchmark Collection en <http://www.broadinstitute.org/bbbc/BBBC013/>)
pt_br: Baixe imagens de amostra e o arquivo de texto dos parâmetros experimentais usados neste exercício em <https://cellprofiler-examples.s3.amazonaws.com/TranslocationData.zip/>. (As imagens foram gentilmente cedidas através da Broad Bioimage Benchmark Collection em <http://www.broadinstitute.org/bbbc/BBBC013/>)
