Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/Translocation.po
Languages: es, pt_br

source: Click on the **NamesAndTypes** module, which is the third module in the Input module panel; this module allows you to assign a meaningful name to each image by which other modules will refer to it.
es: Haga clic en el módulo **NamesAndTypes**, que es el tercer módulo en el panel de módulos de entrada; este módulo le permite asignar un nombre significativo a cada imagen mediante el cual otros módulos se referirán a ella.
pt_br: Clique no módulo **NamesAndTypes**, que é o terceiro módulo no painel Módulo de entrada; este módulo permite atribuir um nome significativo a cada imagem pelo qual outros módulos se referirão a ela.

source: Note how the images are assigned to channels: images containing "w1" in their file name are assigned to the name "rawGFP", while those with "w2" are assigned "rawDNA".
es: Observe cómo se asignan las imágenes a los canales: a las imágenes que contienen "w1" en su nombre de archivo se les asigna el nombre "rawGFP", mientras que a las que tienen "w2" se les asigna "rawDNA".
pt_br: Observe como as imagens são atribuídas aos canais: as imagens que contêm "w1" em seu nome de arquivo são atribuídas ao nome "rawGFP", enquanto aquelas com "w2" são atribuídas a "rawDNA".

source: Click the “Update” button below the divider to display a table that shows each channel pair matched up for the 26 wells in the assay.
es: Haga clic en el botón "Actualizar" situado debajo del divisor para visualizar una tabla que muestra cada par de canales emparejados para los 26 pocillos del ensayo.
pt_br: Clique no botão "Update" (Atualizar) abaixo do divisor para exibir uma tabela que mostra cada par de canais combinados para os 26 poços do ensaio.

source: 2. **Identifying the nuclei as the “primary objects” that you will analyze**
es: 2. **Identificar los núcleos como los “objetos primarios” para el análisis**
pt_br: 2. **Identificando os núcleos como os “objetos primários” que você analisará**

source: Now that the module inputs and outputs are set up, in your module, the remaining settings need to be adjusted to best detect the nuclei. The most effective approach for this task is to use CellProfiler’s “Test mode,” which will allow you to see the results of your chosen settings, and adjust them as needed.
es: Ahora que las entradas y salidas del módulo están configuradas, en su módulo, las configuraciones restantes necesitan ser ajustadas para detectar mejor los núcleos. El enfoque más eficaz para esta tarea es utilizar el "Modo de prueba" de CellProfiler, que le permitirá ver los resultados de los ajustes elegidos, y ajustarlos según sea necesario.
pt_br: Agora que as entradas e saídas do módulo estão configuradas, em seu módulo, as configurações restantes precisam ser ajustadas para melhor detectar os núcleos. A abordagem mais eficaz para essa tarefa é usar o "Modo de teste" do CellProfiler, que permitirá que você veja os resultados das configurações escolhidas e as ajuste conforme necessário.

source: Click the <img src="./TutorialImages/StartTestMode.png" width="120"/> button to the bottom-left of the CellProfiler interface. You will see <img src="./TutorialImages/PauseBlack.png" width="35"/> icons appear next to the modules in the pipeline, as well as new buttons appear below the modules.
es: Haga clic en el botón <img src="./TutorialImages/StartTestMode.png" width="120"/> en la parte inferior izquierda de la interfaz de CellProfiler. Verá aparecer iconos <img src="./TutorialImages/PauseBlack.png" width="35"/> junto a los módulos en el pipeline, así como también aparecerán nuevos botones debajo de los módulos.
pt_br: Clique no botão <img src="./TutorialImages/StartTestMode.png" width="120"/> no canto inferior esquerdo da interface do CellProfiler. Você verá ícones <img src="./TutorialImages/PauseBlack.png" width="35"/> aparecerem ao lado dos módulos no pipeline, bem como novos botões aparecerem abaixo dos módulos.

source: Click on the <img src="./TutorialImages/Step.png" width="120"/> button below the pipeline panel, in order to progress through each module in the pipeline, one by one. Upon stepping through the **IdentifyPrimaryObjects** module, a module display window will appear similar to that shown in Figure 2 below.
es: Haga clic en el botón <img src="./TutorialImages/Step.png" width="120"/> debajo del panel pipeline para avanzar en cada módulo del pipeline, uno por uno. Al correr el módulo **IdentifyPrimaryObjects**, aparecerá una ventana de visualización similar a la que se muestra en la Figura 2 a continuación.
pt_br: Clique no botão <img src="./TutorialImages/Step.png" width="120"/> abaixo do painel do pipeline para avançar em cada módulo do pipeline, um por um. Ao passar pelo módulo **IdentifyPrimaryObjects**, uma janela de exibição do módulo aparecerá semelhante à mostrada na Figura 2 abaixo.

source: *Figure 2: Example module display window for IdentifyPrimaryObjects.*
es: *Figura 2: Ejemplo de ventana de visualización del módulo para IdentifyPrimaryObjects.*
pt_br: *Figura 2: Exemplo de janela de exibição do módulo para IdentifiquePrimaryObjects.*

source: For the **IdentifyPrimaryObjects** module, the goal is to have the outlines match the actual nuclei boundaries as well as possible, as well as separating touching objects accurately. Said another way, you do not want the program to split a single object (in this case, a single nucleus) into multiple objects, and you do not want the program to merge multiple objects into a single object.
es: Para el módulo **IdentifyPrimaryObjects**, el objetivo es que los contornos coincidan con los límites reales de los núcleos tan bien como sea posible, así como también separar con precisión objetos que estén en contacto. Dicho de otra manera, no desea que el programa divida un solo objeto (en este caso, un solo núcleo) en múltiples objetos, y no desea que el programa combine múltiples objetos en uno solo.
pt_br: Para o módulo **IdentifyPrimaryObjects**, o objetivo é fazer com que os contornos correspondam da melhor forma possível aos limites reais dos núcleos, bem como separar objetos tocantes com precisão. Dito de outra forma, você não deseja que o programa divida um único objeto (neste caso, um único núcleo) em vários objetos e não deseja que o programa mescle vários objetos em um único objeto.

source: The results of *IdentifyPrimaryObjects* are displayed in four panels in the display window, as shown in Fig. 2:
es: Los resultados de *IdentifyPrimaryObjects* se muestran en cuatro paneles en la ventana de visualización, como se muestra en la Fig. 2:
pt_br: Os resultados de *IdentifyPrimaryObjects* são exibidos em quatro painéis na janela de exibição, conforme mostrado na Fig. 2:

source: Upper left: The raw image, titled as “Input image, cycle #” plus the image number
es: Arriba a la izquierda: La imagen cruda, titulada como "Imagen de entrada, ciclo #" más el número de imagen.
pt_br: Superior esquerdo: A imagem bruta, intitulada como "Input image, cycle #" (Imagem de entrada, ciclo nº) mais o número da imagem

source: Upper right: A colored image of the identified and labeled objects, titled with the object name (in this case, “Nuclei”). Note that the colors themselves are arbitrary, intended to distinguish each identified object from its neighbors.
es: Arriba a la derecha: Imagen coloreada de los objetos identificados y etiquetados, titulada con el nombre del objeto (en este caso, "Núcleos"). Obsérvese que los colores son arbitrarios y tienen por objeto distinguir cada objeto identificado de sus vecinos.
pt_br: No canto superior direito: Uma imagem colorida dos objetos identificados e rotulados, intitulada com o nome do objeto (neste caso, "Núcleos"). Observe que as cores em si são arbitrárias, destinadas a distinguir cada objeto identificado de seus vizinhos.

source: Lower left: An image of the object outlines superimposed on the raw image, titled with the object name. Green outlines around an object indicate that the object has passed the selection criteria in the module. Yellow outlines indicate that the object touches the image edge, and has therefore been excluded. Pink outlines indicate objects that do not pass a size criterion, and have therefore been excluded.
es: Abajo a la izquierda: Una imagen de los contornos de los objetos superpuesta a la imagen cruda, titulada con el nombre del objeto. Los contornos verdes alrededor de un objeto indican que éste ha superado los criterios de selección del módulo. Los contornos amarillos indican que el objeto toca el borde de la imagen y, por tanto, ha sido excluido. Los contornos rosas indican objetos que no superan un criterio de tamaño y, por tanto, han sido excluidos.
pt_br: Parte inferior esquerda: Uma imagem dos contornos do objeto sobreposta à imagem bruta, intitulada com o nome do objeto. Os contornos verdes ao redor de um objeto indicam que o objeto foi aprovado nos critérios de seleção do módulo. Os contornos amarelos indicam que o objeto toca a borda da imagem e, portanto, foi excluído. Os contornos em rosa indicam objetos que não passaram em um critério de tamanho e, portanto, foram excluídos.

source: Lower right: A table of module setting values and statistics
es: Abajo a la derecha: Tabla de valores de ajuste y estadísticas del módulo
pt_br: No canto inferior direito: Uma tabela de valores de configuração do módulo e estatísticas

source: There are some image tools on the top toolbar that may be helpful to see the individual objects:
es: Hay algunas herramientas de imagen en la barra de herramientas superior que pueden ser útiles para ver los objetos individuales:
pt_br: Há algumas ferramentas de imagem na barra de ferramentas superior que podem ser úteis para ver os objetos individuais:

source: The 1st icon from the left lets you reset the view back to the original view.
es: El 1er icono de la izquierda le permite restablecer la visualización original.
pt_br: O primeiro ícone da esquerda permite que você redefina a visualização de volta à visualização original.

source: The 2nd and 3rd icons let you step backwards and forwards through any changes you made to the view.
es: El 2do y 3er íconos le permiten retroceder y avanzar por los cambios realizados en la visualización.
pt_br: O segundo e o terceiro ícones permitem que você retroceda e avance nas alterações feitas na visualização.

source: The 4th icon lets you change the view by moving in any direction in the display, by clicking and dragging.
es: El 4º icono le permite cambiar la vista moviéndote en cualquier dirección de la pantalla, haciendo clic y arrastrando.
pt_br: O quarto ícone permite que você altere a visualização movendo-se em qualquer direção na tela, clicando e arrastando.

source: The 5th icon lets you change the view by zooming, by dragging and drawing a box to zoom in on.
es: El 5º icono le permite cambiar la vista haciendo zoom, arrastrando y dibujando un recuadro para ampliar.
pt_br: O quinto ícone permite que você altere a visualização por meio do zoom, arrastando e desenhando uma caixa para aumentar o zoom.

source: Zoom in the image in order to see the quality of the nuclei identification. The result may look like Figure 3.
es: Amplíe la imagen para ver la calidad de la identificación de los núcleos. El resultado puede parecerse a la Figura 3.
pt_br: Amplie a imagem para ver a qualidade da identificação dos núcleos. O resultado pode se parecer com a Figura 3.

source: *Figure 3: A zoomed-in view of the display window for IdentifyPrimaryObjects*
es: *Figura 3: Vista ampliada de la ventana de visualización de IdentifyPrimaryObjects*.
pt_br: *Figura 3: Uma visualização ampliada da janela de exibição do IdentifyPrimaryObjects

source: 3. **Improve identification of primary objects**
es: 3. **Mejorar la identificación de objetos primarios**
pt_br: 3. **Melhorar a identificação de objetos primários**

source: In this instance, in Figure 3, you can see that the outlines capture too much of the background around the nuclei. This means that the default automated thresholding method calculated a threshold value that is too low. We can correct this with a change in the thresholding method used. Since we are in Test Mode, we can easily adjust the module settings and quickly preview the results.
es: En este caso, en la Figura 3, puede ver que los contornos capturan demasiado del fondo alrededor de los núcleos. Esto significa que el método de umbralización automatizado por defecto calculó un valor de umbral demasiado bajo. Podemos corregir esto con un cambio en el método de umbralización utilizado. Como estamos en el modo de prueba, podemos ajustar fácilmente la configuración del módulo y previsualizar rápidamente los resultados.
pt_br: Nesse caso, na Figura 3, você pode ver que os contornos capturam muito do fundo ao redor dos núcleos. Isso significa que o método de limiarização automatizado padrão calculou um valor de limiar muito baixo. Podemos corrigir isso com uma alteração no método de limite usado. Como estamos no Modo de teste, podemos ajustar facilmente as configurações do módulo e visualizar rapidamente os resultados.

source: Objects outlined in pink are outside the "Typical diameter" pixel range specified in the pipeline. Use the "Measure Length" tool <img src="./TutorialImages/MeasureLength.png" width="35"/> from the top toolbar to determine if the size range specified is correct given the size of your objects.
es: Los objetos delineados en rosa están fuera del rango de píxeles de "Typical diameter" ("Diámetro típico") especificado en el módulo. Utilice la herramienta "Medir longitud" <img src="./TutorialImages/MeasureLength.png" width="35"/> de la barra de herramientas superior para determinar si el rango de tamaño especificado es correcto dado el tamaño de sus objetos.
pt_br: Os objetos destacados em rosa estão fora do intervalo de pixels do "Diâmetro típico" especificado no pipeline. Use a ferramenta "Medir comprimento" <img src="./TutorialImages/MeasureLength.png" width="35"/> na barra de ferramentas superior para determinar se o intervalo de tamanho especificado está correto, considerando o tamanho dos seus objetos.

source: We can figure out why the thresholding method is overly lenient by looking closer at the original image.
es: Podemos averiguar por qué el método de umbralización es excesivamente indulgente observando más de cerca la imagen original.
pt_br: Podemos descobrir por que o método de limiarização é excessivamente brando observando mais de perto a imagem original.

source: Right-click on the “Input image, cycle #” panel in the IdentifyPrimaryObjects display window and select “Adjust Contrast” and then choose “Log normalized” from the drop-down list. You can adjust "Normalization Factor" and "Maximum Brightness", and select "Apply to all" to apply the setting to all panels in the display window. "Normalization Factor", log-transform the image intensity such that the contrast between low pixel intensities is enhanced and that between high pixel intensities is reduced.
es: Haga clic con el botón derecho del ratón en el panel "Imagen de entrada, ciclo #" de la ventana de visualización IdentifyPrimaryObjects y seleccione "Ajustar contraste" y, a continuación, elija "Log normalizado" en la lista desplegable. Puede ajustar el "Factor de normalización" y el "Brillo máximo", y seleccionar "Aplicar a todo" para aplicar el ajuste a todos los paneles de la ventana de visualización. "Factor de normalización", transforma logarítmicamente la intensidad de la imagen de modo que se realce el contraste entre las intensidades bajas de los píxeles y se reduzca el existente entre las intensidades altas.
pt_br: Clique com o botão direito do mouse no painel "Input image, cycle #" (Imagem de entrada, ciclo nº) na janela de exibição IdentifyPrimaryObjects (Identificar objetos primários) e selecione "Adjust Contrast" (Ajustar contraste) e, em seguida, escolha "Log normalized" (Registro normalizado) na lista suspensa. Você pode ajustar "Normalization Factor" (Fator de normalização) e "Maximum Brightness" (Brilho máximo) e selecionar "Apply to all" (Aplicar a todos) para aplicar a configuração a todos os painéis da janela de exibição. O "Normalization Factor" (Fator de normalização) transforma a intensidade da imagem em log, de modo que o contraste entre as intensidades baixas de pixel seja aprimorado e o contraste entre as intensidades altas de pixel seja reduzido.

source: Most thresholding methods assume that there are two intensity distributions present in the image, one of which is categorized as foreground and the other as background; the objective is then to find a single value that separates them. There are different methods to calculate this intensity threshold automatically. In order to learn more about these methods, click on the question mark icon to the right of the "Thresholding method" to open the CellProfiler help.
es: La mayoría de los métodos de umbralización suponen que hay dos distribuciones de intensidad presentes en la imagen, una de las cuales se clasifica como primer plano y la otra como fondo; el objetivo es entonces encontrar un único valor que las separe. Existen diferentes métodos para calcular automáticamente este umbral de intensidad. Para saber más sobre estos métodos, haga clic en el icono de interrogación a la derecha del "Método de umbralización" para abrir la ayuda de CellProfiler.
pt_br: A maioria dos métodos de limiarização pressupõe que há duas distribuições de intensidade presentes na imagem, uma das quais é categorizada como primeiro plano e a outra como plano de fundo; o objetivo é, então, encontrar um único valor que as separe. Há diferentes métodos para calcular esse limite de intensidade automaticamente. Para saber mais sobre esses métodos, clique no ícone de ponto de interrogação à direita de "Thresholding method" para abrir a ajuda do CellProfiler.

source: You'll note that the Translocation_start pipeline uses the Robust background method initially. This method can be helpful if the majority of the image is background. In this example, however, the nuclei cover a large percentage of the image and Robust Background method is not the optimal choice. We recommend selecting the Otsu method instead.
es: Observará que el pipeline Translocation_start utiliza inicialmente el método "Robust background". Este método puede ser útil si la mayor parte de la imagen es fondo. En este ejemplo, sin embargo, los núcleos cubren un gran porcentaje de la imagen y el método "Robust Background" no es la elección óptima. Recomendamos seleccionar en su lugar el método "Otsu".
pt_br: Você notará que o pipeline Translocation_start usa inicialmente o método Robust background. Esse método pode ser útil se a maior parte da imagem for de fundo. No entanto, neste exemplo, os núcleos cobrem uma grande porcentagem da imagem e o método Fundo robusto não é a melhor opção. Em vez disso, recomendamos selecionar o método Otsu.

source: Now, examine your original image again. In this image, there appear to be instead three classes of staining intensity: the bright nuclei (high intensity), not very bright nuclei (medium intensity), and the actual background (low intensity). An alternative thresholding method would need to take these intensity gradations into account in order to improve the nuclei detection.
es: Ahora, examine de nuevo la imagen original. En esta imagen, en cambio, parece haber tres clases de intensidad de tinción: los núcleos brillantes (intensidad alta), los núcleos no muy brillantes (intensidad media) y el fondo real (intensidad baja). Un método de umbralización alternativo tendría que tener en cuenta estas gradaciones de intensidad para mejorar la detección de los núcleos.
pt_br: Agora, examine sua imagem original novamente. Nessa imagem, parece haver três classes de intensidade de coloração: os núcleos brilhantes (alta intensidade), os núcleos não muito brilhantes (intensidade média) e o fundo real (baixa intensidade). Um método de limiarização alternativo precisaria levar em conta essas gradações de intensidade para melhorar a detecção dos núcleos.

source: Click the **IdentifyPrimaryObjects** setting labeled “Two-class or three-class thresholding?” and select “Three classes.”
es: Haga clic en la configuración de **IdentifyPrimaryObjects** denominada “Two-class or three-class thresholding?” y seleccione “Three clasess”.
pt_br: Clique na configuração **IdentifyPrimaryObjects** chamada “Limite de duas ou três classes?” e selecione “Três aulas”.

source: Click the <img src="./TutorialImages/Step.png" width="120"/> button again to see the result from your new settings.
es: Haga clic en el botón <img src="./TutorialImages/Step.png" width="120"/> nuevamente para ver el resultado de su nueva configuración.
pt_br: Clique no botão <img src="./TutorialImages/Step.png" width="120"/> novamente para ver o resultado das novas configurações.

source: Adjust the "Threshold correction factor" to 1.
es: Ajuste el "Factor de corrección del umbral" a 1.
pt_br: Ajuste o "Threshold correction factor" (Fator de correção do limite) para 1.

source: This thresholding approach takes the medium-intensity pixels and assigns them as foreground pixels, leaving only the lowest intensity pixels as background. The identified outlines should now better match the actual nuclei boundaries.
es: Este enfoque de umbralización toma los píxeles de intensidad media y los asigna como píxeles de primer plano, dejando sólo los píxeles de menor intensidad como fondo. Los contornos identificados deberían ahora coincidir mejor con los límites reales de los núcleos.
pt_br: Essa abordagem de limiarização pega os pixels de intensidade média e os atribui como pixels de primeiro plano, deixando apenas os pixels de menor intensidade como plano de fundo. Os contornos identificados agora devem corresponder melhor aos limites reais dos núcleos.

source: 4. **Identifying the cell body as a “secondary object” that you will analyze**
es: 4. **Identificar el cuerpo celular como un "objeto secundario" para el análisis**
pt_br: 4. **Identificando o corpo celular como um “objeto secundário” que você irá analisar**

source: Now that you have confirmed, by eye, that the settings we provided you in this exercise do allow for identification and segmentation of the nuclei, you can now find the entire cell using **IdentifySecondaryObjects** module.
es: Ahora que ha confirmado, a simple vista, que la configuración que le proporcionamos en este ejercicio permite la identificación y segmentación de los núcleos, puede encontrar la célula completa usando el módulo **IdentifySecondaryObjects**.
pt_br: Agora que você confirmou, visualmente, que as configurações fornecidas neste exercício permitem a identificação e segmentação dos núcleos, agora você pode encontrar a célula inteira usando o módulo **IdentifySecondaryObjects**.

source: Click on the <img src="./TutorialImages/AddModule.png" width="35"/> button and add the module *IdentifySecondaryObjects*, which is located under the module category *“Object Processing”.* Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> y agregue el módulo *IdentifySecondaryObjects*, que se encuentra en la categoría de módulos de *“Object Processing”*. Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="35"/> e adicione o módulo *IdentifySecondaryObjects*, que está localizado na categoria do módulo *“Object Processing”.* Adicione-o ao pipeline clicando no <img src="./TutorialImages/AddToPipeline.png" width="160"/> botão.
