Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/Translocation.po
Languages: es, pt_br

source: A small dot is displayed in the center of each thumbnail image as your mouse hovers over it. The cell that falls under this dot is the cell to “drag & drop” which will be used for classification.
es: Se muestra un pequeño punto en el centro de cada imagen en miniatura al pasar el ratón sobre ella. La célula que queda debajo de este punto es la célula para "arrastrar y soltar" que se utilizará para la clasificación.
pt_br: Um pequeno ponto é exibido no centro de cada imagem em miniatura quando o mouse passa sobre ela. A célula que estiver sob esse ponto é a célula a ser "arrastada e solta", que será usada para classificação.

source: You can also select cells in the unclassified bin using the arrow keys and assign them to bins with the number keys. E.g. Pressing '1' would send any selected cells to the first bin ('positive' here).
es: También puede seleccionar células en la bandeja sin clasificar utilizando las teclas de flecha y asignarlas a las bandejas con las teclas numéricas. Por ejemplo, si pulsa "1", todas las células seleccionadas se enviarán al primer contenedor ("positivo" en este caso).
pt_br: Você também pode selecionar células no compartimento não classificado usando as teclas de seta e atribuí-las aos compartimentos com as teclas numéricas. Por exemplo, pressionar "1" enviaria todas as células selecionadas para o primeiro compartimento ("positivo" aqui).

source: **Examples of positive cells** &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; **Examples of negative cells**
es: **Ejemplos de células** &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; &emsp;&emsp; **Ejemplos de células negativas**
pt_br: **Exemplos de células positivas** &emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; **Exemplos de células negativas**

source: Figure 7: <u>**Top:**</u> The Classifier interface showing 5 positive and 5 negative cells. Thirty unclassified cells remain and are ready for sorting. <u>**Bottom:**</u> *Examples of positive cells (left) and negative cells (right).*
es: Figura 7: <u>**Arriba:**</u> Interfaz del Clasificador que muestra 5 células positivas y 5 negativas. Quedan treinta células sin clasificar y están listas para ser clasificadas. <u>**Abajo:**</u> *Ejemplos de células positiva ( izquierda) y negativa (derecha).*
pt_br: Figura 7: <u>**Top:**</u> A interface do Classificador mostrando 5 células positivas e 5 negativas. Restam trinta células não classificadas e estão prontas para classificação. <u>**Inferior:**</u> *Exemplos de células positivas (esquerda) e células negativas (direita).*

source: Now “drag & drop” whichever cells you consider clearly negative (i.e. FOXO1A-GFP located exclusively in the cytoplasm) into the “negative” bin. See the bottom-right panel of Fig. 7 for examples of negative cells.
es: Ahora "arrastre y suelte" las células que considere claramente negativas (es decir, FOXO1A-GFP localizada exclusivamente en el citoplasma) en el contenedor "negativo". Consulte el panel inferior derecho de la Fig. 7 para ver ejemplos de células negativas.
pt_br: Agora, "arraste e solte" as células que você considerar claramente negativas (ou seja, FOXO1A-GFP localizada exclusivamente no citoplasma) no compartimento "negativo". Consulte o painel inferior direito da Fig. 7 para ver exemplos de células negativas.

source: Once you have at least 5 cells in the positive bin and 5 cells in the negative bin, change the classifier from ‘Random Forest’ to ‘Fast Gentle Boosting’ and click the “Train Classifier” button. If you did not receive 5 clearly positive & 5 clearly negative cells, in the first batch of 20 randomly selected cells you received, then hit the “Fetch!” button again, until you receive enough cells to be able to put 5 in each bin.
es: Una vez que tenga al menos 5 células en la casilla positiva y 5 células en la negativa, cambie el clasificador de "Random Forest" a "Fast Gentle Boosting" y haga clic en el botón "Train Classifier" (Entrenar Clasificador). Si no ha recibido 5 células claramente positivas y 5 claramente negativas en el primer lote de 20 células seleccionadas aleatoriamente, vuelva a pulsar el botón "Fetch!" hasta que reciba suficientes células para poder poner 5 en cada contenedor.
pt_br: Quando você tiver pelo menos 5 células no compartimento positivo e 5 células no compartimento negativo, altere o classificador de "Random Forest" para "Fast Gentle Boosting" e clique no botão "Train Classifier" (Treinar classificador). Se você não tiver recebido 5 células claramente positivas e 5 células claramente negativas no primeiro lote de 20 células selecionadas aleatoriamente, pressione o botão "Fetch!" novamente até receber células suficientes para colocar 5 em cada compartimento.

source: Note that in this portion of the exercise, the cell images that are provided to you are a random sampling of the data. Thus, depending on which cell images are allocated to you, your sorting into these two bins will take varying amounts of time. Subsequently, the results of this portion of the exercise will not look the same from user to user.
es: Tenga en cuenta que en esta parte del ejercicio, las imágenes de células que se le proporcionan son una muestra aleatoria de los datos. Por lo tanto, dependiendo de las imágenes de células que se le asignen, su clasificación en estos dos grupos le llevará diferentes cantidades de tiempo. Por consiguiente, los resultados de esta parte del ejercicio no serán los mismos de un usuario a otro.
pt_br: Observe que, nesta parte do exercício, as imagens de células que lhe são fornecidas são uma amostragem aleatória dos dados. Portanto, dependendo de quais imagens de células forem alocadas para você, a classificação nesses dois compartimentos levará um tempo variável. Consequentemente, os resultados dessa parte do exercício não serão os mesmos de usuário para usuário.

source: We refer to this set of positive and negative cells you have assembled as the “training set.”
es: Nos referimos a este conjunto de células positivas y negativas que ha reunido como el "conjunto de entrenamiento".
pt_br: Referimo-nos a esse conjunto de células positivas e negativas que você montou como "conjunto de treinamento".

source: 3. **Reviewing the rules that CPA established (based on your training set) to classify positive and negative cells**
es: 3. **Revisar las reglas que CPA estableció (según su conjunto de entrenamiento) para clasificar células positivas y negativas**.
pt_br: 3. **Revisando as regras que o CPA estabeleceu (com base em seu conjunto de treinamento) para classificar células positivas e negativas**

source: The classification rules you will examine below are CPA’s way of defining the measurements (and the cutoff values the measurements need to have) in order to distinguish the positive from the negative phenotypes.
es: Las reglas de clasificación que examinará a continuación son la forma que tiene la CPA de definir las medidas (y los valores de corte que deben tener las medidas) para distinguir los fenotipos positivos de los negativos.
pt_br: As regras de classificação que você examinará a seguir são a maneira de a CPA definir as medidas (e os valores de corte que as medidas precisam ter) para distinguir os fenótipos positivos dos negativos.

source: Read the text that is now located in the text box in the upper half of the Classifier window. This text contains the rules CPA found based on the training set you provided to it.
es: Lea el texto que ahora se encuentra en el cuadro de texto en la mitad superior de la ventana del Clasificador. Este texto contiene las reglas que la CPA encontró basándose en el conjunto de entrenamiento que usted le proporcionó.
pt_br: Leia o texto que agora está localizado na caixa de texto na metade superior da janela Classificador. Esse texto contém as regras que a CPA encontrou com base no conjunto de treinamento que você forneceu a ela.

source: Each rule is in the form an “IF” statement evaluating whether a measurement is greater than some value.
es: Cada regla tiene la forma de un enunciado "SI" ("IF") que evalúa si una medida es mayor que algún valor.
pt_br: Cada regra tem a forma de uma instrução "IF" que avalia se uma medida é maior que algum valor.

source: The closer to the top of the list a measurement appears, the more significant it is in distinguishing the phenotypes.
es: Cuanto más cerca de la parte superior de la lista aparece una medida, más significativa es para distinguir los fenotipos.
pt_br: Quanto mais perto do topo da lista uma medida aparece, mais significativa ela é para distinguir os fenótipos.

source: Note that this rule display is only available with the 'FastGentleBoosting' classifier type. Other classifier types will list the most important features used by the model (if supported by the classifier type).
es: Tenga en cuenta que esta visualización de reglas sólo está disponible con el tipo de clasificador "FastGentleBoosting". Otros tipos de clasificador mostrarán las características más importantes utilizadas por el modelo (si el tipo de clasificador lo admite).
pt_br: Observe que essa exibição de regra só está disponível com o tipo de classificador "FastGentleBoosting". Outros tipos de classificadores listarão os recursos mais importantes usados pelo modelo (se suportados pelo tipo de classificador).

source: Questions to consider: (1) What is the top-most measurement that shows up in your classification rules? (2) Is the top-most measurement one that you would expect to be the most significant one to use in distinguishing the phenotypes?
es: Preguntas a tener en cuenta: (1) ¿Cuál es la medida más importante que aparece en las reglas de clasificación? (2) ¿Es la medida más alta la que usted esperaría que fuera la más significativa para distinguir los fenotipos?
pt_br: Perguntas a serem consideradas: (1) Qual é a medida mais importante que aparece em suas regras de classificação? (2) A medida mais importante é aquela que você esperaria que fosse a mais significativa a ser usada para distinguir os fenótipos?

source: 4. **Reviewing the accuracy of the classification with the confusion matrix**
es: 4. **Revisar la exactitud de la clasificación con la matriz de confusión**
pt_br: 4. **Revisando a precisão da classificação com a matriz de confusão**

source: Once you have trained a classifier, you can test the ability of the of the classification rules to predict which class each cell in your training set belongs to. CPA does this by taking each cell in the training set, using its measurements and the rules generated in training to ‘guess’ whether it should be positive or negative, then comparing that answer with the bin you actually placed it in. The accuracy of these predictions can be graphed in a matrix with the ‘True label’ (the bin you assigned) on the Y axis and the ‘Predicted label’ (CPA’s guess) on the X axis.
es: Una vez que haya entrenado un clasificador, puede probar la capacidad de las reglas de clasificación para predecir a qué clase pertenece cada célula de su conjunto de entrenamiento. Para ello, CPA toma cada célula del conjunto de entrenamiento, utiliza sus medidas y las reglas generadas en el entrenamiento para "adivinar" si debería ser positiva o negativa y, a continuación, compara esa respuesta con la casilla en la que realmente se ha colocado. La exactitud de estas predicciones puede representarse gráficamente en una matriz con la "etiqueta verdadera" (la casilla asignada) en el eje Y y la "etiqueta predicha" (la suposición de CPA) en el eje X.
pt_br: Depois de treinar um classificador, você pode testar a capacidade das regras de classificação de prever a que classe pertence cada célula do conjunto de treinamento. A CPA faz isso pegando cada célula do conjunto de treinamento, usando suas medidas e as regras geradas no treinamento para "adivinhar" se ela deve ser positiva ou negativa e, em seguida, comparando essa resposta com o compartimento em que você realmente a colocou. A precisão dessas previsões pode ser representada graficamente em uma matriz com o "Rótulo verdadeiro" (o compartimento que você atribuiu) no eixo Y e o "Rótulo previsto" (estimativa da CPA) no eixo X.

source: Press the ‘Evaluate’ button to generate a confusion matrix for the cells you’ve classified so far. How accurate is your classification after adding only a few cells to your training set?
es: Pulsa el botón "Evaluar" ("Evaluate") para generar una matriz de confusión para las células que has clasificado hasta ahora. ¿Qué grado de precisión tiene tu clasificación tras añadir sólo unas pocas células a tu conjunto de entrenamiento?
pt_br: Pressione o botão "Evaluate" (Avaliar) para gerar uma matriz de confusão para as células que você classificou até o momento. Qual é a precisão de sua classificação depois de adicionar apenas algumas células ao conjunto de treinamento?

source: Note that the confusion matrix is NOT a measure of how accurate the classifier will be on your whole data set, simply a measure of *how well the classifier performs on your hand-picked examples*. As your data is likely more complicated than just the few cells you’ve chosen to train on, you shouldn’t stop at this point even if you have a perfect correlation matrix - you need to see how your classifier will perform on more data before you can decide whether it’s accurate enough to score the whole experiment.
es: Tenga en cuenta que la matriz de confusión NO es una medida de lo preciso que será el clasificador en todo el conjunto de datos, sino simplemente una medida de *lo bien que funciona el clasificador en los ejemplos elegidos a mano*. Como sus datos son probablemente más complicados que sólo las pocas células que ha elegido para entrenar, no debe detenerse en este punto, incluso si usted tiene una matriz de correlación perfecta - que necesita para ver cómo su clasificador se desempeñará en más datos antes de que pueda decidir si es lo suficientemente preciso como para puntuar todo el experimento.
pt_br: Observe que a matriz de confusão NÃO é uma medida da precisão do classificador em todo o conjunto de dados, mas simplesmente uma medida do *desempenho do classificador em seus exemplos escolhidos a dedo*. Como seus dados provavelmente são mais complicados do que apenas as poucas células que você escolheu para treinar, você não deve parar neste ponto, mesmo que tenha uma matriz de correlação perfeita - você precisa ver o desempenho do seu classificador em mais dados antes de decidir se ele é preciso o suficiente para pontuar todo o experimento.

source: *Figure 8: Examples of confusion matrices from a poorly-trained (left) and well-trained (right) classifier. The cells in the classifier on the left were assigned to bins of the training set at random, making it very difficult to come up with good rules to separate the classes; nearly 50% of each class is predicted incorrectly. The cells in the classifier on the right have been assigned to the correct bins, allowing the classifier to find rules that accurately predict which class the cells belong to. While the cells in this simple example were able to be predicted perfectly, that is rare in real data.*
es: *Figura 8: Ejemplos de matrices de confusión de un clasificador mal entrenado (izquierda) y bien entrenado (derecha). Las células del clasificador de la izquierda se asignaron a intervalos del conjunto de entrenamiento de forma aleatoria, lo que dificulta mucho la creación de reglas adecuadas para separar las clases; casi el 50% de cada clase se predice incorrectamente. Las células del clasificador de la derecha se han asignado a los intervalos correctos, lo que permite al clasificador encontrar reglas que predicen con precisión a qué clase pertenecen las células. Aunque las células de este sencillo ejemplo pudieron predecirse perfectamente, esto es poco frecuente en los datos reales.*
pt_br: *Figura 8: Exemplos de matrizes de confusão de um classificador mal treinado (esquerda) e bem treinado (direita). As células no classificador à esquerda foram atribuídas a compartimentos do conjunto de treinamento de forma aleatória, o que dificulta muito a criação de boas regras para separar as classes; quase 50% de cada classe é prevista incorretamente. As células no classificador à direita foram atribuídas aos compartimentos corretos, permitindo que o classificador encontre regras que prevejam com precisão a que classe as células pertencem. Embora as células desse exemplo simples tenham sido previstas perfeitamente, isso é raro em dados reais.*

source: 5. **Refining the training set by sorting more “unclassified” cells into the “positive” and “negative” bins**
es: 5. **Refinar el conjunto de entrenamiento clasificando más células "sin clasificar" en los contenedores "positivo" y "negativo"**
pt_br: 5. **Refinando o conjunto de treinamento classificando mais células “não classificadas” nas caixas “positivas” e “negativas”**

source: At this point, it is important to keep in mind that the CPA Classifier tool will pick whichever measurement is most significant in making its determination of positive versus negative (whether or not that measurement happens to be a physiologically relevant characteristic in the mind of the user).
es: En este punto, es importante tener en cuenta que el Clasificador CPA elegirá la medida que sea más significativa para determinar si es positiva o negativa (independientemente de que esa medida sea o no una característica fisiológicamente relevante en la mente del usuario).
pt_br: Neste ponto, é importante ter em mente que a ferramenta Classificador de CPA escolherá a medida que for mais significativa para determinar se é positiva ou negativa (independentemente de essa medida ser ou não uma característica fisiologicamente relevante na mente do usuário).

source: For example, at this point (after only sorting 5 positive & 5 negative cells), you may notice measurements called *“Object_Number”* (the object number of each cell) or *“Nuclei_Location_Center”* (the cell position in the image) included in the classification rules. This indicates that the classifier is not well-trained, since these measurements are not correlated with the phenotype we want to find. Whenever you find that the classifier is not well-trained, you need to either add more cells to the training set, or obtain more measurements from the cells.
es: Por ejemplo, en este punto (después de ordenar solo 5 células positivas y 5 negativas), es posible que observe medidas llamadas *“Object_Number”* (el número de objeto de cada células) o *“Nuclei_Location_Center”* (la posición células en la imagen) incluida en las reglas de clasificación. Esto indica que el clasificador no está bien entrenado, ya que estas mediciones no están correlacionadas con el fenotipo que queremos encontrar. Siempre que descubra que el clasificador no está bien entrenado, deberá agregar más células al conjunto de entrenamiento u obtener más medidas de células.
pt_br: Por exemplo, neste ponto (depois de classificar apenas 5 células positivas e 5 negativas), você pode notar medidas chamadas *“Object_Number”* (o número do objeto de cada célula) ou *“Nuclei_Location_Center”* (a posição da célula na imagem) incluídas nas regras de classificação. Isso indica que o classificador não está bem treinado, pois essas medidas não estão correlacionadas com o fenótipo que queremos encontrar. Sempre que você descobrir que o classificador não está bem treinado, será necessário adicionar mais células ao conjunto de treinamento ou obter mais medidas das células.

source: **Refining the training set by obtaining samples from positive and negative control wells:** Sometimes the phenotype of interest is uncommon enough, that fetching 20 random images will not result in the retrieval of many clear examples of the phenotype you are looking for. However, if you know which images contain examples of the phenotype, you can open the image - either by double-clicking a cell thumbnail, or from the *Plate Viewer* (if you know the location of the well). You can then drag-and-drop the cells of interest directly from the image.
es: **A veces, el fenotipo de interés es tan poco común que la obtención de 20 imágenes al azar no dará lugar a la recuperación de muchos ejemplos claros del fenotipo que está buscando. Sin embargo, si sabe qué imágenes contienen ejemplos del fenotipo, puede abrir la imagen, ya sea haciendo doble clic en la miniatura de una célula o desde el *Visor de placas* (si conoce la ubicación del pocillo). A continuación, puede arrastrar y soltar las células de interés directamente desde la imagen.
pt_br: **Refinar o conjunto de treinamento obtendo amostras de poços de controle positivo e negativo:** Às vezes, o fenótipo de interesse é incomum o suficiente para que a busca de 20 imagens aleatórias não resulte na recuperação de muitos exemplos claros do fenótipo que você está procurando. Entretanto, se você souber quais imagens contêm exemplos do fenótipo, poderá abrir a imagem clicando duas vezes na miniatura de uma célula ou no *Plate Viewer* (se souber a localização do poço). Em seguida, você pode arrastar e soltar as células de interesse diretamente da imagem.

source: Open the *Plate Viewer* and double-click on well A01, in order to open an image from the negative controls.
es: Abra el *Visor de Placas* y haga doble clic en el pocillo A01, para abrir una imagen de los controles negativos.
pt_br: Abra o *Plate Viewer* e clique duas vezes no poço A01 para abrir uma imagem dos controles negativos.

source: Click on a cell in the image that is negative for the phenotype and drag-and-drop it into the negative bin. Repeat this for 5 negative cells.
es: Haga clic en una célula de la imagen que sea negativa para el fenotipo y arrástrela y suéltela en el contenedor negativo. Repita esta operación para 5 células negativas.
pt_br: Clique em uma célula da imagem que seja negativa para o fenótipo e arraste e solte-a no compartimento negativo. Repita esse procedimento para 5 células negativas.

source: Repeat the above two steps for A12 (a well containing a positive control sample), dropping the cells into the positive bin. Do this for 5 positive cells.
es: Repita los dos pasos anteriores para A12 (un pocillo que contiene una muestra de control positiva), dejando caer las células en el recipiente positivo. Haga esto para 5 células positivas.
pt_br: Repita as duas etapas acima para A12 (um poço que contém uma amostra de controle positivo), colocando as células no compartimento positivo. Faça isso para 5 células positivas.

source: Click the “Train classifier” button.
es: Haga clic en el botón "Entrenar clasificador".
pt_br: Clique no botão "Train classifier" (Treinar classificador).

source: **Refining the training set by correcting misclassified cells in an image:** You may also apply the rules to all the identified cells in an image, and use it to correct misclassifications.
es: **También puede aplicar las reglas a todas las células identificadas en una imagen y utilizarlas para corregir errores de clasificación.
pt_br: **Refinar o conjunto de treinamento corrigindo células classificadas incorretamente em uma imagem:** Você também pode aplicar as regras a todas as células identificadas em uma imagem e usá-las para corrigir classificações incorretas.

source: Double-click any of cell thumbnails in the positive or negative bins.
es: Haga doble clic en cualquiera de las miniaturas de célula de los intervalos positivo o negativo.
pt_br: Clique duas vezes em qualquer uma das miniaturas de células nos compartimentos positivos ou negativos.
