Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/Translocation.po
Languages: es, pt_br

source: Click the “View output settings” button at the bottom-left of the interface. Then, in the module settings panel, click the folder button to the right of “Default Output Folder” box, and browse to select your Desktop. This location is where your CellProfiler measurements will be saved.
es: Haz clic en el botón "Ver configuración de salida" en la parte inferior izquierda de la interfaz. A continuación, en el panel de configuración del módulo, haga clic en el botón de carpeta a la derecha de la casilla "Carpeta de salida predeterminada", y navegue para seleccionar su Escritorio. Esta ubicación es donde se guardarán las mediciones de CellProfiler.
pt_br: Clique no botão "View output settings" (Exibir configurações de saída) na parte inferior esquerda da interface. Em seguida, no painel de configurações do módulo, clique no botão de pasta à direita da caixa "Default Output Folder" (Pasta de saída padrão) e navegue para selecionar sua área de trabalho. Esse local é onde suas medições do CellProfiler serão salvas.

source: Select the “Window” item from the menu bar and select “Hide all windows on run;” the *“eyeball”* icons next to the modules will switch from open (<img src="./TutorialImages/EyeOpen.png" width="35"/>) to closed (<img src="./TutorialImages/EyeClosed.png" width="35"/>). This display indicates that the module display windows for each module will not be shown as each is processed. The rationale behind this step is because the pipeline is optimized, we no longer need to see the results. Additionally, the analysis will be quicker this way, since CellProfiler does not have to take the time to create and draw each window.
es: Seleccione la opción "Window" de la barra de menú y seleccione “Hide all windows on run"; los íconos de *“ojos”* al lado de los módulos cambiarán de abiertos (<img src="./TutorialImages/EyeOpen.png" width="35"/>) a cerrados (<img src="./TutorialImages/EyeClosed.png" width="35"/>). Esto indica que las ventanas de visualización para cada módulo no se mostrarán a medida que se procese cada uno. La razón detrás de este paso es que ya que el pipeline está optimizado, ya no necesitamos ver los resultados. Además, el análisis será más rápido de esta manera, ya que CellProfiler no tiene que tomarse el tiempo para crear cada ventana.
pt_br: Selecione o item “Janela” na barra de menu e selecione “Ocultar todas as janelas durante a execução”; os ícones *“globo ocular”* próximos aos módulos mudarão de abertos (<img src="./TutorialImages/EyeOpen.png" width="35"/>) para fechados (<img src="./TutorialImages/EyeClosed.png" width="35"/>). Esta exibição indica que as janelas de exibição de cada módulo não serão mostradas à medida que cada um é processado. A justificativa por trás desta etapa é porque o pipeline está otimizado, não precisamos mais ver os resultados. Além disso, a análise será mais rápida desta forma, já que o CellProfiler não precisa perder tempo criando e desenhando cada janela.

source: Save your pipeline by selecting *File > Save Project As…*, give the pipeline a name and save it to your Desktop.
es: Guarda tu pipeline seleccionando *Archivo > Guardar Proyecto como...*, dale un nombre al pipeline y guárdalo en tu Escritorio.
pt_br: Salve o pipeline selecionando *Arquivo &gt; Salvar projeto como...*, dê um nome ao pipeline e salve-o na área de trabalho.

source: To analyze all images, click “Analyze images” button in the lower right corner of the CellProfiler interface.
es: Para analizar todas las imágenes, haga clic en el botón "Analizar imágenes" en la esquina inferior derecha de la interfaz de CellProfiler.
pt_br: Para analisar todas as imagens, clique no botão "Analyze images" (Analisar imagens) no canto inferior direito da interface do CellProfiler.

source: (Windows only) A Windows Security Alert box may pop up asking for network access permission for CellProfiler.exe. Check the “Private networks” box, then click “Allow access”.
es: (Sólo Windows) Es posible que aparezca un cuadro de alerta de seguridad de Windows solicitando permiso de acceso a la red para CellProfiler.exe. Marque la casilla "Redes privadas" y haga clic en "Permitir acceso".
pt_br: (Somente Windows) Pode aparecer uma caixa de alerta de segurança do Windows solicitando permissão de acesso à rede para o CellProfiler.exe. Marque a caixa "Private networks" (Redes privadas) e clique em "Allow access" (Permitir acesso).

source: The pipeline will run beginning with the first of 26 images. This full run may take a few minutes.
es: El proceso comenzará con la primera de las 26 imágenes. Esta ejecución completa puede tardar unos minutos.
pt_br: O pipeline será executado a partir da primeira das 26 imagens. Essa execução completa pode levar alguns minutos.

source: Exercise II: Using the CellProfiler Analyst software to visualize the data from the experiment, and classify the cells exposed to each drug condition by their phenotype (FOXO1A-GFP subcellular localization)
es: Ejercicio II: Utilizar el software CellProfiler Analyst para visualizar los datos del experimento y clasificar las células expuestas a cada condición farmacológica según su fenotipo (localización subcelular de FOXO1A-GFP).
pt_br: Exercício II: Usar o software CellProfiler Analyst para visualizar os dados do experimento e classificar as células expostas a cada condição de droga por seu fenótipo (localização subcelular de FOXO1A-GFP)

source: You can now start CellProfiler Analyst (CPA) to explore the data you have extracted from the cells.
es: Ahora puede iniciar CellProfiler Analyst (CPA) para explorar los datos que ha extraído de las células.
pt_br: Agora você pode iniciar o CellProfiler Analyst (CPA) para explorar os dados que extraiu das células.

source: Start CellProfiler Analyst by double-clicking the icon on the desktop <img src="./TutorialImages/CPAlogo.png" width="35"/>.
es: Inicie CellProfiler Analyst haciendo doble clic en el icono del escritorio <img src="./TutorialImages/CPAlogo.png" width="35"/>.
pt_br: Inicie o CellProfiler Analyst clicando duas vezes no ícone na área de trabalho <img src="./TutorialImages/CPAlogo.png" width="35"/>.

source: When CPA is started, it will ask to select a *properties file*. Select the properties file named *DefaultDB .properties*, located in the Default Output Folder. The properties file was created by the **ExportToDatabase** module in your pipeline.
es: Cuando se inicia CPA, le pedirá que seleccione un *properties file* (*archivo de propiedades*). Seleccione el archivo de propiedades denominado *DefaultDB .properties*, ubicado en la carpeta de salida predeterminada. El archivo de propiedades fue creado por el módulo **ExportToDatabase** en su pipeline.
pt_br: Quando o CPA for iniciado, ele solicitará a seleção de um *arquivo de propriedades*. Selecione o arquivo de propriedades denominado *DefaultDB .properties*, localizado na Pasta de Saída Padrão. O arquivo de propriedades foi criado pelo módulo **ExportToDatabase** em seu pipeline.

source: This file is a text file that contains the settings necessary for CPA to connect to the database that CellProfiler generated.
es: Este archivo es un archivo de texto que contiene la configuración necesaria para que CPA se conecte a la base de datos que CellProfiler generó.
pt_br: Esse arquivo é um arquivo de texto que contém as configurações necessárias para que o CPA se conecte ao banco de dados gerado pelo CellProfiler.

source: As a reminder, this database currently contains the measurement data obtained from all 26 images, and pointers to the location of those images on your hard drive.
es: Como recordatorio, esta base de datos contiene actualmente los datos de medición obtenidos de las 26 imágenes, y los punteros a la ubicación de esas imágenes en su disco duro.
pt_br: Como lembrete, esse banco de dados contém atualmente os dados de medição obtidos de todas as 26 imagens e os ponteiros para o local dessas imagens em seu disco rígido.

source: If you move the database file, you'll need to edit the properties file to point to the new database location.
es: Si traslada el archivo de base de datos, tendrá que editar el archivo de propiedades para que apunte a la nueva ubicación de la base de datos.
pt_br: Se você mover o arquivo de banco de dados, precisará editar o arquivo de propriedades para apontar para o novo local do banco de dados.

source: 1. **Visualizing the measurements in a 96-well plate layout view**
es: 1. **Visualización de las medidas en una vista de placa multipocillo**
pt_br: 1. **Visualizando as medições em um layout de placa de 96 poços**

source: CPA has several tools available for displaying the data for exploration. If your data came from a multi-well plate, such as the 96-well plate for this particular translocation assay, then one of the most useful data visualization tools available is the plate layout format.
es: CPA tiene varias herramientas disponibles para mostrar los datos para su exploración. Si sus datos provienen de una placa de múltiples pocillos, como la placa de 96 pocillos para este ensayo de translocación en particular, entonces una de las herramientas de visualización de datos más útiles disponibles es el formato de disposición de la placa.
pt_br: A CPA tem várias ferramentas disponíveis para exibir os dados para exploração. Se os dados forem provenientes de uma placa de múltiplos poços, como a placa de 96 poços para esse ensaio de translocação específico, uma das ferramentas de visualização de dados mais úteis disponíveis é o formato de layout de placa.

source: Click on the Plate Viewer icon in the main CPA window (<img src="./TutorialImages/Inline09.png" width="50"/>, 3rd from the left). This selection brings up a 96-well formatted display of the plate from which your images originated. The colored squares represent wells for which measurement data is present; crossed-out wells indicate wells with no measurements. Notice that 26 out of the 96 wells have data associated with them. Mouse over a few of the wells to see a “tool-tip” box appear, which states the actual per-well value.
es: Haga clic en el icono del Visor de Placas en la ventana principal de CPA (<img src="./TutorialImages/Inline09.png" width="50"/>, tercero desde la izquierda). Esta selección muestra una visualización con formato de placa de 96 pocillos a partir de la cual se originaron sus imágenes. Los cuadrados coloreados representan pocillos para los cuales hay datos de medición presentes; Los pocillos tachados indican pocillos sin mediciones. Observe que 26 de los 96 pocillos tienen datos asociados. Pase el mouse sobre algunos de los pocillos para ver aparecer un cuadro de “tool-tip”, que indica el valor real por pocillo.
pt_br: Clique no ícone Plate Viewer na janela principal do CPA (<img src="./TutorialImages/Inline09.png" width="50"/>, 3º a partir da esquerda). Esta seleção traz uma exibição formatada de 96 poços da placa da qual suas imagens se originaram. Os quadrados coloridos representam poços para os quais estão presentes dados de medição; poços riscados indicam poços sem medições. Observe que 26 dos 96 poços possuem dados associados a eles. Passe o mouse sobre alguns dos poços para ver uma caixa de “dica de ferramenta” aparecer, que indica o valor real por poço.

source: The initial color coding represents the image index, a bookkeeping measurement which is not relevant for the level of analysis that we are doing in this exercise. Under the *Measurements* drop-down list, choose *“Image_Metadata_Dose”* from the list, in order to visualize the drug concentrations added to each well. In particular, take note of the following:
es: El código de colores inicial representa el número de índice de la imagen, una medida que no es relevante para el nivel de análisis que estamos haciendo en este ejercicio. En la lista desplegable *Measurements*, elija *“Image_Metadata_Dose”* de la lista para visualizar las concentraciones de fármaco agregadas a cada pocillo. En particular, tome nota de lo siguiente:
pt_br: A codificação de cores inicial representa o índice da imagem, uma medida contábil que não é relevante para o nível de análise que estamos fazendo neste exercício. Na lista suspensa *Medidas*, escolha *“Image_Metadata_Dose”* na lista, para visualizar as concentrações de medicamentos adicionadas a cada poço. Em particular, tome nota do seguinte:

source: Column 1, rows A-D, column 12, rows E-H and well E02: Negative controls, i.e., no drug added
es: Columna 1, filas A-D, columna 12, filas E-H y pocillo E02: Controles negativos, es decir, sin adición de fármaco.
pt_br: Coluna 1, linhas A-D, coluna 12, linhas E-H e poço E02: Controles negativos, ou seja, sem adição de medicamento

source: Column 1, rows E-H and column 12, rows A-D: Positive controls, i.e., 150 nM Wortmannin
es: Columna 1, filas E-H y columna 12, filas A-D: Controles positivos, es decir, 150 nM Wortmannin
pt_br: Coluna 1, linhas E-H e coluna 12, linhas A-D: Controles positivos, ou seja, 150 nM de Wortmannin

source: Row E, columns 2-11: Nine doses of 2-fold dilutions of Wortmannin, increasing from left to right.
es: Fila E, columnas 2-11: Nueve dosis de diluciones dobles de Wortmannin, aumentando de izquierda a derecha.
pt_br: Linha E, colunas 2-11: Nove doses de diluições de 2 vezes de Wortmannin, aumentando da esquerda para a direita.

source: *Figure 6: The Plate Viewer visualization tool illustrating the drug dosages applied to the plate.*
es: *Figura 6: La herramienta de visualización Visor de Placas ilustra las dosis de fármacos aplicadas a la placa.*
pt_br: *Figura 6: A ferramenta de visualização Plate Viewer ilustrando as dosagens de medicamento aplicadas à placa.

source: Select “*Image_Count_Nuclei”* from the *Measurement* drop-down to show the nuclei count for each image.
es: Seleccione "*Image_Count_Nuclei"* en el menú desplegable *Medición* para mostrar el recuento de núcleos de cada imagen.
pt_br: Selecione “*Image_Count_Nuclei”* no menu suspenso *Measurement* para mostrar a contagem de núcleos de cada imagem.

source: Per-object measurements can also be displayed using this tool. Select “Per-object” as the Data Source, and “*Cytoplasm_Math_IntensityRatio”* as the Measurement. Since each well can display only one value, but there are multiple objects per well, the Plate Viewer displays an aggregate statistic of the per-object measurements for each well. (Note that you can change the statistic used, at this step, by selecting it from the “Aggregation method” drop-down in the “Data aggregation” panel.)
es: Las mediciones por objeto también se pueden mostrar usando esta herramienta. Seleccione "Per-object" como Data Source y "*Cytoplasm_Math_IntensityRatio"* como Measurement. Dado que cada pocillo puede mostrar sólo un valor, pero hay varios objetos por pocillo, Plate Viewer muestra una estadística agregada del mediciones por objeto para cada pocillo. (Tenga en cuenta que puede cambiar la estadística utilizada en este paso, seleccionándola en el menú desplegable "Aggregation method" en el panel "Data aggregation”).
pt_br: Medições por objeto também podem ser exibidas usando esta ferramenta. Selecione “Por objeto” como fonte de dados e “*Cytoplasm_Math_IntensityRatio”* como medição. Como cada poço pode exibir apenas um valor, mas há vários objetos por poço, o Plate Viewer exibe uma estatística agregada das medições por objeto para cada poço. (Observe que você pode alterar a estatística usada, nesta etapa, selecionando-a no menu suspenso “Método de agregação” no painel “Agregação de dados”.)

source: In this step, you will see how the image thumbnails can also be shown in the viewer. To do this, under “Well display” in the “View options” panel, select “thumbnail.” The colored well squares will be replaced with merged color thumbnails of the original images.
es: En este paso, verá cómo las miniaturas de las imágenes también pueden mostrarse en el visor. Para ello, en "Visualización de Pocillos" (**Well Display**) del panel "Opciones de visualización" (**View options**), seleccione "miniatura" (**thumbnail**). Los cuadrados de pocillos en color se sustituirán por miniaturas en color fusionadas de las imágenes originales.
pt_br: Nesta etapa, você verá como as miniaturas de imagem também podem ser mostradas no visualizador. Para fazer isso, em "Well display" (Exibição de poço) no painel "View options" (Opções de visualização), selecione "thumbnail" (miniatura). Os quadrados coloridos do poço serão substituídos por miniaturas coloridas mescladas das imagens originais.

source: In order to see that the original images are linked to the well display, you should right-click on a well and select the image number corresponding to the image of interest, in order to display the full image. (Note that the default color for each channel can be changed by selecting the desired colors in the menu bar; any changes will be applied to subsequent images that you open.)
es: Para ver que las imágenes originales están vinculadas a la visualización de pocillos, debe hacer clic con el botón derecho del ratón en un pocillo y seleccionar el número de imagen correspondiente a la imagen de interés, para visualizar la imagen completa. (Tenga en cuenta que el color por defecto de cada canal puede cambiarse seleccionando los colores deseados en la barra de menú; cualquier cambio se aplicará a las imágenes posteriores que abra).
pt_br: Para ver que as imagens originais estão vinculadas à exibição do poço, clique com o botão direito do mouse em um poço e selecione o número da imagem correspondente à imagem de interesse para exibir a imagem completa. (Observe que a cor padrão de cada canal pode ser alterada selecionando as cores desejadas na barra de menus; qualquer alteração será aplicada às imagens subsequentes que você abrir).

source: Lastly, you will view the thumbnail montages by right-clicking on a well and selecting “Show thumbnail montage” from the resulting pop-up. Move the thumbnail by dragging the bar on top of the image. Click on the thumbnail image to dismiss it from view. (Note that, if there had been multiple snapshots of multiple fields of view for each well in the plate, then the montage would be shown as a tiled display.)
es: Por último, verá los montajes de miniaturas haciendo clic con el botón derecho del ratón en un pocillo y seleccionando "Mostrar montaje de miniaturas" en la ventana emergente resultante. Desplace la miniatura arrastrando la barra situada encima de la imagen. Haga clic en la imagen en miniatura para quitarla de la vista. (Tenga en cuenta que, si hubiera habido varias instantáneas de varios campos de visión para cada pocillo de la placa, el montaje se mostraría como una visualización en mosaico).
pt_br: Por fim, você visualizará as montagens de miniaturas clicando com o botão direito do mouse em um poço e selecionando "Show thumbnail montage" (Mostrar montagem de miniaturas) na janela pop-up resultante. Mova a miniatura arrastando a barra na parte superior da imagem. Clique na imagem em miniatura para excluí-la da visualização. (Observe que, se houvesse vários instantâneos de vários campos de visão para cada poço na placa, a montagem seria mostrada como uma exibição em mosaico).

source: Do not close the Plate Viewer tool, as you will be referring to it later in the exercise.
es: No cierre la herramienta Visor de Placas, ya que se referirá a ella más adelante en el ejercicio.
pt_br: Não feche a ferramenta Plate Viewer, pois você fará referência a ela mais tarde no exercício.

source: 2. **Using the Classifier function of CPA to distinguish the cells’ FOXO1A-GFP subcellular localization phenotypes**
es: 2. **Uso de la función Clasificador de CPA para distinguir los fenotipos de localización subcelular de FOXO1A-GFP**
pt_br: 2. **Usando a função classificadora do CPA para distinguir os fenótipos de localização subcelular FOXO1A-GFP das células**

source: CellProfiler Analyst contains a machine-learning classification tool, which will allow you to distinguish different phenotypes automatically. In this case, we will “train” the classifier to recognize cells in which FOXO1A-GFP is located exclusively in the nucleus (“positives”) versus outside the nucleus (“negatives”) by sorting examples of each into bins.
es: CellProfiler Analyst contiene una herramienta de clasificación de aprendizaje automático, que le permitirá distinguir diferentes fenotipos de forma automática. En este caso, "entrenaremos" al clasificador para que reconozca las células en las que FOXO1A-GFP se localiza exclusivamente en el núcleo ("positivas") frente a las que se localizan fuera del núcleo ("negativas") clasificando los ejemplos de cada una en bins.
pt_br: O CellProfiler Analyst contém uma ferramenta de classificação de aprendizado de máquina que lhe permitirá distinguir diferentes fenótipos automaticamente. Nesse caso, "treinaremos" o classificador para reconhecer células nas quais a FOXO1A-GFP está localizada exclusivamente no núcleo ("positivas") e fora do núcleo ("negativas"), classificando exemplos de cada uma delas em compartimentos.

source: Select the *Classifier* icon in the main CPA window (<img src="./TutorialImages/Inline10.png" width="50"/>, 2nd on left). The Classifier interface will appear, similar to that shown in the top of Fig. 7.
es: Seleccione el ícono *Clasificador* en la ventana principal de CPA (<img src="./TutorialImages/Inline10.png" width="50"/>, segundo a la izquierda). Aparecerá la interfaz Classifier, similar a la que se muestra en la parte superior de la Fig. 7.
pt_br: Selecione o ícone *Classificador* na janela principal do CPA (<img src="./TutorialImages/Inline10.png" width="50"/>, 2º à esquerda). A interface do Classificador aparecerá, semelhante àquela mostrada no topo da Fig.

source: Click on the “Fetch!” button, which instructs CPA to display pictures of a specified number (i.e. 20) of randomly selected cells from this experiment. You will see the middle “unclassified” panel start to be populated with thumbnail images of these randomly selected cells.
es: Haga clic en el botón "Fetch!" ("Buscar!"), que indica a la CPA que muestre imágenes de un número especificado (es decir, 20) de células seleccionadas al azar de este experimento. Verá que el panel central "sin clasificar" comienza a poblarse con imágenes en miniatura de estas células seleccionadas al azar.
pt_br: Clique no botão "Fetch!" (Buscar!), que instrui a CPA a exibir imagens de um número especificado (ou seja, 20) de células selecionadas aleatoriamente desse experimento. Você verá o painel "não classificado" do meio começar a ser preenchido com imagens em miniatura dessas células selecionadas aleatoriamente.

source: Use your mouse to “drag & drop” whichever cells you consider clearly positive (i.e. FOXO1A-GFP located exclusively in the nucleus) into the “positive” bin. See the bottom-left panel of Fig. 7 for examples of positive cells.
es: Utilice el ratón para "arrastrar y soltar" las células que considere claramente positivas (es decir, FOXO1A-GFP localizada exclusivamente en el núcleo) en el contenedor "positivo". Vea en el panel inferior izquierdo de la Fig. 7 ejemplos de células positivas.
pt_br: Use o mouse para "arrastar e soltar" as células que você considerar claramente positivas (ou seja, FOXO1A-GFP localizada exclusivamente no núcleo) para o compartimento "positivo". Consulte o painel inferior esquerdo da Fig. 7 para ver exemplos de células positivas.
