Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/Translocation.po
Languages: es, pt_br

source: For the “Name the output measurement,” enter the “IntensityRatio” as a descriptive name.
es: En "Nombre de la medida de salida", introduzca "IntensityRatio" como nombre descriptivo.
pt_br: Para "Nomear a medição de saída", digite "IntensityRatio" como um nome descritivo.

source: Since we calculating a ratio of two measures, select “Divide” from the drop-down for the “Operation” setting.
es: Dado que estamos calculando un cociente de dos medidas, seleccione "Dividir" en el desplegable del ajuste "Operación".
pt_br: Como estamos calculando uma proporção de duas medidas, selecione "Divide" (Dividir) no menu suspenso da configuração "Operation" (Operação).

source: For the numerator measurement:
es: Para la medida del numerador:
pt_br: Para a medição do numerador:

source: Select “Object” for the “Select the numerator type,” and select “Nuclei” from the drop-down for the “Select the numerator objects.”
es: Seleccione "Objeto" para "Seleccionar el tipo de numerador" y seleccione "Nuclei" en el desplegable para "Seleccionar los objetos del numerador".
pt_br: Selecione "Object" (Objeto) para "Select the numerator type" (Selecionar o tipo de numerador) e selecione "Nuclei" (Núcleos) no menu suspenso para "Select the numerator objects" (Selecionar os objetos do numerador).

source: Select “Intensity” from the drop-down for the “Select the numerator measurement” category. A “Measurement” drop-down box will subsequently appear underneath.
es: Seleccione "Intensity" en el menú desplegable de la categoría "Select the numerator measurement". A continuación aparecerá un cuadro desplegable "Measurement" (Medida).
pt_br: Selecione "Intensity" (Intensidade) no menu suspenso da categoria "Select the numerator measurement" (Selecione a medida do numerador). Uma caixa suspensa "Measurement" (Medição) aparecerá em seguida.

source: Select “MeanIntensity” from the “Measurement” drop-down list. Then select “rawGFP” from the “Image” drop-down that appears.
es: Seleccione "MeanIntensity" en la lista desplegable "Measurement". A continuación, seleccione "rawGFP" en el desplegable "Image" que aparece.
pt_br: Selecione "MeanIntensity" (Intensidade média) na lista suspensa "Measurement" (Medição). Em seguida, selecione "rawGFP" no menu suspenso "Image" (Imagem) que aparece.

source: For the denominator measurement:
es: Para la medida del denominador:
pt_br: Para a medição do denominador:

source: Select “Object” for the “Select the numerator type,” and select “Cytoplasm” from the drop-down for the “Select the numerator objects.”
es: Seleccione "Objeto" para "Seleccionar el tipo de numerador" y seleccione "Cytoplasm" en el desplegable para "Seleccionar los objetos del numerador".
pt_br: Selecione "Object" (Objeto) para "Select the numerator type" (Selecionar o tipo de numerador) e selecione "Cytoplasm" (Citoplasma) no menu suspenso para "Select the numerator objects" (Selecionar os objetos do numerador).

source: 7. **Creating an image with your cell and nuclear outlines on it (optional)**
es: 7. **Crear una imagen con tu células y contornos nucleares (opcional)**
pt_br: 7. **Criando uma imagem com sua célula e contornos nucleares (opcional)**

source: It’s often nice to create an image showing the segmentation of your objects so that you can refer back to it later; in addition to the ability to quickly scan all the output images to make sure your segmentation was successful, you can re-check them later in case you have questions about an unusual result.
es: A menudo es bueno crear una imagen que muestre la segmentación de los objetos para poder consultarla más tarde; además de la posibilidad de escanear rápidamente todas las imágenes de salida para asegurarse de que la segmentación se ha realizado correctamente, puede volver a comprobarlas más tarde en caso de que tenga dudas sobre un resultado inusual.
pt_br: Muitas vezes, é bom criar uma imagem que mostre a segmentação dos objetos para que você possa consultá-la mais tarde; além da capacidade de verificar rapidamente todas as imagens de saída para ter certeza de que a segmentação foi bem-sucedida, você pode verificá-las novamente mais tarde, caso tenha dúvidas sobre um resultado incomum.

source: **Creation of a color image to display the segmentation:**
es: **Creación de una imagen en color para mostrar la segmentación:**
pt_br: **Criação de uma imagem colorida para exibir a segmentação:**

source: Click on the <img src="./TutorialImages/AddModule.png" width="35"/> button and add the module **GrayToColor** located under the *“Image Processing”* module category*.* Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> y agregue el módulo **GrayToColor** ubicado en la categoría de módulos *“Image Processing”**.* Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="35"/> e adicione o módulo **GrayToColor** localizado na categoria do módulo *“Image Processing”**.* Adicione-o ao pipeline clicando no botão <span botão class='notranslate'><img src="./TutorialImages/AddToPipeline.png" width="160"/></span>.

source: For the “Select a color scheme”, leave the setting at “RGB”.
es: Para "Seleccionar un esquema de color", deje el ajuste en "RGB".
pt_br: Em "Select a color scheme" (Selecionar um esquema de cores), deixe a configuração em "RGB".

source: For the channels
es: Para los canales
pt_br: Para os canais

source: “Set the image to be colored red” set to “Leave this black”.
es: "Colorear la imagen en rojo" en "Dejarla en negro".
pt_br: "Set the image to be colored red" (Definir a imagem para ser colorida de vermelho) definido como "Leave this black" (Deixar preto).

source: “Set the image to be colored green” set to “rawGFP”.
es: "Establecer la imagen para ser de color verde" establecido en "rawGFP".
pt_br: "Set the image to be colored green" (Definir a imagem para ser colorida de verde) definido como "rawGFP".

source: “Set the image to be colored blue” set to “rawDNA”.
es: "Establecer la imagen para ser de color azul" establecido en "rawDNA".
pt_br: "Set the image to be colored blue" (Definir a imagem para ser colorida em azul) definido como "rawDNA".

source: “Name the output image” can be set to “GFPandDNA” .
es: "Nombre de la imagen de salida" se puede establecer en "GFPandADN" .
pt_br: "Name the output image" (Nomear a imagem de saída) pode ser definido como "GFPandDNA".

source: “Relative weight”s for each of the channels can be left at 1.
es: "El peso relativo de cada canal puede dejarse en 1.
pt_br: Os "pesos relativos" para cada um dos canais podem ser deixados em 1.

source: **Overlaying the outlines onto the color image:**
es: **Superposición de los contornos sobre la imagen en color:**
pt_br: **Sobrepondo os contornos na imagem colorida:**

source: This module will overlay the outlines of your identified objects onto the color image. You may choose whatever color you like to show the outlines, but you may find it easiest to use something that contrasts with your color image. You may also overlay outlines on a grayscale image; if you have many types of objects and/or more than 3 channels it is often easier to overlay the objects for each channel onto that channel’s grayscale image and simply view them one at a time.
es: Este módulo superpondrá los contornos de sus objetos identificados en la imagen en color. Puede elegir el color que desee para mostrar los contornos, pero puede que le resulte más fácil utilizar algo que contraste con el color de su imagen. También puedes superponer contornos en una imagen en escala de grises; Si tiene muchos tipos de objetos y/o más de 3 canales, suele ser más fácil superponer los objetos de cada canal en la imagen en escala de grises de ese canal y simplemente verlos uno a la vez.
pt_br: Este módulo sobreporá os contornos dos objetos identificados na imagem colorida. Você pode escolher a cor que quiser para mostrar os contornos, mas pode achar mais fácil usar algo que contraste com sua imagem colorida. Você também pode sobrepor contornos em uma imagem em tons de cinza; se você tiver muitos tipos de objetos e/ou mais de 3 canais, geralmente é mais fácil sobrepor os objetos de cada canal na imagem em escala de cinza desse canal e simplesmente visualizá-los um de cada vez.

source: Click on the <img src="./TutorialImages/AddModule.png" width="35"/> button and add the module **OverlayOutlines** located under the *“Image Processing”* module category. Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> y agregue el módulo **OverlayOutlines** ubicado en la categoría de módulo *“Image Processing”*. Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="35"/> e adicione o módulo **OverlayOutlines** localizado na categoria do módulo *“Image Processing”*. Adicione-o ao pipeline clicando no botão <img src="./TutorialImages/AddToPipeline.png" width="160"/>.

source: “Display outlines on a blank image” should be set to “No”.
es: "Mostrar contornos en una imagen en blanco" debe ajustarse a "No".
pt_br: A opção "Exibir contornos em uma imagem em branco" deve ser definida como "Não".

source: The “Select image on which to display outlines” should be set to the “GFPandDNA” image we created in the last step.
es: La opción "Select image on which to display outlines" debe ajustarse a la imagen "GFPandDNA" que creamos en el último paso.
pt_br: A opção "Select image on which to display outlines" deve ser definida como a imagem "GFPandDNA" que criamos na última etapa.

source: “Name the output image” can be set to “CellAndNucleiOverlay” or some other descriptive name.
es: "Nombre de la imagen de salida" se puede establecer en "CellAndNucleiOverlay" o algún otro nombre descriptivo.
pt_br: "Name the output image" (Nomear a imagem de saída) pode ser definido como "CellAndNucleiOverlay" (Sobreposição de células e núcleos) ou algum outro nome descritivo.

source: The “Outline display mode” dropdown menu should be left at “Color”.
es: El menú desplegable "Modo de visualización del contorno" debe dejarse en "Color".
pt_br: O menu suspenso "Outline display mode" (Modo de exibição de contorno) deve ser deixado em "Color" (Cor).

source: “How to outline” can be left at the default (Inner).
es: "Cómo delinear" puede dejarse por defecto (Interior).
pt_br: "How to outline" pode ser deixado como padrão (Inner).

source: For “Select objects to display” select “Nuclei” from the dropdown menu.
es: En "Seleccionar objetos para mostrar", seleccione "Nuclei" en el menú desplegable.
pt_br: Em "Select objects to display" (Selecionar objetos para exibição), selecione "Nuclei" (Núcleos) no menu suspenso.

source: “Select outline color” can be left as red or set to some other contrasting color.
es: "Seleccionar color de contorno" puede dejarse en rojo o ajustarse a otro color que contraste.
pt_br: "Select outline color" (Selecionar cor do contorno) pode ser deixado como vermelho ou definido como alguma outra cor contrastante.

source: Click the “Add another outline” button, then repeat the previous 3 steps for “Cells”; you should select a different color for the outlines.
es: Haga clic en el botón "Añadir otro contorno" y repita los 3 pasos anteriores para "Cells"; deberá seleccionar un color diferente para los contornos.
pt_br: Clique no botão "Add another outline" (Adicionar outro contorno) e repita as três etapas anteriores para "Cells" (Células); você deve selecionar uma cor diferente para os contornos.

source: **Saving the overlay image:**
es: **Guardando la imagen superpuesta:**
pt_br: **Salvando a imagem de sobreposição:**

source: The **SaveImages** module can be used to either save images generated in any step of the pipeline or masks of the objects created. Here we will save the images to the DefaultOutput folder, but you can specify any other location, and additionally create subfolders based on the extracted metadata if you like.
es: El módulo **SaveImages** se puede utilizar para guardar imágenes generadas en cualquier paso del pipeline o máscaras de los objetos creados. Aquí guardaremos las imágenes en la carpeta DefaultOutput, pero puede especificar cualquier otra ubicación y, además, crear subcarpetas basadas en los metadatos extraídos si lo desea.
pt_br: O módulo **SaveImages** pode ser utilizado tanto para salvar imagens geradas em qualquer etapa do pipeline ou máscaras dos objetos criados. Aqui salvaremos as imagens na pasta DefaultOutput, mas você pode especificar qualquer outro local e, adicionalmente, criar subpastas com base nos metadados extraídos, se desejar.

source: Click on the <img src="./TutorialImages/AddModule.png" width="35"/> button and add the module **SaveImages** located under the *“File processing”* module category*.* Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> y agregue el módulo **SaveImages** ubicado en la categoría de módulos *“File processing”*. Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="35"/> e adicione o módulo **SaveImages** localizado na categoria do módulo *“Processamento de arquivo”**.* Adicione-o ao pipeline clicando no botão <span botão class='notranslate'><img src="./TutorialImages/AddToPipeline.png" width="160"/></span>.

source: For “Select the type of image to save”, select “Image”.
es: En "Seleccione el tipo de imagen que desea guardar", seleccione "Imagen".
pt_br: Em "Select the type of image to save" (Selecionar o tipo de imagem a ser salva), selecione "Image" (Imagem).

source: For “Select the image to save”, select your “CellAndNucleiOverlay” image you just created.
es: En "Seleccione la imagen que desea guardar", seleccione la imagen "CellAndNucleiOverlay" que acaba de crear.
pt_br: Em "Select the image to save" (Selecionar a imagem para salvar), selecione a imagem "CellAndNucleiOverlay" que você acabou de criar.

source: For “Select method for constructing file names”, keep it set at “From image filename”.
es: Para "Seleccionar método para construir nombres de archivo", manténgalo en "A partir de nombre de archivo de imagen".
pt_br: Em "Select method for constructing file names" (Selecionar método para construir nomes de arquivos), mantenha-o definido como "From image filename" (A partir do nome do arquivo da imagem).

source: For “Select image name for file prefix”, select the “rawGFP” image.
es: En "Seleccionar imágen para el prefijo del archivo", seleccione la imagen "rawGFP".
pt_br: Em "Select image name for file prefix" (Selecionar nome da imagem para o prefixo do arquivo), selecione a imagem "rawGFP".

source: Change the “Append a suffix to the image file name?” radio buttons to “Yes”.
es: Cambie los botones de opción "¿Añadir un sufijo al nombre del archivo de imagen?" a "Sí".
pt_br: Altere os botões de opção "Append a suffix to the image file name?" (Anexar um sufixo ao nome do arquivo de imagem?) para "Yes" (Sim).

source: Give the “Text to append to the image name” a descriptive name; “\_Overlay” is appropriate.
es: Dé al "Texto a añadir al nombre de la imagen" un nombre descriptivo; "\_Overlay" ("\_Superposición") es apropiado.
pt_br: Dê ao "Texto a ser anexado ao nome da imagem" um nome descritivo; "\_Overlay" é apropriado.

source: All the other settings may be left at their default values.
es: Todos los demás ajustes pueden dejarse en sus valores por defecto.
pt_br: Todas as outras configurações podem ser deixadas em seus valores padrão.

source: 8. **Exporting the measurements to a database**
es: 8. **Exportar las medidas a una base de datos**
pt_br: 8. **Exportando as medições para um banco de dados**

source: Since we will be using the data visualization and machine learning tools in CellProfiler Analyst, the measurements will need to be saved to a database using the **ExportToDatabase** module in order for CellProfiler Analyst to access them.
es: Dado que usaremos las herramientas de visualización de datos y aprendizaje automático en CellProfiler Analyst, las mediciones deberán guardarse en una base de datos usando el módulo **ExportToDatabase** para que CellProfiler Analyst pueda acceder a ellas.
pt_br: Como usaremos as ferramentas de visualização de dados e aprendizado de máquina no CellProfiler Analyst, as medições precisarão ser salvas em um banco de dados usando o módulo **ExportToDatabase** para que o CellProfiler Analyst possa acessá-las.

source: Click on the <img src="./TutorialImages/AddModule.png" width="35"/> button and add the module **ExportToDatabase** located under the module category *“File Processing”.* Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> y agregue el módulo **ExportToDatabase** ubicado en la categoría de módulo *“Procesamiento de archivos”.* Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="35"/> e adicione o módulo **ExportToDatabase** localizado na categoria do módulo *“Processamento de arquivo”.* Adicione-o ao pipeline clicando em <span class= Botão 'notranslate'><img src="./TutorialImages/AddToPipeline.png" width="160"/></span>.

source: Note that while in Test mode, the **ExportToDatabase** module will have a yellow warning sign in the pipeline panel and yellow- highlighted text in the module settings. Holding the mouse over the yellow-highlighted text informs the user that measurements produced in Test mode are not written to the database. This is normal behavior and does not indicate an error.
es: Tenga en cuenta que mientras esté en modo de prueba, el módulo **ExportToDatabase** tendrá una señal de advertencia amarilla en el panel pipeline y un texto resaltado en amarillo en la configuración del módulo. Al mantener el mouse sobre el texto resaltado en amarillo, se informa al usuario que las mediciones producidas en el modo de prueba no se escriben en la base de datos. Este es un comportamiento normal y no indica un error.
pt_br: Observe que enquanto estiver no modo de teste, o módulo **ExportToDatabase** terá um sinal de aviso amarelo no painel do pipeline e texto destacado em amarelo nas configurações do módulo. Manter o mouse sobre o texto destacado em amarelo informa ao usuário que as medições produzidas no modo Teste não são gravadas no banco de dados. Este é um comportamento normal e não indica um erro.

source: Select “Database type” as “SQLite.”
es: Selecciona "Tipo de base de datos" como "SQLite".
pt_br: Selecione "Tipo de banco de dados" como "SQLite".

source: Check the box labeled “Create a CellProfiler Analyst properties file.” A number of new settings will subsequently appear underneath.
es: Marque la casilla "Crear un archivo de propiedades de CellProfiler Analyst". A continuación aparecerá una serie de nuevos ajustes.
pt_br: Marque a caixa "Create a CellProfiler Analyst properties file" (Criar um arquivo de propriedades do CellProfiler Analyst). Várias novas configurações aparecerão em seguida.

source: For “Which objects should be used for locations?”, select “Nuclei”.
es: En "¿Qué objetos deben utilizarse para las localizaciones?", seleccione "Nuclei".
pt_br: Em "Which objects should be used for locations?" (Quais objetos devem ser usados para localizações?), selecione "Nuclei" (Núcleos).

source: For “Select the plate type”, choose “96.”
es: Para "Seleccionar el tipo de placa", elija "96".
pt_br: Em "Select the plate type" (Selecionar o tipo de placa), escolha "96".

source: For “Select the plate metadata,” choose “Plate.”
es: Para "Seleccionar los metadatos de la placa", elija "Plate".
pt_br: Em "Select the plate metadata" (Selecionar metadados da placa), escolha "Plate" (Placa).

source: For “Select the well metadata,” choose “Well.”
es: Para "Seleccionar los metadatos del pocillo", elija "Well".
pt_br: Em "Select the well metadata" (Selecionar os metadados do poço), escolha "Well" (Poço).

source: For “Output file location”, select “Default Output Folder”.
es: En "Ubicación del archivo de salida", seleccione "Carpeta de salida predeterminada".
pt_br: Em "Output file location" (Local do arquivo de saída), selecione "Default Output Folder" (Pasta de saída padrão).

source: Check the box “Write image thumbnails directly to database?” From the list-box that subsequently appears, select “rawDNA” and “rawGFP”; you can make multiple selections by using Ctrl-click (Windows) or Command-click (Mac). Leave the rest of the settings at the default values.
es: Marque la casilla "¿Escribir miniaturas de imágenes directamente en la base de datos?". En la lista desplegable que aparece a continuación, seleccione "rawDNA" y "rawGFP"; puede hacer selecciones múltiples pulsando Ctrl-clic (Windows) o Cmd-clic (Mac). Deje el resto de la configuración en los valores por defecto.
pt_br: Marque a caixa "Write image thumbnails directly to database?" (Gravar miniaturas de imagem diretamente no banco de dados?) Na caixa de listagem que aparece em seguida, selecione "rawDNA" e "rawGFP"; você pode fazer várias seleções usando Ctrl-clique (Windows) ou Command-clique (Mac). Deixe o restante das configurações com os valores padrão.

source: 9. **Using the optimized pipeline to automatically analyze all images generated by the screening experiment**
es: 9. **Usar el pipeline optimizado para analizar automáticamente todas las imágenes generadas por el experimento**
pt_br: 9. **Usando o pipeline otimizado para analisar automaticamente todas as imagens geradas pelo experimento de triagem**

source: At this point, the settings you have entered were chosen for you because those settings specifically, when used with these images, result in an optimized pipeline for a suitable number of images. Therefore your pipeline is now ready to run on the full data set of 26 images.
es: En este punto, los ajustes que ha introducido han sido elegidos para usted porque esos ajustes específicamente, cuando se utilizan con estas imágenes, dan como resultado un pipeline optimizado para un número adecuado de imágenes. Por lo tanto, su pipeline está ahora listo para ejecutarse en el conjunto completo de datos de 26 imágenes.
pt_br: Neste ponto, as configurações que você inseriu foram escolhidas para você porque essas configurações especificamente, quando usadas com essas imagens, resultam em um pipeline otimizado para um número adequado de imagens. Portanto, seu pipeline agora está pronto para ser executado no conjunto de dados completo de 26 imagens.

source: Exit Test Mode by clicking the “Exit Test Mode” button at the bottom-left of the CellProfiler interface.
es: Salga del Modo de Prueba haciendo clic en el botón "Salir del Modo de Prueba" en la parte inferior izquierda de la interfaz de CellProfiler.
pt_br: Saia do modo de teste clicando no botão "Exit Test Mode" (Sair do modo de teste) na parte inferior esquerda da interface do CellProfiler.
