Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/Translocation.po
Languages: es, pt_br

source: Translocation Tutorial
es: Tutorial de Translocación
pt_br: Tutorial de translocação

source: **Image-based screening using subcellular localization of FOXO1A in osteosarcoma cells: A computer exercise using CellProfiler & CellProfiler Analyst software**
es: **Screening basado en imágenes utilizando la localización subcelular de FOXO1A en células de osteosarcoma: un ejercicio informático utilizando los softwares CellProfiler y CellProfiler Analyst**
pt_br: **Triagem baseada em imagens usando localização subcelular de FOXO1A em células de osteossarcoma: um exercício de computador usando o software CellProfiler e CellProfiler Analyst**

source: Beth Cimini, Carolina Wählby, Martin Simonsson, Megan Rokop and Mark Bray, Broad Institute
es: Beth Cimini, Carolina Wählby, Martin Simonsson, Megan Rokop y Mark Bray, Instituto Broad
pt_br: Beth Cimini, Carolina Wählby, Martin Simonsson, Megan Rokop e Mark Bray, Broad Institute

source: **Background information:**
es: **Sobre las imágenes de este ejercicio:**
pt_br: **Informações gerais:**

source: In this experiment, we are working with human U2OS osteosarcoma (bone cancer) cells, in which a Forkhead-protein FOXO1A has been labeled with GFP (Green Fluorescent Protein). In proliferating cells, FOXO1A is localized in the cytoplasm; it is constantly moving into the nucleus, but is transported out again by export proteins. Upon inhibition of nuclear export, FOXO1A accumulates in the nucleus. We know that 150nM of Wortmannin (the drug we are using as a positive control in this experiment) inhibits transport of the FOXO1A protein from the nucleus back out to the cytoplasm (Fig. 1). Labeling FOXO1A with GFP allows us to visualize its subcellular localization. The goal of developing image-based screens of this type is to aid in the search for unknown drugs that have the same effect as Wortmannin on FOXO1A subcellular localization (and hence may be possible treatments for osteosarcoma patients), but possess fewer side effects than the known drugs.
es: En este experimento trabajamos con células humanas de osteosarcoma (cáncer de hueso) U2OS, en las que se ha marcado con GFP (proteína verde fluorescente) una proteína Forkhead FOXO1A. En las células en proliferación, FOXO1A se localiza en el citoplasma; se desplaza constantemente al núcleo, pero es transportada de nuevo al exterior por proteínas de exportación. Al inhibir la exportación nuclear, FOXO1A se acumula en el núcleo. Sabemos que 150nM de Wortmannin (el fármaco que utilizamos como control positivo en este experimento) inhibe el transporte de la proteína FOXO1A desde el núcleo al citoplasma (Fig. 1). La marcación de FOXO1A con GFP nos permite visualizar su localización subcelular. El objetivo de desarrollar ensayos basados en imágenes de este tipo es ayudar en la búsqueda de fármacos desconocidos que tengan el mismo efecto que Wortmannin en la localización subcelular de FOXO1A (y por lo tanto puedan ser posibles tratamientos para pacientes con osteosarcoma), pero que posean menos efectos secundarios que los fármacos conocidos.
pt_br: Neste experimento, estamos trabalhando com células humanas de osteossarcoma (câncer ósseo) U2OS, nas quais uma proteína Forkhead FOXO1A foi marcada com GFP (Green Fluorescent Protein). Nas células em proliferação, a FOXO1A está localizada no citoplasma; ela se move constantemente para o núcleo, mas é transportada para fora novamente por proteínas de exportação. Após a inibição da exportação nuclear, a FOXO1A se acumula no núcleo. Sabemos que 150nM de Wortmannin (a droga que estamos usando como controle positivo neste experimento) inibe o transporte da proteína FOXO1A do núcleo de volta para o citoplasma (Fig. 1). A marcação da FOXO1A com GFP nos permite visualizar sua localização subcelular. O objetivo do desenvolvimento de telas baseadas em imagens desse tipo é ajudar na busca de medicamentos desconhecidos que tenham o mesmo efeito que a Wortmannin na localização subcelular da FOXO1A (e, portanto, possam ser possíveis tratamentos para pacientes com osteossarcoma), mas que tenham menos efeitos colaterais do que os medicamentos conhecidos.

source: *Figure 1: Examples of FOXO1A-GFP localization. <u>**Left:**</u> Cytoplasmic localization in untreated cells. <u>**Right:**</u> Nuclear localization in Wortmannin treated cells. <br> Green: **GFP**, Magenta: **DNA**.*
es: *Figura 1: Ejemplos de localización de FOXO1A-GFP. <u>**Izquierda:**</u> Localización citoplasmática en células sin tratar. <u>**Derecha:**</u> Localización nuclear en células tratadas con Wortmannin. <br> Verde: **GFP**, Magenta: **ADN**.*
pt_br: *Figura 1: Exemplos de localização FOXO1A-GFP. <u>**Esquerda:**</u> Localização citoplasmática em células não tratadas. <u>**Certo:**</u> Localização nuclear em células tratadas com Wortmannin. <br> Verde: **GFP**, Magenta: **DNA**.*

source: **Goals of this exercise:**
es: **Objetivos de este ejercicio:**
pt_br: **Objetivos deste exercício

source: In this exercise, we aim to: (1) determine this lowest possible dose necessary to observe this effect, and (2) to optimize the analysis of images in which FOXO1A is cytoplasmic versus nuclear, in order to separate positive controls and negative controls as best as possible.
es: En este ejercicio, nuestro objetivo es: (1) determinar la dosis más baja posible necesaria para observar este efecto, y (2) optimizar el análisis de imágenes en las que FOXO1A es citoplasmático versus nuclear, para separar los controles positivos y los controles negativos lo mejor posible.
pt_br: Neste exercício, pretendemos: (1) determinar a dose mais baixa possível necessária para observar este efeito, e (2) otimizar a análise de imagens nas quais FOXO1A é citoplasmática versus nuclear, a fim de separar controles positivos e controles negativos como melhor possível.

source: **Materials necessary for this exercise:**
es: **Materiales necesarios para este ejercicio:**
pt_br: **Materiais necessários para este exercício:**

source: The images you will be analyzing were taken from cells growing in a standard 96-well plate, but you will work with a subset of only 26 of these images: 8 wells were left untreated (and were therefore negative controls), 8 wells were treated with the maximum dose of the drug Wortmannin (and were therefore positive controls), and 10 wells were used to create a dose gradient with increasing concentration of the drug. In addition to these images, a text file called “Translocation_doses_and_controls.csv” is provided, containing information about where on the 96-well plate the wells were located, and how the cells were treated.
es: Las imágenes que analizarás fueron tomadas de células crecidas en una placa estándar de 96 pocillos, pero trabajarás con un subconjunto de solo 26 de estas imágenes: 8 pocillos no se trataron (y, por lo tanto, son controles negativos), 8 pocillos se trataron con la dosis máxima del medicamento Wortmannin (y, por lo tanto, son controles positivos) y 10 pocillos se usaron para crear un gradiente de dosis. con concentraciones crecientes del fármaco. Además de estas imágenes, se proporciona también un archivo de texto llamado “Translocation_doses_and_controls.csv”, que contiene información sobre en qué parte de la placa de 96 pocillos se ubicaron los pocillos y cómo fueron tratadas las células.
pt_br: As imagens que você analisará foram tiradas de células crescendo em uma placa padrão de 96 poços, mas você trabalhará com um subconjunto de apenas 26 dessas imagens: 8 poços foram deixados sem tratamento (e, portanto, eram controles negativos), 8 poços foram tratados com a dose máxima do medicamento Wortmannin (e foram, portanto, controles positivos), e 10 poços foram usados para criar um gradiente de dose com o aumento da concentração do medicamento. Além dessas imagens, é fornecido um arquivo de texto chamado “Translocation_doses_and_controls.csv”, contendo informações sobre onde os poços estavam localizados na placa de 96 poços e como as células foram tratadas.

source: **Methods to be used in this exercise:**
es: **Métodos a utilizar en este ejercicio:**
pt_br: **Métodos a serem usados neste exercício:**

source: In this exercise, you will use CellProfiler and CellProfiler Analyst to identify and delineate (or “segment”) each nucleus and cell body, and extract a number of measurements from each cell. You have a total of 26 images, with approximately 200 cells per image, so you want to automate the process of identifying and segmenting the cells. The first task is to set up a CellProfiler **pipeline** consisting of a number of individual **modules**; each module performs a unique image-processing step, and multiple modules can be arranged such that they are executed in sequential order. You will test your pipeline on a few images so that you can optimize the settings. Once optimization is complete, you will run the pipeline on all the images in the experiment, collect measurements from each cell and store them in a database. At this point, you will use CellProfiler Analyst to visualize your data, and use its machine learning tool to train the computer to distinguish between treated and untreated cells.
es: En este ejercicio, utilizará CellProfiler y CellProfiler Analyst para identificar y delinear (o "segmentar") cada núcleo y cuerpo celular, y extraer una serie de medidas de cada célula. Tiene un total de 26 imágenes, con aproximadamente 200 células por imagen, por lo que desea automatizar el proceso de identificación y segmentación de las células. La primera tarea consiste en configurar una **línea de producción** (o *pipeline*) de CellProfiler que conste de una serie de **módulos** individuales; cada módulo realiza un único paso de procesamiento de imágenes y se pueden organizar varios módulos de forma que se ejecuten en orden secuencial. Usted probará su pipeline en unas pocas imágenes para que pueda optimizar los ajustes. Una vez completada la optimización, ejecutará la pipeline en todas las imágenes del experimento, recogerá las mediciones de cada célula y las almacenará en una base de datos. En este punto, utilizará CellProfiler Analyst para visualizar sus datos, y utilizará su herramienta de aprendizaje automático para entrenar a la computadora a distinguir entre células tratadas y no tratadas.
pt_br: Neste exercício, você usará o CellProfiler e o CellProfiler Analyst para identificar e delinear (ou "segmentar") cada núcleo e corpo celular e extrair várias medidas de cada célula. Você tem um total de 26 imagens, com aproximadamente 200 células por imagem, portanto, deseja automatizar o processo de identificação e segmentação das células. A primeira tarefa é configurar um **pipeline** do CellProfiler que consiste em vários **módulos** individuais; cada módulo executa uma etapa exclusiva de processamento de imagem e vários módulos podem ser organizados de forma que sejam executados em ordem sequencial. Você testará seu pipeline em algumas imagens para poder otimizar as configurações. Quando a otimização estiver concluída, você executará o pipeline em todas as imagens do experimento, coletará medições de cada célula e as armazenará em um banco de dados. Nesse ponto, você usará o CellProfiler Analyst para visualizar seus dados e usará sua ferramenta de aprendizado de máquina para treinar o computador para distinguir entre células tratadas e não tratadas.

source: Exercise I: Using the CellProfiler software to identify features and obtain measurements from cellular images.
es: Ejercicio I: Uso del software CellProfiler para identificar características y obtener medidas a partir de imágenes celulares.
pt_br: Exercício I: Uso do software CellProfiler para identificar características e obter medições de imagens celulares.

source: 1. **Starting CellProfiler and configuring the input data for analysis**
es: 1. **Iniciar CellProfiler y configurar los datos de entrada para el análisis**
pt_br: 1. **Iniciando o CellProfiler e configurando os dados de entrada para análise**

source: Start CellProfiler by double-clicking the desktop icon <img src="./TutorialImages/CellProfilerLogo.png" width="35"/>
es: Inicie CellProfiler haciendo doble clic en el icono del escritorio <img src="./TutorialImages/CellProfilerLogo.png" width="35"/>
pt_br: Inicie o CellProfiler clicando duas vezes no ícone da área de trabalho <img src="./TutorialImages/CellProfilerLogo.png" width="35"/>

source: In the CellProfiler interface, you will see the File List panel, a blank panel indicated by the text “Drop files and folders here”. The File list panel is the main interface of the **Images** module, which compiles a list of files and/or folders that you want to analyze; this module is highlighted in the **Input** modules panel which is located at the upper-left of CellProfiler.
es: En la interfaz de CellProfiler, verá el panel Lista de archivos, un panel en blanco indicado por el texto “Drop files and folders here” ("Soltar archivos y carpetas aquí"). El panel Lista de archivos es la interfaz principal del módulo **Images**, que compila una lista de archivos y/o carpetas que desea analizar; Este módulo está resaltado en el panel de módulos de **Input** que se encuentra en la parte superior izquierda de CellProfiler.
pt_br: Na interface do CellProfiler, você verá o painel Lista de Arquivos, um painel em branco indicado pelo texto “Solte arquivos e pastas aqui”. O painel Lista de arquivos é a interface principal do módulo **Imagens**, que compila uma lista de arquivos e/ou pastas que você deseja analisar; este módulo é destacado no painel **Input** Modules, localizado na parte superior esquerda do CellProfiler.

source: From File Explorer (Windows) or Finder (Mac), drag and drop the “TranslocationData” folder into this panel. The names of your files in the TranslocationData folder should now appear in the File list panel. Double-click on “BBBC013_A01_s1_w1.tif” and “BBBC013_A12_s1_w1.tif” to see what examples of negative and positive GFP controls look like, respectively.
es: Desde el Explorador de archivos (Windows) o el Finder (Mac), arrastre y suelte la carpeta "TranslocationData" en este panel. Los nombres de sus archivos en la carpeta TranslocationData ahora deberían aparecer en el panel de lista de archivos. Haga doble clic en “BBBC013_A01_s1_w1.tif” y “BBBC013_A12_s1_w1.tif” para ver cómo se ven ejemplos de controles GFP negativos y positivos, respectivamente.
pt_br: No File Explorer (Windows) ou Finder (Mac), arraste e solte a pasta “TranslocationData” neste painel. Os nomes dos seus arquivos na pasta TranslocationData agora devem aparecer no painel Lista de arquivos. Clique duas vezes em “BBBC013_A01_s1_w1.tif” e “BBBC013_A12_s1_w1.tif” para ver como são os exemplos de controles GFP negativos e positivos, respectivamente.

source: Scroll to the bottom of the File list and note that in addition to the image files, there is a file called “Translocation_doses_and_controls.csv”. We only want image files to be analyzed in CellProfiler so this file needs to be removed from consideration. To do this, follow the next step.
es: Desplácese hasta el final de la lista de Archivos y observe que además de los archivos de imagen, hay un archivo llamado "Translocation_doses_and_controls.csv". Solo queremos que los archivos de imagen se analicen en CellProfiler, por lo que este archivo debe ser ignorado. Para hacer esto, siga el siguiente paso.
pt_br: Role até o final da lista Arquivo e observe que além dos arquivos de imagem, existe um arquivo chamado “Translocation_doses_and_controls.csv”. Queremos apenas que os arquivos de imagem sejam analisados no CellProfiler, portanto, esse arquivo precisa ser removido de consideração. Para fazer isso, siga a próxima etapa.

source: Under the Module settings panel (below the File list), you will see a control for specifying which files should be used from the above list. Select "Images only" from the Filter Images dropdown menu. Click on the <img src="./TutorialImages/ApplyFilters.png" width="150"/> button to filter out the non-image files. You will see that the CSV file is then grayed-out in the list, indicating that it will not be used.
es: En el panel de configuración del módulo (debajo de la lista de Archivos), verá un control para especificar qué archivos deben usarse de la lista anterior. Seleccione "Images only" en el menú desplegable "Filter images". Haga clic en el botón <img src="./TutorialImages/ApplyFilters.png" width="150"/> para filtrar los archivos que no son de imágenes. Verá que el archivo CSV aparece atenuado en la lista, lo que indica que no se utilizará.
pt_br: No painel Configurações do módulo (abaixo da lista Arquivo), você verá um controle para especificar quais arquivos devem ser usados na lista acima. Selecione "Somente imagens" no menu suspenso Filtrar imagens. Clique no botão <img src="./TutorialImages/ApplyFilters.png" width="150"/> para filtrar os arquivos que não são de imagem. Você verá que o arquivo CSV fica esmaecido na lista, indicando que não será usado.

source: Click on the **Metadata** module, which is the second module in the Input module panel; this module allows you to provide information about the drug dosages and location on the plate.
es: Haga clic en el módulo **Metadata**, que es el segundo módulo en el panel módulos de entrada; este módulo le permite proporcionar información sobre las dosis de los medicamentos y su ubicación en la placa.
pt_br: Clique no módulo **Metadados**, que é o segundo módulo no painel Módulo de entrada; este módulo permite fornecer informações sobre as dosagens dos medicamentos e localização na placa.

source: The first extraction set up for you in the **Metadata** module extracts information about the plate, well, site, and channel of each image by parsing the file name.
es: La primera extracción configurada para usted en el módulo **Metadata** extrae información sobre la placa, pocillo, campo y canal de cada imagen analizando el nombre del archivo.
pt_br: A primeira extração configurada para você no módulo **Metadados** extrai informações sobre a placa, poço, local e canal de cada imagem analisando o nome do arquivo.

source: Click the <img src="./TutorialImages/ReGexCheck.png" width="35"/> icon to the right of the text box labeled “Regular expression”.
es: Haga clic en el icono <img src="./TutorialImages/ReGexCheck.png" width="35"/> a la derecha del cuadro de texto denominado "Regular expression".
pt_br: Clique no ícone <img src="./TutorialImages/ReGexCheck.png" width="35"/> à direita da caixa de texto chamada “Expressão regular”.

source: A new dialog box will appear to assist in comparing the entered regular expression against an example image filename.
es: Aparecerá un nuevo cuadro de diálogo que le ayudará a comparar la expresión regular introducida con un nombre de archivo de imagen de ejemplo.
pt_br: Uma nova caixa de diálogo será exibida para ajudar a comparar a expressão regular inserida com um exemplo de nome de arquivo de imagem.

source: You will see the color of the “Plate”, “Well”, “Site” and “ChannelNumber” text match the color of the corresponding portion in the Test text below.
es: Verá que el color de los textos "Plate" (Placa), "Well" (Pocillo), "Site" (Sitio) y "ChannelNumber" (Número de canal) coincide con el color de la parte correspondiente en el texto de prueba que aparece a continuación.
pt_br: Você verá que a cor do texto "Plate", "Well", "Site" e "ChannelNumber" corresponde à cor da parte correspondente no texto do teste abaixo.

source: Once finished, click the “Submit” button to use this expression in the **Metadata** module.
es: Una vez terminado, haga clic en el botón "Submit" para usar esta expresión en el módulo **Metadata**.
pt_br: Ao terminar, clique no botão “Enviar” para usar esta expressão no módulo **Metadados**.

source: The second metadata extraction step requires you to tell CellProfiler the location of a CSV file. It is looking for it in CellProfiler's Default Input Folder, which we must therefore configure.
es: El segundo paso de extracción de metadatos requiere indicarle a CellProfiler la ubicación de un archivo CSV. Lo busca en la Carpeta de Entrada Predeterminada (Default Input) de CellProfiler que, por lo tanto, debemos configurar.
pt_br: A segunda etapa de extração de metadados exige que você informe ao CellProfiler o local de um arquivo CSV. Ele o está procurando na Default Input Folder (Pasta de entrada padrão) do CellProfiler, que deve ser configurada.

source: This is the file describing the image names, locations in the 96-well plate, and doses.
es: Este es el archivo que describe los nombres de las imágenes, las ubicaciones en la placa de 96 pocillos y las dosis.
pt_br: Esse é o arquivo que descreve os nomes das imagens, os locais na placa de 96 poços e as doses.

source: Click the file selection box next to "Metadata file name" line and navigate to the location of the TranslocationData folder on your computer, then select the **Translocation_doses_and_controls.csv** file within.
es: Haga clic en el cuadro de selección de archivos situado junto a la línea "Nombre del archivo de metadatos" y navegue hasta la ubicación de la carpeta TranslocationData en su computadora; a continuación, seleccione el archivo **Translocation_doses_and_controls.csv** que contiene.
pt_br: Clique na caixa de seleção de arquivo ao lado da linha "Metadata file name" (Nome do arquivo de metadados) e navegue até o local da pasta TranslocationData em seu computador e, em seguida, selecione o arquivo **Translocation_doses_and_controls.csv** dentro dela.

source: Return to the **Metadata** module and press ‘Update’. You should now see a number of columns in the Metadata window.
es: Regrese al módulo **Metadata** y presione 'Update'. Ahora debería ver varias columnas en la ventana de Metadatos.
pt_br: Retorne ao módulo **Metadados** e pressione ‘Atualizar’. Agora você deve ver várias colunas na janela Metadados.

source: If you examine the metadata matching, you can see that “Well” is selected from both drop-downs under “CSV Metadata” and “Image Metadata”. This indicates that the information stored in the CSVs "Well" column should be matched to the well metadata values obtained from the filename in the first extraction step.
es: Si examina la correspondencia de metadatos, puede ver que "Well" está seleccionado en ambos desplegables de "Metadatos CSV" y "Metadatos de imagen". Esto indica que la información almacenada en la columna "Well" del CSV debe compararse con los valores de metadatos del pocillo obtenidos a partir del nombre del archivo en el primer paso de extracción.
pt_br: Se você examinar a correspondência de metadados, verá que "Well" (Poço) está selecionado nos dois menus suspensos em "CSV Metadata" (Metadados de CSV) e "Image Metadata" (Metadados de imagem). Isso indica que as informações armazenadas na coluna "Well" dos CSVs devem ser combinadas com os valores de metadados do poço obtidos do nome do arquivo na primeira etapa de extração.

source: Next to the setting labeled “Metadata data type”, make sure “Choose for each” is selected from the drop-down. For the “Dose” metadata, select “Float” as the data type. Leave the remaining metadata at the default “Text” values.
es: Junto a la opción "Tipo de datos de metadatos", asegúrese de que la opción "Elegir para cada" está seleccionada en el menú desplegable. Para los metadatos "Dose" (Dosis), seleccione "Float" como tipo de datos. Deje el resto de metadatos con los valores por defecto "Text".
pt_br: Ao lado da configuração denominada "Metadata data type" (Tipo de dados de metadados), certifique-se de que a opção "Choose for each" (Escolher para cada) esteja selecionada no menu suspenso. Para os metadados de "Dose", selecione "Float" (Flutuação) como o tipo de dados. Deixe os metadados restantes com os valores padrão de "Texto".
