Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/Translocation.po
Languages: es, pt_br

source: For the “Select the input image” module setting, select “rawGFP” from the drop-down list.
es: Para la configuración del módulo "Seleccionar la imagen de entrada", seleccione "rawGFP" en la lista desplegable.
pt_br: Para a configuração do módulo "Select the input image" (Selecionar a imagem de entrada), selecione "rawGFP" na lista suspensa.

source: For the “Select input objects” setting, select “Nuclei” from the drop-down list.
es: En "Seleccionar objetos de entrada", seleccione "Núcleos" en la lista desplegable.
pt_br: Na configuração "Select input objects" (Selecionar objetos de entrada), selecione "Nuclei" (Núcleos) na lista suspensa.

source: For the “Name the objects to be identified” setting, enter “Cells” as a descriptive name for the secondary objects.
es: En la opción "Nombre de los objetos a identificar", introduzca "Cells" (Células) como nombre descriptivo de los objetos secundarios.
pt_br: Para a configuração "Name the objects to be identified" (Nomear os objetos a serem identificados), digite "Cells" (Células) como um nome descritivo para os objetos secundários.

source: Click the drop-down box next to “Threshold strategy” and select “Global.” Then, click the drop-down next to “Thresholding method to select “Otsu”.
es: Haga clic en el desplegable junto a "Estrategia de umbralización" y seleccione "Global". A continuación, haz clic en el desplegable junto a "Método de umbralización" para seleccionar "Otsu".
pt_br: Clique na caixa suspensa ao lado de "Threshold strategy" (Estratégia de limite) e selecione "Global". Em seguida, clique na caixa suspensa ao lado de "Thresholding method" para selecionar "Otsu".

source: Click the setting labeled “Two-class or three-class thresholding?” and change it from “Two classes” to “Three classes.” Change the setting “Assign pixels…” that subsequently appears underneath to “Foreground”
es: Haga clic en el ajuste "Umbralización de dos o tres clases?" y cámbielo de "Dos clases" a "Tres clases". Cambie el ajuste "Asignar píxeles..." que aparece posteriormente debajo a "Foreground" (primer plano).
pt_br: Clique na configuração "Two-class or three-class thresholding?" (Limiar de duas ou três classes?) e altere-a de "Two classes" (Duas classes) para "Three classes" (Três classes). Altere a configuração "Assign pixels..." (Atribuir pixels...) que aparece em seguida para "Foreground" (Primeiro plano)

source: Click on the <img src="./TutorialImages/Step.png" width="120"/> button to execute the module and see the results of secondary object identification using the module settings (Fig. 4).
es: Haga clic en el botón <img src="./TutorialImages/Step.png" width="120"/> para ejecutar el módulo y ver los resultados de la identificación de objetos secundarios usando la configuración del módulo (Fig. 4).
pt_br: Clique no botão <img src="./TutorialImages/Step.png" width="120"/> para executar o módulo e ver os resultados da identificação do objeto secundário usando as configurações do módulo (Fig. 4).

source: By default, secondary objects are identified with the Propagation method, which defines cell boundaries by “growing” outwards from the primary objects, i.e. the nuclei, and taking into account both the distance from the nearest primary object, and the local intensity in the GFP image.
es: Por defecto, los objetos secundarios se identifican con el método de Propagación, que define los límites celulares "creciendo" hacia el exterior desde los objetos primarios, es decir, los núcleos, y teniendo en cuenta tanto la distancia desde el objeto primario más cercano, como la intensidad local en la imagen GFP.
pt_br: Por padrão, os objetos secundários são identificados com o método Propagation, que define os limites das células "crescendo" para fora dos objetos primários, ou seja, os núcleos, e levando em conta a distância do objeto primário mais próximo e a intensidade local na imagem GFP.

source: Note that the pink and green outlines do not have the same meaning as in the *IdentifyPrimaryObjects* display window. In *IdentifySecondaryObjects*, the pink outlines indicate the secondary object boundaries and the green outlines indicate the primary object boundaries.
es: Tenga en cuenta que los contornos rosa y verde no tienen el mismo significado que en la ventana de visualización *IdentifyPrimaryObjects*. En *IdentifySecondaryObjects*, los contornos rosas indican los límites de los objetos secundarios y los verdes los de los primarios.
pt_br: Observe que os contornos rosa e verde não têm o mesmo significado que na janela de exibição *IdentifyPrimaryObjects*. Em *IdentifySecondaryObjects*, os contornos rosa indicam os limites do objeto secundário e os contornos verdes indicam os limites do objeto primário.

source: *Figure 4: Example module display window for IdentifySecondaryObjects*
es: *Figura 4: Ejemplo de ventana de visualización del módulo para IdentifySecondaryObjects*
pt_br: *Figura 4: Exemplo de janela de exibição do módulo para IdentificarSecondaryObjects*

source: In contrast to the DNA stain in **IdentifyPrimaryObjects**, the middle intensity levels associated with the dim cells are assigned as foreground pixels, so that the secondary objects captures both the dim and bright cells.
es: A diferencia de la marcación de ADN en **IdentifyPrimaryObjects**, los niveles de intensidad medios asociados con células tenues se asignan como píxeles de primer plano (foreground), de modo que los objetos secundarios capturan tanto las células tenues como las más intensas.
pt_br: Em contraste com a coloração de DNA em **IdentifyPrimaryObjects**, os níveis de intensidade média associados às células escuras são atribuídos como pixels de primeiro plano, de modo que os objetos secundários capturem as células escuras e brilhantes.

source: However, for this assay, we may prefer to use a segmentation method that reflects the actual cell boundaries and is not dependent on an intensity that varies from treatment to treatment. We will take a look at the Distance-N method which expands outward from the nucleus a fixed number of pixels without regard to the underlying fluorescence.
es: Sin embargo, para este ensayo, es posible que prefiramos utilizar un método de segmentación que refleje los límites reales de la célula y no dependa de una intensidad que varía de un tratamiento a otro. Echaremos un vistazo al método "Distance-N", que expande hacia fuera del núcleo un número fijo de píxeles sin tener en cuenta la fluorescencia subyacente.
pt_br: No entanto, para esse ensaio, podemos preferir usar um método de segmentação que reflita os limites reais da célula e não dependa de uma intensidade que varia de um tratamento para outro. Daremos uma olhada no método Distance-N, que expande para fora do núcleo um número fixo de pixels sem levar em conta a fluorescência subjacente.

source: Change the “Select method…” setting from “Propagation” to “Distance-N.”
es: Cambia el ajuste "Seleccionar método..." de "Propagación" a "Distancia-N".
pt_br: Altere a configuração "Select method..." (Selecionar método...) de "Propagation" (Propagação) para "Distance-N" (Distância-N).

source: Change the setting “Number of pixels by which to expand…” that appears underneath to 10 pixels.
es: Cambie el ajuste "Número de píxeles por los que ampliar..." que aparece debajo a 10 píxeles.
pt_br: Altere a configuração "Number of pixels by which to expand..." (Número de pixels para expandir...) que aparece abaixo para 10 pixels.

source: Click the <img src="./TutorialImages/Step.png" width="120"/> button to see the result from your new settings.
es: Haga clic en el botón <img src="./TutorialImages/Step.png" width="120"/> para ver el resultado de su nueva configuración.
pt_br: Clique no botão <img src="./TutorialImages/Step.png" width="120"/> para ver o resultado de suas novas configurações.

source: 5. **Identifying the cytoplasm as a “tertiary object”**
es: 5. **Identificar el citoplasma como un “objeto terciario”**
pt_br: 5. **Identificando o citoplasma como um “objeto terciário”**

source: Once we have identified the nucleus and the cell body, these two objects can be used to define the cell cytoplasm as the region outside the nucleus, but within the cell boundary. We will use the **IdentifyTertiaryObjects** module which will take the smaller identified objects and “subtract” (or remove) them from the larger identified objects, effectively identifying the cytoplasm.
es: Una vez que hemos identificado el núcleo y el cuerpo de la célula, estos dos objetos se pueden usar para definir el citoplasma como la región exterior al núcleo, pero dentro del límite celular. Usaremos el módulo **IdentifyTertiaryObjects** que tomará los objetos identificados más pequeños y los “restará” (o eliminará) de los objetos identificados más grandes, identificando efectivamente el citoplasma.
pt_br: Depois de identificarmos o núcleo e o corpo celular, esses dois objetos podem ser usados para definir o citoplasma celular como a região fora do núcleo, mas dentro dos limites da célula. Usaremos o módulo **IdentifyTertiaryObjects** que pegará os objetos menores identificados e os “subtrairá” (ou removerá) dos objetos maiores identificados, identificando efetivamente o citoplasma.

source: Click on the <img src="./TutorialImages/AddModule.png" width="40"/> button and add the module **IdentifyTertiaryObjects** located under the module category *“Object Processing”.* Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="40"/> y agregue el módulo **IdentifyTertiaryObjects** ubicado en la categoría de módulos *“Object Processing”*. Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="40"/> e adicione o módulo **IdentifyTertiaryObjects** localizado na categoria do módulo *“Object Processing”.* Adicione-o ao pipeline clicando em <span class= Botão 'notranslate'><img src="./TutorialImages/AddToPipeline.png" width="160"/></span>.

source: In this module, for the “Select the larger identified objects” module setting, select “Cells” from the drop-down list.
es: En este módulo, para la configuración "Seleccionar los objetos identificados más grandes", seleccione "Cells" (Células) en la lista desplegable.
pt_br: Nesse módulo, para a configuração do módulo "Select the larger identified objects" (Selecionar os objetos identificados maiores), selecione "Cells" (Células) na lista suspensa.

source: For the “Select the smaller identified objects” setting, select “Nuclei” from the drop-down list.
es: Para el ajuste "Seleccionar los objetos identificados más pequeños", seleccione "Nuclei" (Núcleos) en la lista desplegable.
pt_br: Para a configuração "Select the smaller identified objects" (Selecionar os objetos menores identificados), selecione "Nuclei" (Núcleos) na lista suspensa.

source: For the “Name the tertiary objects to be identified” setting, enter “Cytoplasm” as a descriptive name for the tertiary objects.
es: En la opción "Nombre de los objetos terciarios a identificar", introduzca "Cytoplasm" (Citoplasma) como nombre descriptivo de los objetos terciarios.
pt_br: Para a configuração "Name the tertiary objects to be identified" (Dê um nome aos objetos terciários a serem identificados), digite "Cytoplasm" (Citoplasma) como um nome descritivo para os objetos terciários.

source: Enable the ‘Shrink smaller object prior to subtraction?’ option; this will ensure that all of your Cytoplasm objects have an area of at least 1 pixel.
es: Active la opción "¿Reducir el objeto más pequeño antes de la sustracción?"; esto garantizará que todos sus objetos de citoplasma tengan un área de al menos 1 píxel.
pt_br: Ative a opção "Shrink smaller object prior to subtraction?" (Encolher objeto menor antes da subtração?); isso garantirá que todos os seus objetos de citoplasma tenham uma área de pelo menos 1 pixel.

source: Click the <img src="./TutorialImages/Step.png" width="120"/> button to execute the module, and preview the results of tertiary object identification (Fig. 5).
es: Haga clic en el botón <img src="./TutorialImages/Step.png" width="120"/> para ejecutar el módulo y obtener una vista previa de los resultados de la identificación de objetos terciarios (Fig. 5).
pt_br: Clique no botão <img src="./TutorialImages/Step.png" width="120"/> para executar o módulo e visualizar os resultados da identificação de objetos terciários (Fig. 5).

source: *Figure 5: Example module display window for IdentifyTertiaryObjects*
es: *Figura 5: Ventana de visualización del módulo de ejemplo para IdentificarTertiaryObjects*
pt_br: *Figura 5: Exemplo de janela de exibição do módulo para IdentifiqueTertiaryObjects*

source: 6. **Measuring the cells’ characteristics (i.e. the “object features”)**
es: 6. **Medición de las características de las células (es decir, las “object features”)**
pt_br: 6. **Medindo as características das células (ou seja, as “características do objeto”)**

source: Now that the objects have been identified using settings that have been optimized for the phenotypes of interest, the next step is to make measurements of the various cellular features. Later, we will be using CellProfiler Analyst to classify the cells into phenotypes, based on whether they contain cytoplasmic or nuclear FOXO1A-GFP using the measurements collected here. The important point is to collect measurements that would be useful for distinguishing one phenotype from the other.
es: Ahora que los objetos han sido identificados utilizando ajustes que han sido optimizados para los fenotipos de interés, el siguiente paso es hacer mediciones de las diversas características celulares. Más tarde, usaremos CellProfiler Analyst para clasificar las células en fenotipos, basándonos en si contienen FOXO1A-GFP citoplasmática o nuclear usando las medidas recogidas aquí. Lo importante es recoger mediciones que sean útiles para distinguir un fenotipo del otro.
pt_br: Agora que os objetos foram identificados usando configurações que foram otimizadas para os fenótipos de interesse, a próxima etapa é fazer medições dos vários recursos celulares. Posteriormente, usaremos o CellProfiler Analyst para classificar as células em fenótipos, com base no fato de conterem FOXO1A-GFP citoplasmática ou nuclear, usando as medições coletadas aqui. O ponto importante é coletar medições que sejam úteis para distinguir um fenótipo do outro.

source: CellProfiler has the ability to measure many cellular characteristics, and what we could do in this exercise, is ask it to measure all of them, and then let the classification tool decide which features are most useful. In this exercise, however, we will use three of the possible measurements.
es: CellProfiler tiene la capacidad de medir muchas características celulares, y lo que podríamos hacer en este ejercicio, es pedirle que las mida todas, y luego dejar que la herramienta de clasificación decida qué características son las más útiles. En este ejercicio, sin embargo, utilizaremos tres de las medidas posibles.
pt_br: O CellProfiler tem a capacidade de medir muitas características celulares, e o que poderíamos fazer neste exercício é pedir que ele meça todas elas e, em seguida, deixar que a ferramenta de classificação decida quais características são mais úteis. No entanto, neste exercício, usaremos três das medições possíveis.

source: **Measurement of pixel intensity of GFP in nuclei and cytoplasm:**
es: **Medición de la intensidad de GFP en los píxeles de núcleos y citoplasma:**
pt_br: **Medição da intensidade de pixel de GFP em núcleos e citoplasma:**

source: One example of a particularly useful measurement is the pixel intensities of the various objects (i.e. nuclei and cytoplasm) as measured from the images showing the subcellular location of the FOXO1A-GFP fluorescence.
es: Un ejemplo de una medición particularmente útil son las intensidades de píxeles de los distintos objetos (es decir, núcleos y citoplasma) medidas a partir de las imágenes que muestran la ubicación subcelular de la fluorescencia de FOXO1A-GFP.
pt_br: Um exemplo de uma medição particularmente útil são as intensidades de pixel dos vários objetos (isto é, núcleos e citoplasma), conforme medido a partir das imagens que mostram a localização subcelular da fluorescência FOXO1A-GFP.

source: Click on the <img src="./TutorialImages/AddModule.png" width="35"/> button and add the module *MeasureObjectIntensity* located under the module category *“Measurement”.* Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> y agregue el módulo *MeasureObjectIntensity* ubicado en la categoría de módulos *“Measurement”.* Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="35"/> e adicione o módulo *MeasureObjectIntensity* localizado na categoria do módulo *“Measurement”.* Adicione-o ao pipeline clicando no botão <span class='notranslate' botão ><img src="./TutorialImages/AddToPipeline.png" width="160"/></span>.

source: In this module, select “rawGFP” in the "Select images to measure" box, by checking the box next to it.
es: En este módulo, seleccione "rawGFP" en la casilla "Seleccionar imágenes para medir", marcando la casilla situada junto a ella.
pt_br: Nesse módulo, selecione "rawGFP" na caixa "Select images to measure" (Selecionar imagens para medir), marcando a caixa ao lado dela.

source: Select “Nuclei” and "Cytoplasm" from the "Select objects to measure" box.
es: Seleccione "Nuclei" y "Cytoplasm" en el cuadro "Seleccionar objetos a medir".
pt_br: Selecione "Nuclei" (Núcleos) e "Cytoplasm" (Citoplasma) na caixa "Select objects to measure" (Selecionar objetos para medir).

source: **Measurement of the correlation of GFP in nuclei to DNA in nuclei:**
es: **Medición de la correlación de GFP en núcleos con ADN en núcleos:**
pt_br: **Medição da correlação de GFP nos núcleos com DNA nos núcleos:**

source: Another potentially useful measure is the correlation within the objects of the pixel intensities in the GFP and DNA channels. If the FOXO1A-GFP protein is not translocated, the intensity correlation within the nucleus between the two images would be expected to be negative, whereas upon translocation, the correlation would be positive.
es: Otra medida potencialmente útil es la correlación, dentro de los objetos, de las intensidades de píxeles en los canales de GFP y ADN. Si la proteína FOXO1A-GFP no se transloca, se esperaría que la correlación de intensidad dentro del núcleo entre las dos imágenes fuera negativa, mientras que tras la translocación, la correlación sería positiva.
pt_br: Outra medida potencialmente útil é a correlação dentro dos objetos das intensidades de pixel nos canais GFP e DNA. Se a proteína FOXO1A-GFP não for translocada, seria de esperar que a correlação de intensidade dentro do núcleo entre as duas imagens fosse negativa, enquanto que após a translocação, a correlação seria positiva.

source: Click on the <img src="./TutorialImages/AddModule.png" width="35"/> button and add the module **MeasureColocalization** located under the module category *“Measurement”.* Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> y agregue el módulo **MeasureColocalization** ubicado en la categoría de módulos *“Measurement”.* Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="35"/> e adicione o módulo **MeasureColocalization** localizado na categoria do módulo *“Measurement”.* Adicione-o ao pipeline clicando no botão <span class=' botão notranslate'><img src="./TutorialImages/AddToPipeline.png" width="160"/></span>.

source: In this module, select “rawGFP” and “rawDNA” from the "Select images to measure" box. Leave the "Set threshold as percentage of maximum intensity for the images" to the default value of 15.0.
es: En este módulo, seleccione "rawGFP" y "rawDNA" de la casilla "Seleccionar imágenes para medir". Deje el "Set threshold as percentage of maximum intensity for the images" al valor por defecto de 15.0.
pt_br: Nesse módulo, selecione "rawGFP" e "rawDNA" na caixa "Select images to measure" (Selecionar imagens para medir). Deixe a opção "Set threshold as percentage of maximum intensity for the images" (Definir limite como porcentagem da intensidade máxima para as imagens) com o valor padrão de 15,0.

source: For the “Select where to measure correlation” setting, select “Within objects” and then select “Nuclei” and "Cytoplasm" from the “Select objects to measure” box.
es: Para el ajuste "Seleccionar dónde medir la correlación", seleccione "Dentro de los objetos" y, a continuación, seleccione "Nuclei" y "Cytoplasm" en el cuadro "Seleccionar objetos para medir".
pt_br: Para a configuração "Select where to measure correlation" (Selecionar onde medir a correlação), selecione "Within objects" (Dentro de objetos) e, em seguida, selecione "Nuclei" (Núcleos) e "Cytoplasm" (Citoplasma) na caixa "Select objects to measure" (Selecionar objetos para medir).

source: For "Method for Costes thresholding", choose *"Faster"* from the drop-down list to reduce analysis time.
es: En "Método de umbralización de Costes", elija *"Más rápido"* en la lista desplegable para reducir el tiempo de análisis.
pt_br: Em "Method for Costes thresholding", escolha *"Faster "* na lista suspensa para reduzir o tempo de análise.

source: **Measurement of the ratio of GFP in cytoplasm to GFP in nuclei:** Since
es: **Medición de la relación entre GFP en el citoplasma y GFP en los núcleos:**
pt_br: **Medição da proporção de GFP no citoplasma para GFP nos núcleos:** Desde

source: we are interested in the transportation of GFP from the cytoplasm to the nucleus, it would be useful to measure the ratio of cytoplasmic stain to nuclear stain. In this case, we will use the **CalculateMath** module because it performs arithmetic operations between various object measurements.
es: Ya que estamos interesados en el transporte de GFP desde el citoplasma al núcleo, sería útil medir la relación entre la tinción citoplasmática y la tinción nuclear. En este caso, usaremos el módulo **CalculateMath** porque realiza operaciones aritméticas entre varias medidas de objetos.
pt_br: estamos interessados no transporte de GFP do citoplasma para o núcleo, seria útil medir a proporção entre a coloração citoplasmática e a coloração nuclear. Neste caso, usaremos o módulo **CalculateMath** porque ele realiza operações aritméticas entre diversas medidas de objetos.

source: Click on the <img src="./TutorialImages/AddModule.png" width="35"/> button and add the module **CalculateMath** located under the *“Data Tools”* module category*.* Add it to the pipeline by clicking the <img src="./TutorialImages/AddToPipeline.png" width="160"/> button.
es: Haga clic en el botón <img src="./TutorialImages/AddModule.png" width="35"/> y agregue el módulo **CalculateMath** ubicado en la categoría de módulos *“Data Tools”*. Agréguelo al pipeline haciendo clic en el botón <img src="./TutorialImages/AddToPipeline.png" width="160"/>.
pt_br: Clique no botão <img src="./TutorialImages/AddModule.png" width="35"/> e adicione o módulo **CalculateMath** localizado na categoria do módulo *“Data Tools”**.* Adicione-o ao pipeline clicando no botão <span botão class='notranslate'><img src="./TutorialImages/AddToPipeline.png" width="160"/></span>.
