Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/Translocation.po
Languages: es, pt_br

source: From the image that opens, click “Classify” from the menu, then “Classify Image”.
es: En la imagen que se abre, haga clic en "Clasificar" en el menú y, a continuación, en "Clasificar imagen".
pt_br: Na imagem que se abre, clique em "Classify" (Classificar) no menu e, em seguida, em "Classify Image" (Classificar imagem).

source: The cells will be color-coded according to their classification based on the current rules.
es: Las casillas se codificarán por colores según su clasificación basada en las normas vigentes.
pt_br: As células serão codificadas por cores de acordo com sua classificação com base nas regras atuais.

source: Click the “Show controls >>” button at the bottom to reveal the total counts of each class on the image. On Windows computers this will also show which color corresponds to which class.
es: Haga clic en el botón "Mostrar controles >>" ("Show controls>>") de la parte inferior para ver los recuentos totales de cada clase en la imagen. En las computadoras con Windows también se mostrará qué color corresponde a cada clase.
pt_br: Clique no botão "Show controls &gt;&gt;" (Mostrar controles &gt;&gt;) na parte inferior para revelar as contagens totais de cada classe na imagem. Em computadores Windows, isso também mostrará qual cor corresponde a qual classe.

source: On Macs, select “View” from the image menu, and then select “View cell classes as numbers.” Then, to see what each number means, click the “Show controls >>” button at the bottom to reveal the numbered class list.
es: En Mac, seleccione "Ver" ("View") en el menú de la imagen y, a continuación, "Ver clases de células como números". A continuación, para ver qué significa cada número, haz clic en el botón "Mostrar controles >>" ("Show Controls >>") de la parte inferior para revelar la lista de clases numeradas.
pt_br: Em Macs, selecione "Exibir" no menu de imagem e, em seguida, selecione "Exibir classes de células como números". Em seguida, para ver o que cada número significa, clique no botão "Show controls &gt;&gt;" (Mostrar controles &gt;&gt;) na parte inferior para revelar a lista de classes numeradas.

source: Look for up to 5 cells that are clearly misclassified. For each of these cells that you find, click on it and drag-and-drop it into the appropriate bin.
es: Busque hasta 5 células que estén claramente mal clasificadas. Para cada una de estas células que encuentre, haga clic en ella y arrástrela y suéltela en el contenedor apropiado.
pt_br: Procure até 5 células que estejam claramente classificadas de forma errônea. Para cada uma dessas células que você encontrar, clique nela e arraste e solte-a no compartimento apropriado.

source: **Refining the training set by fetching positive and negative cells:**
es: **Refinando el conjunto de entrenamiento obteniendo más células positivas y negativas:**
pt_br: **Refinando o conjunto de treinamento buscando células positivas e negativas:**

source: You now have your initial training set, and the rules that define the computer’s first attempt at distinguishing the phenotype. Therefore you can now request that the computer fetch more examples of positive and negative cells. These new sample cells can be added to the corresponding bins, in order to improve the classifier’s performance, with respect to distinguishing the FOXO1A-GFP subcellular localization phenotypes.
es: Ahora tienes tu conjunto de entrenamiento inicial y las reglas que definen el primer intento de la computadora de distinguir el fenotipo. Por lo tanto, ahora puede solicitar que la computadora obtenga más ejemplos de células positivos y negativos. Estas nuevas células se pueden agregar a los contenedores correspondientes para mejorar el rendimiento del clasificador con respecto a la distinción de los fenotipos de localización subcelular de FOXO1A-GFP.
pt_br: Agora você tem seu conjunto de treinamento inicial e as regras que definem a primeira tentativa do computador de distinguir o fenótipo. Portanto agora você pode solicitar que o computador busque mais exemplos de células positivas e negativas. Estas novas células de amostra podem ser adicionadas aos compartimentos correspondentes, a fim de melhorar o desempenho do classificador, no que diz respeito à distinção dos fenótipos de localização subcelular FOXO1A-GFP.

source: Change the number next to the word “Fetch” from “20” to “5”. Click on the drop-down box labeled “random” in the fetch controls. Select “positive” from the drop-down list.
es: Cambia el número que aparece junto a la palabra "Fetch!" de "20" a "5". Haz clic en el cuadro desplegable que dice "random" ("aleatorio") de los controles de búsqueda. Selecciona "positivo" en la lista desplegable.
pt_br: Altere o número ao lado da palavra "Fetch" de "20" para "5". Clique na caixa suspensa rotulada "random" (aleatório) nos controles de busca. Selecione "positive" (positivo) na lista suspensa.

source: Click the “Fetch!” button to retrieve samples of what the computer thinks are positive cells based on the current set of rules. Refine your training set by doing the following:
es: Haga clic en el botón "Buscar" para recuperar muestras de lo que la computadora cree que son células positivas basadas en el conjunto actual de reglas. Refine su conjunto de entrenamiento haciendo lo siguiente:
pt_br: Clique no botão "Fetch!" (Buscar!) para recuperar amostras do que o computador acha que são células positivas com base no conjunto atual de regras. Refine seu conjunto de treinamento fazendo o seguinte:

source: If positive cells are correctly fetched (true positives), drag and drop them into the positive bin.
es: Si las células positivas se obtienen correctamente (verdaderos positivos), arrástrelas y suéltelas en la bandeja de positivos.
pt_br: Se as células positivas forem obtidas corretamente (positivos verdadeiros), arraste-as e solte-as no compartimento positivo.

source: If negative cells are incorrectly fetched (false positives), drag and drop them into the negative bin.
es: Si se obtienen células negativas incorrectamente (falsos positivos), arrástrelas y suéltelas en la bandeja de negativos.
pt_br: Se as células negativas forem buscadas incorretamente (falsos positivos), arraste-as e solte-as no compartimento negativo.

source: As with previous steps, if you are not sure about which bin a cell belongs to, do not add it to the training set. Instead, click to select these ambiguous cells, and then press the “Delete” key to remove them from the analysis.
es: Al igual que en los pasos anteriores, si no está seguro de a qué casilla pertenece una células, no la añada al conjunto de entrenamiento. En su lugar, haga clic para seleccionar estas células ambiguas y, a continuación, pulse la tecla "Suprimir" para eliminarlas del análisis.
pt_br: Assim como nas etapas anteriores, se não tiver certeza de qual compartimento uma célula pertence, não a adicione ao conjunto de treinamento. Em vez disso, clique para selecionar essas células ambíguas e pressione a tecla "Delete" para removê-las da análise.

source: Repeat this step until you have at least 20 cells in each bin.
es: Repita este paso hasta que tenga al menos 20 células en cada contenedor.
pt_br: Repita essa etapa até que você tenha pelo menos 20 células em cada compartimento.

source: Questions to consider: (1) What is the top-most rule that shows up in your classification rules? (2) Is the top-most rule a measurement that you would expect to be the most significant one to use, in distinguishing the phenotypes?
es: Preguntas a tener en cuenta: (1) ¿Cuál es la regla más importante que aparece en las reglas de clasificación? (2) ¿Es la regla más importante una medida que esperaría que fuera la más significativa para distinguir los fenotipos?
pt_br: Perguntas a serem consideradas: (1) Qual é a regra mais importante que aparece em suas regras de classificação? (2) A regra mais importante é uma medida que você esperaria que fosse a mais significativa a ser usada para distinguir os fenótipos?

source: Whatever approach you choose to obtain more positive and negative cells, the procedure is the same: (i) Find rules; (ii) Obtain more cell samples of the desired phenotype; (iii) Correct misclassifications, or sort into appropriate bins; (iv) Go back to the first step and repeat, until the classifier displays the desired level of accuracy.
es: Sea cual sea el método elegido para obtener más células positivas y negativas, el procedimiento es el mismo: (i) Encontrar reglas; (ii) Obtener más muestras de células del fenotipo deseado; (iii) Corregir las clasificaciones erróneas, o clasificar en los grupos adecuados; (iv) Volver al primer paso y repetir, hasta que el clasificador muestre el nivel de precisión deseado.
pt_br: Qualquer que seja a abordagem escolhida para obter mais células positivas e negativas, o procedimento é o mesmo: (i) Encontre regras; (ii) Obtenha mais amostras de células do fenótipo desejado; (iii) Corrija as classificações incorretas ou classifique-as em compartimentos apropriados; (iv) Volte para a primeira etapa e repita até que o classificador exiba o nível de precisão desejado.

source: 6. **Classifying all cells in the experiment**
es: 6. **Clasificando todas los células del experimento**
pt_br: 6. **Classificando todas as células do experimento**

source: Once the classifier is of the desired accuracy, it is ready to be applied to the complete image data set.
es: Una vez que el clasificador tiene la precisión deseada, está listo para aplicarse al conjunto completo de datos de imágenes.
pt_br: Quando o classificador tiver a precisão desejada, ele estará pronto para ser aplicado ao conjunto completo de dados de imagem.

source: Press the “Score all” button. A dialog box will appear with scoring options; click “OK” to accept the default settings and begin scoring. Every cell in every image will now be scored as positive or negative by the classifier you built.
es: Pulse el botón "Puntuar todo" ("Score All"). Aparecerá un cuadro de diálogo con las opciones de puntuación; pulse "Aceptar" para aceptar la configuración predeterminada y comenzar la puntuación. Cada célula de cada imagen será ahora puntuada como positiva o negativa por el clasificador que ha construido.
pt_br: Pressione o botão "Score all" (Pontuar tudo). Será exibida uma caixa de diálogo com opções de pontuação; clique em "OK" para aceitar as configurações padrão e iniciar a pontuação. Cada célula em cada imagem será agora pontuada como positiva ou negativa pelo classificador que você criou.

source: A “Hit table” window will appear containing the summarized scores for every image (Fig. 9). The total cell count is reported, as well as the number of positive and negative cells classified. The last column is the enrichment score.
es: Aparecerá una ventana "Tabla de aciertos" con las puntuaciones resumidas de cada imagen (Fig. 9). Se informa del recuento total de células, así como del número de células positivas y negativas clasificadas. La última columna es la puntuación de enriquecimiento.
pt_br: Será exibida uma janela "Hit table" (Tabela de acertos) com as pontuações resumidas de cada imagem (Fig. 9). A contagem total de células é informada, bem como o número de células positivas e negativas classificadas. A última coluna é a pontuação de enriquecimento.

source: Click on the column header labeled “Enriched Score positive.” (You can resize the hit table window, if this column is not visible). Clicking this header will sort the rows in ascending or descending order, according to the enrichment scores. Sort the column values so the order is descending, with the highest score at top.
es: Haga clic en la cabecera de la columna "Puntuación enriquecida positiva" ("Enriched Score Positive"). (Puede cambiar el tamaño de la ventana de la tabla de aciertos, si esta columna no está visible). Al hacer clic en este encabezado se ordenarán las filas en orden ascendente o descendente, según las puntuaciones de enriquecimiento. Ordene los valores de las columnas de modo que el orden sea descendente, con la puntuación más alta en la parte superior.
pt_br: Clique no cabeçalho da coluna chamado "Enriched Score positive". (Você pode redimensionar a janela da tabela de ocorrências, se essa coluna não estiver visível). Clicar nesse cabeçalho classificará as linhas em ordem crescente ou decrescente, de acordo com as pontuações de enriquecimento. Classifique os valores da coluna de modo que a ordem seja decrescente, com a pontuação mais alta no topo.

source: Double-click on the asterisk in the first row to the left of the first column (“ImageNumber”) to display the corresponding image for the top-scoring well.
es: Haga doble clic en el asterisco de la primera fila a la izquierda de la primera columna ("ImageNumber") para ver la imagen correspondiente al pocillo con mayor puntuación.
pt_br: Clique duas vezes no asterisco na primeira linha à esquerda da primeira coluna ("ImageNumber") para exibir a imagem correspondente ao poço de maior pontuação.

source: *Figure 9: Hit table showing the cell counts and enrichment scores.*
es: *Figura 9: Tabla de resultados que muestra los recuentos de células y las puntuaciones de enriquecimiento.*
pt_br: *Figura 9: Tabela de acertos mostrando as contagens de células e as pontuações de enriquecimento.

source: You can also save your training set and/or classifer model for future reference or to make changes later; do so by going to *File > Save Training Set* or *File > Save Classifier Model*
es: También puede guardar su conjunto de entrenamiento y/o modelo clasificador para futuras consultas o para realizar cambios más adelante; para ello, vaya a *Archivo > Guardar conjunto de entrenamiento* o *Archivo > Guardar modelo clasificador*.
pt_br: Você também pode salvar o conjunto de treinamento e/ou o modelo do classificador para referência futura ou para fazer alterações mais tarde; para isso, acesse *File &gt; Save Training Set* ou *File &gt; Save Classifier Model*

source: 7. **Saving the scores to the measurement database for visualization**
es: 7. **Guardar las puntuaciones en la base de datos de mediciones para su visualización**
pt_br: 7. **Salvar as pontuações no banco de dados de medição para visualização**

source: Now that we have successfully scored our experiment, we will save the scores back to the measurement database, so that they can be visualized using CPA’s tools.
es: Ahora que hemos puntuado con éxito nuestro experimento, guardaremos las puntuaciones en la base de datos de mediciones, para poder visualizarlas con las herramientas de CPA.
pt_br: Agora que pontuamos nosso experimento com sucesso, salvaremos as pontuações no banco de dados de medições, para que possam ser visualizadas usando as ferramentas da CPA.

source: Select the “Hit table” window and click “File” from the menu, then “Save table to database.” When prompted for a name, enter “HitTable”. Select “save permanently” when prompted.
es: Seleccione la ventana "Tabla de aciertos" ("Hit Table") y haga clic en "Archivo" en el menú y, a continuación, en "Guardar tabla en base de datos". Cuando se le pida un nombre, introduzca "HitTable". Seleccione "Guardar permanentemente" cuando se le pida.
pt_br: Selecione a janela "Hit table" e clique em "File" (Arquivo) no menu e, em seguida, em "Save table to database" (Salvar tabela no banco de dados). Quando for solicitado um nome, digite "HitTable". Selecione "save permanently" (salvar permanentemente) quando solicitado.

source: Select Plate Viewer from the CPA interface, then choose “\*OTHER TABLE\*” from “Data source.”
es: Seleccione el Visor de Placas en la interfaz CPA y, a continuación, elija "\*OTHER TABLE\*" (Otra Tabla) en "Datos de Origen" ("Data source").
pt_br: Selecione Plate Viewer na interface CPA e, em seguida, escolha "\*OTHER TABLE\*" em "Data source" (Fonte de dados).

source: When prompted to select a table, choose “HitTable.”
es: Cuando se le pida que seleccione una tabla, elija "HitTable".
pt_br: Quando solicitado a selecionar uma tabela, escolha "HitTable".

source: At the next prompt, select “per-well” as the table type. Then select the matching columns in order to link the table of hits to the table of image measurements, by doing the following:
es: En la siguiente pantalla, seleccione "por pocillo" como tipo de tabla. A continuación, seleccione las columnas correspondientes para vincular la tabla de aciertos con la tabla de medidas de imagen, haciendo lo siguiente:
pt_br: No próximo prompt, selecione "per-well" (por poço) como o tipo de tabela. Em seguida, selecione as colunas correspondentes para vincular a tabela de ocorrências à tabela de medidas de imagem, fazendo o seguinte:

source: On the first row, choose “*PlateID*” on the left to match “*Image_Metadata_Plate*” on the right.
es: En la primera fila, elija “*PlateID*” a la izquierda para que coincida con “*Image_Metadata_Plate*” a la derecha.
pt_br: Na primeira linha, escolha “*PlateID*” à esquerda para corresponder a “*Image_Metadata_Plate*” à direita.

source: On the second row, choose “*Image_Metadata_Well*” on the left to match “*Image_Metadata_Well*” on the right.
es: En la segunda fila, elija “*Image_Metadata_Well*” a la izquierda para que coincida con “*Image_Metadata_Well*” a la derecha.
pt_br: Na segunda linha, escolha “*Image_Metadata_Well*” à esquerda para corresponder a “*Image_Metadata_Well*” à direita.

source: Open a new Plate Viewer tool from the main CPA window. On the Plate Viewer, select “*pEnriched_positive”* from the *Measurement* drop-down list in order to view the enrichment scores in the plate layout.
es: Abra una nueva herramienta Plate Viewer desde la ventana principal de CPA. En el Visor de placas, seleccione “*pEnriched_positive”* de la lista desplegable *Measurement* para ver las puntuaciones de enriquecimiento en el diseño de la placa.
pt_br: Abra uma nova ferramenta Plate Viewer na janela principal do CPA. No Plate Viewer, selecione “*pEnriched_sensitive”* na lista suspensa *Measurement* para visualizar as pontuações de enriquecimento no layout da placa.

source: Refer to the previous Plate Viewer display of *“Image_Metadata_Dose*” from section 2A. Consider the following questions: (1) How well does the layout of the “*pEnriched_positive*” values match the layout of the (i) positive and negative control wells and (ii) the 9-point dose wells of “*Image_Metadata_Dose*”? (2) What does this correspondence (or lack thereof) tell you about the classifier?
es: Consulte la visualización anterior del Visor de placas de *“Image_Metadata_Dose*” de la sección 2A. Considere las siguientes preguntas: (1) ¿Cómo coincide pocillo el diseño de los valores “*pEnriched_positive*” con el diseño de los (i) pocillos de control positivo y negativo y (ii) ¿Los pocillos de dosis de 9 puntos de “*Image_Metadata_Dose*”? (2) ¿Qué le dice esta correspondencia (o la falta de ella) sobre el clasificador?
pt_br: Consulte a exibição anterior do Plate Viewer de *“Image_Metadata_Dose*” da seção 2A. Considere as seguintes questões: (1) Quão bem o layout dos valores “*pEnriched_positivo*” corresponde ao layout dos (i) poços de controle positivo e negativo e (ii) dos poços de dose de 9 pontos de “*Image_Metadata_Dose*” ? (2) O que essa correspondência (ou a falta dela) diz sobre o classificador?

source: 8. **Plotting the scoring results, to estimate the lowest dose necessary to induce FOX1O-GFP translocation**
es: 8. **Graficar los resultados de la puntuación para estimar la dosis más baja necesaria para inducir la translocación de FOXO1A-GFP**
pt_br: 8. **Planejando os resultados da pontuação, para estimar a dose mais baixa necessária para induzir a translocação FOX1O-GFP**

source: You can use additional data tools in CPA to visualize your data in other ways. In this case, we will use a scatter plot to plot a dose-response curve. This will allow us to see how the ratio of positive cells (i.e. cells with GFP in the nucleus) increases with Wortmannin dose.
es: Puede utilizar herramientas de datos adicionales en CPA para visualizar sus datos de otras maneras. En este caso, utilizaremos un gráfico de dispersión para trazar una curva dosis-respuesta. Esto nos permitirá ver cómo la proporción de células positivas (es decir, células con GFP en el núcleo) aumenta con la dosis de Wortmannin.
pt_br: Você pode usar ferramentas de dados adicionais no CPA para visualizar seus dados de outras maneiras. Nesse caso, usaremos um gráfico de dispersão para traçar uma curva de dose-resposta. Isso nos permitirá ver como a proporção de células positivas (ou seja, células com GFP no núcleo) aumenta com a dose de Wortmannin.

source: Click the Scatter Plot icon in the main CPA window <img src="./TutorialImages/Inline11.png" width="50"/> (4th from left).
es: Haga clic en el icono de Gráfico de Dispersión en la ventana principal de CPA <img src="./TutorialImages/Inline11.png" width="50"/> (cuarto desde la izquierda).
pt_br: Clique no ícone Gráfico de dispersão na janela principal do CPA <img src="./TutorialImages/Inline11.png" width="50"/> (4º a partir da esquerda).

source: From the “x-axis” row, select “*Per_image*” and “*Image_Metadata_Dose*” from the drop-down lists. Choose “*log*” from the “Scale” drop-down.
es: En la fila del "eje x", seleccione "*Per_image*" y "*Image_Metadata_Dose*" de las listas desplegables. Elija "*log*" en el menú desplegable "Scale".
pt_br: Na linha “eixo x”, selecione “*Per_image*” e “*Image_Metadata_Dose*” nas listas suspensas. Escolha “*log*” no menu suspenso “Escala”.

source: From the “y-axis” row, select “*HitTable*” and “*pEnriched_positive*” from the drop-down-lists.
es: En la fila del "eje y", seleccione "*HitTable*" y "*pEnriched_positive*" de las listas desplegables.
pt_br: Na linha “eixo y”, selecione “*HitTable*” e “*pEnriched_positivo*” nas listas suspensas.

source: Click the “Update chart” button to see the scatter plot. NOTE: due to a bug in CPA, if you have plot the graph once in “*linear*” scale mode and then try to switch to “*log*” scale an error will be thrown. If you want to look at both, open two separate scatter plots.
es: Haga clic en el botón "Update chart" para ver el diagrama de dispersión. NOTA: debido a un error en CPA, si ha trazado el gráfico una vez en el modo de escala “*linear*” y luego intenta cambiar a la escala “*log*”, se generará un error. Si desea ver ambos, abra dos diagramas de dispersión separados.
pt_br: Clique no botão “Atualizar gráfico” para ver o gráfico de dispersão. NOTA: devido a um bug no CPA, se você plotar o gráfico uma vez no modo de escala “*linear*” e depois tentar mudar para a escala “*log*”, um erro será gerado. Se você quiser ver ambos, abra dois gráficos de dispersão separados.
