Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/UnmixColorsTutorial.po
Languages: es, pt_br

source: Ruifrok AC, Johnston DA. (2001) “Quantification of histochemical staining by color deconvolution.” Analytical & Quantitative Cytology & Histology, 23: 291-299.
es: Ruifrok AC, Johnston DA. (2001) "Quantification of histochemical staining by color deconvolution". Analytical &amp; Quantitative Cytology &amp; Histology, 23: 291-299.
pt_br: Ruifrok AC, Johnston DA. (2001) "Quantification of histochemical staining by color deconvolution." Analytical &amp; Quantitative Cytology &amp; Histology, 23: 291-299.

source: **Images sources:**
es: **Fuentes de las imágenes
pt_br: **Fontes de imagens:**

source: Example 1: Parathyroid Adenoma 6 by euthman.jpg (`CC 2.0 <https://creativecommons.org/licenses/by/2.0/>`__, 1148 x 765 pixels, file size: 441 KB, https://www.flickr.com/photos/euthman/4703621316/in/photolist-8aDhKf)
es: Ejemplo 1: Adenoma paratiroideo 6 by euthman.jpg (`CC 2.0 <https://creativecommons.org/licenses/by/2.0/>`__, 1148 x 765 píxeles, tamaño del archivo: 441 KB, https://www.flickr.com/photos/euthman/4703621316/in/photolist-8aDhKf)
pt_br: Exemplo 1: Parathyroid Adenoma 6 by euthman.jpg (`CC 2.0 <https://creativecommons.org/licenses/by/2.0/>`__, 1148 x 765 pixels, tamanho do arquivo: 441 KB, https://www.flickr.com/photos/euthman/4703621316/in/photolist-8aDhKf)

source: Example 2: Parathyroid_adenoma_histopathology_(2).jpg ‎(`CC 3.0-SA <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, 600 × 452 pixels, file size: 172 KB, https://commons.wikimedia.org/wiki/File:Parathyroid_adenoma_histopathology_(2).jpg)
es: Ejemplo 2: Parathyroid_adenoma_histopathology_(2).jpg (`CC 3.0-SA <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, 600 × 452 píxeles, tamaño del archivo: 172 KB, https://commons.wikimedia.org/wiki/File:Parathyroid_adenoma_histopathology_(2).jpg)
pt_br: Exemplo 2: Parathyroid_adenoma_histopathology_(2).jpg (`CC 3.0-SA <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, 600 × 452 pixels, tamanho do arquivo: 172 KB, https://commons.wikimedia.org/wiki/File:Parathyroid_adenoma_histopathology_(2).jpg)

source: image1
es: imagen1
pt_br: imagem1
