Repository: CellProfiler/tutorials
Catalog: internal_use/docs/locale/*/LC_MESSAGES/UnmixColorsTutorial.po
Languages: es, pt_br

source: **UnmixColors**
es: **Desmezclar colores

source: UnmixColors creates separate images per dye stain for histologically stained images.
es: UnmixColors crea imágenes separadas por tinción para imágenes teñidas histológicamente.
pt_br: O UnmixColors cria imagens separadas por corante para imagens histologicamente coradas.

source: This module creates separate grayscale images from a color image stained with light-absorbing dyes. Dyes are assumed to absorb an amount of light in the red, green and blue channels that increases proportionally in each channel with increasing amounts of stain; the hue does not shift with increasing staining. The module separates two or more stains, producing grayscale images that look similar to fluorescent images and thus can be analyzed similarly. There are several pre-set dye combinations; since the exact dye appearance can vary between users and due to issues such as lighting conditions, there is also a custom mode that allows you to calibrate how your dyes look in your exact tissue. Some commonly known stains are actually mixes of 2 or more dyes and thus must be specified by all of their individual dye components.
es: Este módulo crea imágenes separadas en escala de grises a partir de una imagen en color teñida con colorantes que absorben la luz. Se supone que los tintes absorben una cantidad de luz en los canales rojo, verde y azul que aumenta proporcionalmente en cada canal con cantidades crecientes de tinción; el tono no cambia con el aumento de la tinción. El módulo separa dos o más tinciones, produciendo imágenes en escala de grises que tienen un aspecto similar a las imágenes fluorescentes y, por tanto, pueden analizarse de forma similar. Existen varias combinaciones de tinción preestablecidas; dado que el aspecto exacto de la tinción puede variar entre usuarios y debido a cuestiones como las condiciones de iluminación, también existe un modo personalizado que permite calibrar el aspecto de las tinciones en el tejido exacto. Algunas tinciones comúnmente conocidas son en realidad mezclas de 2 o más tintes y, por lo tanto, deben especificarse por todos sus componentes individuales de tinte.
pt_br: Este módulo cria imagens separadas em escala de cinza a partir de uma imagem colorida corada com corantes que absorvem luz. Presume-se que os corantes absorvam uma quantidade de luz nos canais vermelho, verde e azul que aumenta proporcionalmente em cada canal com o aumento da quantidade de corante; a tonalidade não muda com o aumento da coloração. O módulo separa dois ou mais corantes, produzindo imagens em escala de cinza que se assemelham a imagens fluorescentes e, portanto, podem ser analisadas de forma semelhante. Há várias combinações de corantes predefinidas; como a aparência exata do corante pode variar entre os usuários e devido a problemas como condições de iluminação, há também um modo personalizado que permite calibrar a aparência dos corantes no tecido exato. Alguns corantes comumente conhecidos são, na verdade, misturas de dois ou mais corantes e, portanto, devem ser especificados por todos os seus componentes individuais de corante.

source: For example:
es: Por ejemplo:
pt_br: Por exemplo:

source: Hematoxylin-Eosin: Hematoxylin + Eosin
es: Hematoxilina-Eosina: Hematoxilina + Eosina
pt_br: Hematoxilina-Eosina: Hematoxilina + Eosina

source: Giemsa: Methylene Blue + Eosin
es: Giemsa: Azul de metileno + Eosina
pt_br: Giemsa: Azul de Metileno + Eosina

source: **Note:** Mixes of single color fluorescent images should be unmixed with the **ColortoGray** module.
es: **Nota:** Las mezclas de imágenes fluorescentes de un solo color deben desmezclarse con el módulo **ColortoGray**.
pt_br: **Nota:** As misturas de imagens fluorescentes de cor única devem ser desfeitas com o módulo **ColortoGray**.

source: **Technical notes:**
es: **Notas técnicas
pt_br: **Notas técnicas:**

source: This module is adapted from the ImageJ plugin, Colour_Deconvolution.java written by A.C. Ruifrok, whose paper forms the basis for this code.
es: Este módulo está adaptado del plugin de ImageJ, Colour_Deconvolution.java escrito por A.C. Ruifrok, cuyo artículo constituye la base de este código.
pt_br: Este módulo foi adaptado do plug-in do ImageJ, Colour_Deconvolution.java, escrito por A.C. Ruifrok, cujo artigo forma a base para este código.

source: **Goals of this exercise:**
es: **Objetivos de este ejercicio:**
pt_br: **Objetivos deste exercício

source: In this exercise, we will guide you to separate stained samples through the UnmixColors module using reference absorbances and calculate your absorbance in the Custom mode.
es: En este ejercicio, le guiaremos para separar muestras teñidas a través del módulo UnmixColors utilizando absorbancias de referencia y calcular su absorbancia en el modo Custom.
pt_br: Neste exercício, vamos orientá-lo a separar amostras coradas por meio do módulo UnmixColors usando absorbâncias de referência e calcular sua absorbância no modo Custom (Personalizado).

source: **Materials necessary for this exercise:**
es: **Materiales necesarios para este ejercicio:**
pt_br: **Materiais necessários para este exercício:**

source: Histopathological image of parathyroid adenoma. Hematoxylin and eosin
es: Imagen histopatológica de adenoma paratiroideo. Hematoxilina y eosina
pt_br: Imagem histopatológica de adenoma de paratireoide. Hematoxilina e eosina

source: stain in a slide.
es: mancha en un portaobjetos.
pt_br: em uma lâmina.

source: **Example 1:** Parathyroid Adenoma
es: **Ejemplo 1:** Adenoma paratiroideo
pt_br: **Exemplo 1:** Adenoma de paratireoide

source: /…/Input/Exampe1Parathyroid_Adenoma.jpg
es: /.../Input/Exampe1Adenoma_paratiroideo.jpg

source: **Example 2:** Parathyroid Adenoma
es: **Ejemplo 2:** Adenoma paratiroideo
pt_br: **Exemplo 2:** Adenoma de paratireoide

source: /…/Input/Example2Parathyroid_adenoma.jpg
es: /.../Entrada/Ejemplo2Aadenoma_paratiroideo.jpg

source: **Importing data in CellProfiler**
es: **Importación de datos en CellProfiler**
pt_br: **Importando dados no CellProfiler**

source: Highlight the **Images** module.
es: Seleccione el módulo **Imágenes**.
pt_br: Destaque o módulo **Imagens**.

source: Drag-and-drop the Example 1 image only into the Images module window.
es: Arrastre y suelte sólo la imagen del Ejemplo 1 en la ventana del módulo Imágenes.
pt_br: Arraste e solte a imagem do Exemplo 1 somente na janela do módulo Images (Imagens).

source: Highlight the **NameAndType** module.
es: Resalte el módulo **NombreYTipo**.
pt_br: Destaque o módulo **NameAndType**.

source: Assign a name to: All images
es: Asignar un nombre a: Todas las imágenes
pt_br: Atribuir um nome a: Todas as imagens

source: Select the image type: Color image
es: Seleccione el tipo de imagen: Imagen en color
pt_br: Selecione o tipo de imagem: Imagem colorida

source: Assign the images “variable names” that describe the contents in the
es: Asigne a las imágenes "nombres de variables" que describan el contenido en el
pt_br: Atribua às imagens "nomes de variáveis" que descrevem o conteúdo do

source: image. For example, use the name "HE" or "Hematoxylin-Eosin" or something else that will remind you what the image is.
es: imagen. Por ejemplo, utilice el nombre "HE" o "Hematoxilina-Eosina" o cualquier otro que le recuerde de qué imagen se trata.
pt_br: imagem. Por exemplo, use o nome "HE" ou "Hematoxilina-Eosina" ou qualquer outra coisa que o lembre de qual é a imagem.

source: Hit the "update" button to populate
es: Pulsa el botón "actualizar" para rellenar
pt_br: Pressione o botão "atualizar" para preencher

source: **UnmixColors module:**
es: **Módulo UnmixColors:**
pt_br: **Módulo UnmixColors:**

source: Add the **UnmixColor** module to the pipeline. Double click or right click on the white rectangular area below Groups or click the + button in front of the Adjust modules, this pops up the Add modules window, search the **UnmixColors** module and double click in it.
es: Añade el módulo **UnmixColor** a pipeline. Haz doble click o click derecho en el área rectangular blanca debajo de Grupos o haz click en el botón + delante de Ajustar módulos, esto abre la ventana de Añadir módulos, busca el módulo **UnmixColors** y haz doble click en él.
pt_br: Adicione o módulo **UnmixColor** ao pipeline. Clique duas vezes ou clique com o botão direito do mouse na área retangular branca abaixo de Groups (Grupos) ou clique no botão + na frente de Adjust modules (Ajustar módulos). Isso abrirá a janela Add modules (Adicionar módulos), procure o módulo **UnmixColors** e clique duas vezes nele.

source: Using the **UnmixColors** module, try to separate the hematoxylin from the eosin staining in this new example.
es: Utilizando el módulo **UnmixColors**, intente separar la tinción con hematoxilina de la tinción con eosina en este nuevo ejemplo.
pt_br: Usando o módulo **UnmixColors**, tente separar a coloração de hematoxilina da coloração de eosina nesse novo exemplo.

source: Select the input color image: HE (or whatever the name you give for
es: Seleccione la imagen en color de entrada: HE (o el nombre que le dé a
pt_br: Selecione a imagem colorida de entrada: HE (ou qualquer que seja o nome que você dê para

source: your images in **NamesAndTypes** module)
es: sus imágenes en el módulo **NamesAndTypes**)
pt_br: suas imagens no módulo **NamesAndTypes**)

source: Name the output image as Hematoxylin
es: Nombre la imagen de salida como Hematoxilina
pt_br: Nomeie a imagem de saída como Hematoxilina

source: Choose the Stain as Hematoxylin
es: Elija la tinción como Hematoxilina
pt_br: Escolha a coloração como Hematoxilina

source: Add another stain
es: Añadir otra mancha
pt_br: Adicionar outra mancha

source: Name this new output image as Eosin
es: Nombre esta nueva imagen de salida como Eosin
pt_br: Nomeie essa nova imagem de saída como Eosin

source: Choose the Stain as Eosin
es: Elija la tinción como Eosina
pt_br: Escolha a coloração como Eosina

source: |image1|**Tip: Use the question mark button to learn more or if you have questions.**
es: |Consejo: Utilice el botón con el signo de interrogación para obtener más información o si tiene alguna pregunta.
pt_br: |Dica: use o botão de ponto de interrogação para saber mais ou se você tiver dúvidas.

source: Start Test Mode (left bottom of the window) and Test your **UnmixColor** module pressing the Step button. The result of the **UnmixColors** module should pop-up and show you a Hematoxylin image (Nucleus) and an Eosin image (cytoplasm).
es: Inicie el Modo Test (parte inferior izquierda de la ventana) y pruebe su módulo **UnmixColor** pulsando el botón Paso. El resultado del módulo **UnmixColors** debería aparecer y mostrarle una imagen de Hematoxilina (Núcleo) y una imagen de Eosina (citoplasma).
pt_br: Inicie o Modo de teste (parte inferior esquerda da janela) e teste seu módulo **UnmixColor** pressionando o botão Step (Etapa). O resultado do módulo **UnmixColors** deve aparecer e mostrar uma imagem de hematoxilina (núcleo) e uma imagem de eosina (citoplasma).

source: **Note:** If there are other cells/components that you also want to separate by color, choose the stain that most closely resembles the color you want. Please note that if you are looking to simply split a color image into red, green and blue components, use the **ColorToGray** module rather than **UnmixColors**. The question mark button to the right of Stain can help you choose the correct Stain.
es: **Nota:** Si hay otras celdas/componentes que también desea separar por color, elija la mancha que más se parezca al color que desea. Tenga en cuenta que si lo que desea es simplemente dividir una imagen en color en componentes rojo, verde y azul, utilice el módulo **ColorToGray** en lugar de **UnmixColors**. El botón con el signo de interrogación situado a la derecha de Mancha puede ayudarle a elegir la Mancha correcta.
pt_br: **Observação:** Se houver outras células/componentes que você também deseja separar por cor, escolha a mancha que mais se assemelha à cor desejada. Observe que, se estiver procurando simplesmente dividir uma imagem colorida em componentes vermelhos, verdes e azuis, use o módulo **ColorToGray** em vez de **UnmixColors**. O botão de ponto de interrogação à direita de Stain pode ajudá-lo a escolher o Stain correto.

source: **Tip: The image tools on the top toolbar may be helpful to see the details on your image/objects:**
es: **Consejo: Las herramientas de imagen de la barra de herramientas superior pueden ser útiles para ver los detalles de tu imagen/objetos:**
pt_br: **Dica: as ferramentas de imagem na barra de ferramentas superior podem ser úteis para ver os detalhes de sua imagem/objetos:**

source: The 1st icon from the left lets you reset the view back to the original view.
es: El primer icono de la izquierda le permite restablecer la vista original.
pt_br: O primeiro ícone da esquerda permite que você redefina a visualização de volta à visualização original.

source: The 2nd and 3rd icons let you step backwards and forwards through any changes you made to the view.
es: Los iconos 2 y 3 le permiten retroceder y avanzar por los cambios realizados en la vista.
pt_br: O segundo e o terceiro ícones permitem que você retroceda e avance nas alterações feitas na visualização.

source: The 4th icon lets you change the view by moving in any direction in the display, by clicking and dragging.
es: El 4º icono te permite cambiar la vista moviéndote en cualquier dirección de la pantalla, haciendo clic y arrastrando.
pt_br: O quarto ícone permite que você altere a visualização movendo-se em qualquer direção na tela, clicando e arrastando.

source: The 5th icon lets you change the view by zooming, by dragging and drawing a box to zoom in on.
es: El 5º icono te permite cambiar la vista haciendo zoom, arrastrando y dibujando un recuadro para ampliar.
pt_br: O quinto ícone permite que você altere a visualização por meio do zoom, arrastando e desenhando uma caixa para aumentar o zoom.

source: Zoom in on the image in order to see the quality of the separation.
es: Amplíe la imagen para ver la calidad de la separación.
pt_br: Amplie a imagem para ver a qualidade da separação.

source: Most of the time the Stain settings does a good job with the standard Stain, but If you are not happy with your results you can try different combinations of stains to match the structure/color you want to segment later.
es: La mayoría de las veces los ajustes de Tinte hacen un buen trabajo con el Tinte estándar, pero si no está contento con sus resultados puede probar diferentes combinaciones de tintes para igualar la estructura/color que desea segmentar más tarde.
pt_br: Na maioria das vezes, as configurações do Stain fazem um bom trabalho com o Stain padrão, mas se você não estiver satisfeito com os resultados, poderá tentar combinações diferentes de stains para combinar com a estrutura/cor que deseja segmentar posteriormente.

source: Right click the **UnmixColors** module and Duplicate the module in your pipeline.
es: Haga clic con el botón derecho en el módulo **UnmixColors** y Duplique el módulo en su pipeline.
pt_br: Clique com o botão direito do mouse no módulo **UnmixColors** e duplique o módulo em seu pipeline.

source: Change the Hematoxylin stain for Feulgen Stain and the Eosin Stain for Azocarmine. (remember to rename the output images to stay Hematoxylin and Eosin)
es: Cambie la tinción de Hematoxilina por la de Feulgen y la de Eosina por la de Azocarmina. (recuerde renombrar las imágenes de salida para que sigan siendo Hematoxilina y Eosina).
pt_br: Altere a coloração de hematoxilina para coloração de Feulgen e a coloração de eosina para azocarmina. (lembre-se de renomear as imagens de saída para que permaneçam Hematoxilina e Eosina)

source: Observe the difference between the first and the second separation.
es: Observa la diferencia entre la primera y la segunda separación.
pt_br: Observe a diferença entre a primeira e a segunda separação.

source: **Now let’s try another example of the same type of tissue and staining (Example 2 image):**
es: **Probemos ahora con otro ejemplo del mismo tipo de tejido y tinción (imagen del ejemplo 2):**
pt_br: **Agora vamos tentar outro exemplo do mesmo tipo de tecido e coloração (imagem do Exemplo 2):**

source: Please go back to your **Images** Module
es: Vuelva a su módulo **Imágenes**.
pt_br: Volte para seu módulo **Imagens**

source: 1. Clear the file list (Right click inside the file box -> click in the last option Clear File List)
es: 1. Borrar la lista de archivos (Click derecho dentro de la caja de archivos -&gt; click en la última opción Borrar Lista de Archivos)
pt_br: 1. Limpe a lista de arquivos (clique com o botão direito do mouse dentro da caixa de arquivos -&gt; clique na última opção Limpar lista de arquivos)

source: Drag and drop the Example 2 image.
es: Arrastre y suelte la imagen del Ejemplo 2.
pt_br: Arraste e solte a imagem do Exemplo 2.

source: Hit run to run your two **UnmixColors** modules to try to separate the hematoxylin from the eosin staining in this new example.
es: Pulse run para ejecutar sus dos módulos **UnmixColors** para intentar separar la hematoxilina de la tinción de eosina en este nuevo ejemplo.
pt_br: Pressione run para executar seus dois módulos **UnmixColors** para tentar separar a coloração de hematoxilina da coloração de eosina nesse novo exemplo.

source: **Common issue and troubleshooting:**
es: **Problemas comunes y solución de problemas:**
pt_br: **Problemas comuns e solução de problemas:**

source: Sometimes the same kind of tissue stained in different days or acquired in different illumination conditions will produce different patterns of absorbance and none of the Stain combinations results in a proper stain separation even in slides of similar tissues stained with the same dyes.
es: A veces, el mismo tipo de tejido teñido en diferentes días o adquirido en diferentes condiciones de iluminación producirá diferentes patrones de absorbancia y ninguna de las combinaciones de tinción da lugar a una separación adecuada de la tinción, incluso en portaobjetos de tejidos similares teñidos con los mismos colorantes.
pt_br: Às vezes, o mesmo tipo de tecido corado em dias diferentes ou adquirido em condições de iluminação diferentes produzirá padrões diferentes de absorbância e nenhuma das combinações de manchas resulta em uma separação adequada das manchas, mesmo em lâminas de tecidos semelhantes corados com os mesmos corantes.

source: If this happens, you can try other combinations, or choose the custom Stain option. In this case there are two options, input the RGB absorbance values if known or, far more commonly, estimate it using small cropped image regions where only one of your stains is present (region that contains the color absorbance of interest, purple and pink in this image).
es: Si esto ocurre, puede probar otras combinaciones, o elegir la opción Mancha personalizada. En este caso hay dos opciones, introducir los valores de absorbancia RGB si se conocen o, lo que es mucho más común, estimarlos utilizando pequeñas regiones recortadas de la imagen en las que sólo está presente una de sus manchas (región que contiene el color de absorbancia de interés, púrpura y rosa en esta imagen).
pt_br: Se isso acontecer, você poderá tentar outras combinações ou escolher a opção Mancha personalizada. Nesse caso, há duas opções: inserir os valores de absorbância RGB, se conhecidos, ou, o que é muito mais comum, estimá-los usando pequenas regiões da imagem cortadas em que apenas uma de suas manchas está presente (região que contém a absorbância da cor de interesse, roxo e rosa nessa imagem).

source: If you choose the second option, we suggest you make the cropped absorbance images in FIJI. (Open your image in FIJI, zoom in the region of interest and duplicate small regions where only one of your stains is present [in this case, one purple and another pink region] and save these images);
es: Si elige la segunda opción, le sugerimos que haga las imágenes de absorbancia recortadas en FIJI. (Abra su imagen en FIJI, haga zoom en la región de interés y duplique pequeñas regiones en las que sólo esté presente una de sus manchas [en este caso, una región púrpura y otra rosa] y guarde estas imágenes);
pt_br: Se você escolher a segunda opção, sugerimos que faça as imagens de absorbância recortadas no FIJI. (Abra sua imagem no FIJI, amplie a região de interesse e duplique pequenas regiões em que apenas uma de suas manchas esteja presente [nesse caso, uma região roxa e outra rosa] e salve essas imagens);

source: While we encourage you to do this step yourself in FIJI, we do provide reference images you can try (UnmixColorsTutorial/CustomReferenceImages/)
es: Aunque te animamos a que realices este paso tú mismo en FIJI, te proporcionamos imágenes de referencia que puedes probar (UnmixColorsTutorial/CustomReferenceImages/)
pt_br: Embora recomendemos que você realize essa etapa por conta própria no FIJI, fornecemos imagens de referência que você pode experimentar (UnmixColorsTutorial/CustomReferenceImages/)

source: CellProfiler can then use this to estimate your RGB absorbance.
es: CellProfiler puede entonces utilizar esto para estimar su absorbancia RGB.
pt_br: O CellProfiler pode então usar isso para estimar sua absorbância RGB.

source: Inside the **UnmixColors** module when you choose the **Custom Stain** option a new option will appear, the ‘Estimate absorbance from image’ button, so you can click on it and choose the purple or pink image to estimate the RGB absorbance. Cell Profiler will automatically calculate the absorbance for you.
es: Dentro del módulo **UnmixColors** cuando elija la opción **Custom Stain** aparecerá una nueva opción, el botón 'Estimate absorbance from image', para que pueda hacer clic en él y elegir la imagen púrpura o rosa para estimar la absorbancia RGB. Cell Profiler calculará automáticamente la absorbancia por usted.
pt_br: No módulo **UnmixColors**, quando você escolher a opção **Custom Stain**, aparecerá uma nova opção, o botão "Estimate absorbance from image" (Estimar absorbância da imagem), para que você possa clicar nele e escolher a imagem roxa ou rosa para estimar a absorbância RGB. O Cell Profiler calculará automaticamente a absorbância para você.

source: After Estimate both Stains you can now test the color separation using the Test Mode.
es: Después de Estimar ambas Manchas, ahora puede probar la separación de colores utilizando el Modo de Prueba.
pt_br: Depois de estimar os dois Stains, você pode testar a separação de cores usando o Modo de teste.

source: **Note:** If the resulting image doesn’t match your expectation you can try again using other regions to estimate your RGB absorbance.
es: **Nota:** Si la imagen resultante no coincide con sus expectativas puede intentarlo de nuevo utilizando otras regiones para estimar su absorbancia RGB.
pt_br: **Nota:** Se a imagem resultante não corresponder às suas expectativas, você poderá tentar novamente usando outras regiões para estimar sua absorbância RGB.

source: **Congratulations, you finished the Unmix Colors Tutorial.**
es: **Felicitaciones, terminaste el Tutorial de Desmezclar Colores.
pt_br: **Parabéns, você terminou o tutorial Unmix Colors.

source: **References:**
es: **Referencias:**
pt_br: **Referências:**
